Repository: sash-kan/debian-handbook-ru
Catalog: */00b_foreword.po
Languages: ru_ru

source: Foreword
ru_ru: Предисловие

source: Linux has been garnering strength for the last few years, and its growing popularity drives more and more users to make the jump. The first step on that path is to pick a distribution. This is an important decision, because each distribution has its own peculiarities, and future migration costs can be avoided if the right choice is made from the start.
ru_ru: В последние годы Linux стремительно развивается, а его растущая популярность привлекает всё новых и новых пользователей. Первый шаг на этом пути - выбор дистрибутива. Это важное решение, потому что каждый дистрибутив имеет свою специфику. И правильный выбор, сделанный на первых порах, позволит избежать дальнейших метаний между дистрибутивами.

source: <emphasis>BACK TO BASICS</emphasis> Linux distribution, Linux kernel
ru_ru: <emphasis>К ОСНОВАМ</emphasis> Распространение Linux. Ядро Linux

source: <primary>Linux</primary><secondary>kernel</secondary>
ru_ru: <primary>Ядро</primary><secondary>Linux</secondary>

source: <primary>Linux</primary><secondary>distribution</secondary>
ru_ru: <primary>дистрибутив</primary><secondary>Linux</secondary>

source: <primary>distribution</primary><secondary>Linux distribution</secondary>
ru_ru: <primary>дистрибутив</primary><secondary>Дистрибутив Linux</secondary>

source: Strictly speaking, Linux is only a kernel, the core piece of software sitting between the hardware and the applications.
ru_ru: Строго говоря, Linux - это только ядро, центральная система взаимодействия между железом и приложениями.

source: A “Linux distribution” is a full operating system; it usually includes the Linux kernel, an installer program, and most importantly applications and other software required to turn a computer into an actually useful tool.
ru_ru: “Дистрибутив Linux” это целая операционная система, которая обычно включает в себя ядро Linux, программу-установщик, наиболее важные приложения и прочее программное обеспечения, необходимые для работы за компьютером.

source: Debian GNU/Linux is a “generic” Linux distribution that fits most users. The purpose of this book is to show its many aspects so you can make an informed decision when choosing.
ru_ru: Debian GNU/Linux - это дистрибутив Linux, способный удовлетворить большинство пользователей. Цель этой книги - показать его черты, чтобы вы могли сделать взвешенное решение при выборе дистрибутива.

source: Why This Book?
ru_ru: Почему эта книга?

source: <emphasis>CULTURE</emphasis> Commercial distributions
ru_ru: <emphasis>Культура</emphasis> коммерческих дистрибутивов

source: <primary>distribution</primary><secondary>commercial distribution</secondary>
ru_ru: <primary>дистрибутивы</primary><secondary>коммерческие дистрибутивы</secondary>

source: Most Linux distributions are backed by a for-profit company that develops them and sells them under some kind of commercial scheme. Examples include <emphasis>Ubuntu</emphasis>, mainly developed by <emphasis>Canonical Ltd.</emphasis>; <emphasis>Mandriva Linux</emphasis>, by French company <emphasis>Mandriva SA</emphasis>; and <emphasis>Suse Linux</emphasis>, maintained and made commercially available by <emphasis>Novell</emphasis>.
ru_ru: Большинство дистрибутивов Linux, поддерживаются коммерческими компаниями, которые развивают и продают их. По такой схеме работают <emphasis>Canonical Ltd.</emphasis> с дистрибутивом <emphasis>Ubuntu</emphasis>; французская компания <emphasis>Mandriva SA</emphasis> и их дистрибутив <emphasis>Mandriva Linux</emphasis>; <emphasis>Novell</emphasis> с дистрибутивом <emphasis>Suse Linux</emphasis>.

source: At the other end of the spectrum lie the likes of Debian and the Apache Software Foundation (which hosts the development for the Apache web server). Debian is above all a project in the Free Software world, implemented by volunteers working together through the Internet.
ru_ru: Однако, такие проекты как Debian и Apache Software Foundation (которая развивает веб-сервер Apache) работают совершенно по иной схеме. Debian - это проект в мире свободного програмного обеспечения, разрабатываемый волонтёрами, работающими совместно через интернет.

source: Linux has gathered a fair amount of media coverage, which mostly benefits the distributions supported by a real marketing department — in other words, to company-backed distributions (Ubuntu, Red Hat, Suse, Mandriva, and so on). But Debian is far from being a marginal distribution; according to a German study made in early 2009, Debian is the most widely used distribution on servers (with nearly half of the responding companies having at least one Debian server), and the second most widely deployed on desktops (right behind Ubuntu, which is a Debian derivative). <ulink type="block" url="http://www.heise.de/open/artikel/Eingesetzte-Produkte-224518.html" />
ru_ru: Linux достаточно широко освещён в различных СМИ, что в большей степени заслуга дистрибутивов, продвигаемых рекламными отделами, иными словами коммерческими дистрибутивами (Ubuntu, Red Hat, Suse, Mandriva, и так далее). Но Debian далеко не второстепенный дистрибутив: согласно немецким исследованиям, проведённым в начале 2009, Debian наиболее широко используемый дистрибутив для серверов (около половины опрошенных компаний имеют по крайней мере один сервер с Debian), и второй по использованию на рабочих станциях (сразу за Ubuntu, который является производным от Debian). <ulink type="block" url="http://www.heise.de/open/artikel/Eingesetzte-Produkte-224518.html" />

source: The purpose of this book is to help you discover this distribution. We hope to share the experience we've gathered since we joined the project as developers and contributors in 1998 (Raphaël) and 2000 (Roland). With any luck, our enthusiasm will be communicative, and maybe you'll join us sometime…
ru_ru: Цель этой книги - помочь вам узнать этот дистрибутив. Мы хотим поделиться опытом, который мы получили, присоединившись к проекту, как участники и разработчики в 1998 (Рафаэль) и 2000 (Роланд). Если повезёт, вы заразитесь нашим энтузиазмом и, возможно, когда-нибудь присоединитесь к нам...

source: The first edition of this book (in 2004) served to fill a gaping hole: it was the first French-language book that focused exclusively on Debian. At that time, many other books were written on the topic both for French-speaking and English-speaking readers. Unfortunately almost none of them got updated, and today we again find ourselves in a situation where there are very few good books on Debian. We truly hope that this first English edition will fill this gap and help many users.
ru_ru: Первое издание этой книги (в 2004) было первой книгой на французском языке, полностью посвящённой Debian. В то время, было написано множество книг как для франкоговорящих, так и для англоговорящих читателей. К сожалению, большинство из них совсем не обновлялось. Поэтому мы снова оказались в ситуации, когда очень мало качественных актуальных книг по Debian. Мы надеемся, что это первое английское издание заполнит этот пробел и поможет многим пользователям.

source: Who Is this Book For?
ru_ru: Для кого эта книга?

source: We tried to make this book useful for many categories of readers. First, systems administrators (both beginners and experienced) will find explanations about the installation and deployment of Debian on many computers. They will also get a glimpse of most of the services available on Debian, along with matching configuration instructions and a description of the specifics coming from the distribution. Understanding the mechanisms involved in Debian's development will enable them to deal with unforeseen problems, knowing that they can always find help within the community.
ru_ru: Мы пытались сделать эту книгу полезной для всех категорий читателей. Системные администраторы (как начинающие, так и профессионалы) найдут инструкцию по установке и внедрении Debian на множество компьютеров, получат представление о большинстве сервисов, доступных в Debian, инструкции по их настройке и описание специфики дистрибутива. А понимание мезанизмов разработки Debian поможет решать непредвиденные проблемы. Так же помощь можно найти у сообщества.

source: Users of another Linux distribution, or of another Unix variant, will discover the specifics of Debian, and should become operational very quickly while benefitting fully from the unique advantages of this distribution.
ru_ru: Пользователи других дистрибутивов Linux или Unix систем узнают специфику Debian и сразу же смогут воспользоваться всеми преимуществами, присущими этому дистрибутиву.

source: Finally, readers who already have some knowledge of Debian and want to know more about the community behind it should see their expectations fulfilled. This book should make them much closer to joining us as contributors.
ru_ru: И, наконец, пользователи уже знакомые с Debian, желающие узнать больше о сообществе дистрибутива, не разочаруются в своих ожиданиях. Эта книга может значительно приблизить их к вступлению в сообщество разработчиков.

source: Chosen Approach
ru_ru: Выбранный подход

source: All of the generic documentation you can find about GNU/Linux also applies to Debian, since Debian includes most common free software. However, the distribution brings many enhancements, which is why we chose to primarily describe the “Debian way” of doing things.
ru_ru: Вся общая документация, которую вы можете найти о GNU/Linux так же относится и к Debian, так как Debian включает большую часть свободного программного обеспечения. Однако, дистрибутив привносит много усовершенствований, именно поэтому мы решили в первую очередь описывать “Debian way” (“путь Debian”) работы с дистрибутивом.

source: It is interesting to follow the Debian recommendations, but it is even better to understand their rationale. Therefore, we won't restrict ourselves to practical explanations only; we will also describe the project's workings, so as to provide you with comprehensive and consistent knowledge.
ru_ru: Весьма полезно следовать рекомендациям Debian, но гораздо лучше понять их причины. К тому же мы не ограничиваем себя исключительно практическими объяснениями, мы также описываем работу проекта, чтобы предоставить вам наиболее полные и всеохватывающие знания.

source: Book Structure
ru_ru: Структура книги

source: Following the structure and aims of Eyrolles' “Administrator's Handbook” collection, this book revolves around a case study providing both support and illustration for all topics being addressed.
ru_ru: В соответствии со структурой и задачами серии “Настольная книга администратора” издательства Eyerolles, эта книга предоставляет поддержку и иллюстрации ко всем обсуждаемым темам.

source: <emphasis>NOTE</emphasis> Web site, authors' email
ru_ru: <emphasis>ЗАМЕТКА</emphasis> Веб-сайт, e-mail авторов

source: This book has its own website, which hosts whatever elements that can make it more useful. In particular, it includes an online version of the book with clickable links, and possible errata. Feel free to browse it and to leave us some feedback. We will be happy to read your comments or support messages. Send them by email to <email>hertzog@debian.org</email> (Raphaël) and <email>lolando@debian.org</email> (Roland). <ulink type="block" url="http://debian-handbook.info/" />
ru_ru: Эта книга имеет собственный веб-сайт, который содержит множество полезный вещей. В частности, там есть онлайн версия книги с кликабельными ссылкам и возможными ошибками. Мы открыты для обратной связи и всегда рады прочитать ваши предложения или тёплые слова благодарности. Вы можете прислать их на почту <email>hertzog@debian.org</email> (Рафаэль) или <email>lolando@debian.org</email> (Роланд). <ulink type="block" url="http://debian-handbook.info/" />

source: <emphasis role="strong">Chapter 1</emphasis> focuses on a non-technical presentation of the Debian project and describes its goals and organization. These aspects are important because they define a general framework that others chapters will complete with more concrete information.
ru_ru: <emphasis role="strong">Глава 1</emphasis> посвящена нетехническому представлению проекта Debian и описанию его целей и организации. Эти вопросы очень важны, потому что они определяют общие направления, которые дополнятся более конкретнной информацией в последующих главах.

source: <emphasis role="strong">Chapters 2 and 3</emphasis> provide a broad outline of the case study. At this point, novice readers can take the time to read <emphasis role="strong">appendix B</emphasis>, where they'll find a short remedial course explaining a number of basic computing notions, as well as concepts inherent to any Unix system.
ru_ru: <emphasis role="strong">Главы 2 и 3</emphasis> освещают общие черты. На этом этапе новички могут обратиться к <emphasis role="strong">приложению B</emphasis>, где можно найти краткий курс, объясняющий основные компьютерные понятия, а так же положения, присущие любой Unix системе.

source: To get on with our real subject matter, we will quite naturally start with the installation process (<emphasis role="strong">chapter 4</emphasis>); <emphasis role="strong">chapters 5 and 6</emphasis> will unveil basic tools that any Debian administrator will use, such as those of the <emphasis role="strong">APT</emphasis> family, which is largely responsible for the distribution's excellent reputation. These chapters are in no way reserved to professionals, since everyone is their own administrator at home.
ru_ru: Чтобы перейти непосредственно к нашей теме, мы начнём с процесса установки (<emphasis role="strong">глава 4</emphasis>). <emphasis role="strong">Главы 5 и 6</emphasis> расскажет об основных инструментах, которые использует любой администратор Debian. Один из таких инструментов - инструменты семейства <emphasis role="strong">APT</emphasis>, от которых сильно зависит отличная репутация дистрибутива. Эти главы предназначены не только для профессионалов, потому что каждый является администратором своей собственной домашней системы.

source: <emphasis role="strong">Chapter 7</emphasis> will be an important parenthesis; it describes workflows to efficiently use documentation and to quickly gain an understanding of problems in order to solve them.
ru_ru: <emphasis role="strong">Глава 7</emphasis> является весьма важной главой. Она научит эффективно использовать документацию для понимания сути проблемы и её дальнейшего решения.

source: The next chapters will be a more detailed tour of the system, starting with basic infrastructure and services (<emphasis role="strong">chapters 8 to 10</emphasis>) and going progressively up the stack to reach the user applications in <emphasis>chapter 13</emphasis>. <emphasis role="strong">Chapter 12</emphasis> deals with more advanced subjects that will most directly concern administrators of large sets of computers (including servers), while <emphasis role="strong">chapter 14</emphasis> is a brief introduction to the wider subject of computer security and gives a few keys to avoid most problems.
ru_ru: Далее более детально рассмотрится система, начиная с базового устройства и сервисов (<emphasis role="strong">главы с 8 по 10</emphasis>) и повествование постепенно перейдёт к пользовательским приложением в <emphasis>главе 13</emphasis>. <emphasis role="strong">Глава 12</emphasis> описывает углублённые вещи, которые в большей степени относятся к администраторам большого количества машин (включая сервера), а краткое описание более широкой темы компьютерной безопасности и несколько рекомендаций по избежанию большинства проблем можно найти в <emphasis role="strong">главе 14</emphasis>.

source: <emphasis role="strong">Chapter 15</emphasis> is for administrators who want to go further and create their own Debian packages.
ru_ru: <emphasis role="strong">Глава 15</emphasis> предназначена для администраторов, желающих углубиться ещё больше и создавать собственные Debian пакеты.

source: <emphasis>VOCABULARY</emphasis> Debian package
ru_ru: <emphasis>СЛОВАРЬ</emphasis> Debian пакет

source: <primary>package</primary><secondary>Debian package</secondary>
ru_ru: <primary>пакет</primary><secondary>Debian пакет</secondary>

source: <primary>package</primary><secondary>binary package</secondary>
ru_ru: <primary>пакет</primary><secondary>бинарный пакет</secondary>

source: <primary>package</primary><secondary>source package</secondary>
ru_ru: <primary>пакет</primary><secondary>пакет с исходниками</secondary>

source: <primary>source package</primary>
ru_ru: <primary>пакет с исходниками</primary>

source: A Debian package is an archive containing all the files required to install a piece of software. It is generally a file with a <filename>.deb</filename> extension, and it can be handled with the <command>dpkg</command> command. Also called <emphasis>binary package</emphasis>, it contains files that can be directly used (such as programs or documentation). On the other hand, a <emphasis>source package</emphasis> contains the source code for the software and the instructions required for building the binary package.
ru_ru: Debian пакет - это архив, содержащий все файлы, необходимые для установки программного обеспечения. Это файл с расширением имени файла <filename>.deb</filename>, он может быть обработан командой <command>dpkg</command>. <emphasis>Бинарный пакет</emphasis> содержит файлы, которые могут быть использованы напрямую (программы или документация). С другой стороны <emphasis>пакет с исходниками</emphasis> содержит исходный код программного обеспечения и инструкции, необходимые для создания бинарного пакета.

source: The present English version is based on the fifth edition of the French book. This fifth edition was an important update, covering version 6.0 of Debian, code-named <emphasis role="distribution">Squeeze</emphasis>. Among the changes, Debian now sports two new architectures — <emphasis>kfreebsd-i386</emphasis> and <emphasis>kfreebsd-amd64</emphasis> — based on the FreeBSD kernel and supporting the associated technologies (<emphasis>jails</emphasis>, <emphasis>packet filter</emphasis> and so on). On Linux-based architectures, the 2.6.32 kernel extends support to all the main virtualization technologies (Xen/OpenVZ/LXC/KVM, see <xref linkend="sect.virtualization" />). All included packages have obviously been updated. Many improvements specifically target package maintainers, who can now use a simplified <filename>debian/rules</filename> (with debhelper's <command>dh</command> command); they also benefit from a standard patch management system integrated to <command>dpkg-source</command> (by using the <literal>3.0 (quilt)</literal> source package format).
ru_ru: Данная английская версия основана на пятом издании французской книги. Пятое издание было важным обновлением, которое относится к 6.0 версии Debian с кодовым именем <emphasis role="distribution">Squeeze</emphasis>. Среди прочих изменений, Debian теперь поддерживает две новые архитектуры - <emphasis>kfreebsd-i386</emphasis> и <emphasis>kfreebsd-amd64</emphasis> - основанные на ядре FreeBSD и поддерживают связанные технологии ((<emphasis>jails</emphasis>, <emphasis>packet filter</emphasis> и другие). На архитектурах, основанных на Linux, ядро 2.6.32 поддерживает все основные технологии виртуализации (Xen/OpenVZ/LXC/KVM, см. <xref linkend="sect.virtualization" />). Все включённые пакеты так же были обновлены. Многие улучшения были предназначены для мейнтйнеров пакетов, которые теперь используют успрощённый <filename>debian/rules</filename> (с командой <command>dh</command> из пакета debhelper). Так же улучшена система управления обновлениями, интегрированная в <command>dpkg-source</command> (с использованием формата пакетов с исходниками <literal>3.0 (quilt)</literal>).

source: We have added some notes and remarks in sidebars. They have a variety of roles: they can draw attention to a difficult point, complete a notion of the case study, define some terms, or serve as reminders. Here is a list of the most common of these sidebars:
ru_ru: Мы добавили некоторые заметки и ремарки. Они играют различную роль: они могу обратить внимание на трудные моменты, дополнить пример, объяснить термин или служить как напоминание. Вот список таких пометок.

source: BACK TO BASICS: a reminder for some information that is supposed to be known;
ru_ru: К ОСНОВАМ: напоминание о информации, которая, как предполагается, уже известна;

source: VOCABULARY: defines a technical term, sometimes Debian specific;
ru_ru: СЛОВАРЬ: определяет технический термин, порой специфичный для Debian;

source: COMMUNITY: highlights important persons or roles within the project;
ru_ru: СООБЩЕСТВО: подчёркивает важного человека или положение в проекте

source: POLICY: a rule or recommendation from the Debian Policy. This document is essential within the project, and describes how to package software. The parts of policy highlighted in this book bring direct benefits to users (for example, knowing that the policy standardizes the location of documentation and examples makes it easy to find them even in a new package).
ru_ru: ПОЛИТИКА: правило или рекомендация из политики Debian. Этот документ - неотъемлемая часть проекта. Он описывает как подготавливать программное обеспечение для упаковки в пакеты. Части документа, подсвеченные в этой книге, могут принести пользу и пользователям (например, знание полоитики стандартов размещения документации и примеров позволяет легко их найти даже в незнакомых пакетах).

source: TOOL: presents a relevant tool or service;
ru_ru: ИНСТРУМЕНТ: представляет полезный инструмент или сервис;

source: IN PRACTICE: theory and practice do not always match; these sidebars contain advice resulting from our experience. They can also give detailed and concrete examples;
ru_ru: НА ПРАКТИКЕ: теория и практика не всегда соотвествуют, поэтому подобные заметки содержат советы, основанные на нашем опыте. Они также дают подробные и конкретные примеры;

source: other more or less frequent sidebars are rather explicit: CULTURE, TIP, CAUTION, GOING FURTHER, SECURITY, and so on.
ru_ru: другие менее часто встречаемые заметки: КУЛЬТУРА, ПОДСКАЗКА, ВНИМАНИЕ, УГЛУБЛЯЕТСЯ, БЕЗОПАСНОСТЬ и так далее.

source: Acknowledgments
ru_ru: Благодарности

source: A Bit of History
ru_ru: Немного истории

source: In 2003, Nat Makarevitch contacted me (Raphaël) because he wanted to publish a book on Debian in the <foreignphrase>Cahier de l'Admin</foreignphrase> (Admin's Handbook) collection that he was managing for Eyrolles, a leading French editor of technical books. I immediately accepted to write it. The first edition came out on 14th October 2004 and was a huge success — it was sold out barely four months later.
ru_ru: В 2003 Нат Макаревич связался со мной (Рафаэль), потому что он хотел опубликовать книгу о Debian в серии <foreignphrase>Cahier de l'Admin</foreignphrase> (настольная книга администратора), которой он занимался для ведущего французского издателя технических книг Eyrolles. Я незамедлительно согласился написать её. Первое издание вышло 14 октября 2004 и имело огромный успех - оно было полностью распродано за 4 месяца.

source: Since then, we have released 4 other editions of the French book, one for each subsequent Debian release. Roland Mas, who started working on the book as my proofreader, gradually became its co-author.
ru_ru: С тех пор мы выпустили 4 других издания французской книги, по одной на каждый релиз Debian. Роланд Маз, который начинал работать над книгой как корректор, превратился в со-автора.
