Repository: sash-kan/debian-handbook-ru
Catalog: */00b_foreword.po
Languages: ru_ru

source: While we were obviously satisfied with the book's success, we always hoped that Eyrolles would convince an international editor to translate it into English. We had received numerous comments explaining how the book helped people to get started with Debian, and we were keen to have the book benefit more people in the same way.
ru_ru: Книга имела несомненный успех и мы всегда надеялись, что Eyrolles убедит международного издателя перевести книгу на английский. Мы получили ряд отзывов, рассказывающих как книга помогла познакомиться с Debian и мы хотели получить книгу, которая сможет помочь большему числу людей тем же способом.

source: Alas, no English-speaking editor that we contacted was willing to take the risk of translating and publishing the book. Not put off by this small setback, we decided to negotiate with our French editor Eyrolles to recuperate the necessary rights to translate the book into English and to try to publish it ourselves.
ru_ru: Увы, ни один англоязычный издатель, с которым мы связывались не захотел брать риски по переводу и публикации книги. Но мы не опустили руки и решили договориться с французским издательством Eyrolles для получения прав необходимых для перевод книги на английский с последующей публикацией собственными силами.

source: A Crowd-Funded Translation
ru_ru: Перевод на народные деньги

source: Translating a book of 450 pages is a considerable effort that requires several months of work. For self-employed people like Roland and me, we had to ensure a minimum income to mobilize the time necessary to complete the project. So we set up a crowd-funding campaign on Ulule and asked people to pledge money towards the project. <ulink type="block" url="http://www.ulule.com/debian-handbook/" />
ru_ru: Перевод 450страничной книги требует значительных усилий и несколькх месяцев работы. Поскольку Роланд и я - простые люди, то мы должны были обеспечить минимальный доход для завершения работы. Поэтому мы открыли кампанию на Ulule и попросили людей финансировать наш проект. <ulink type="block" url="http://www.ulule.com/debian-handbook/" />

source: The campaign had two goals: raising €15,000 for the translation and completing a €25,000 liberation fund to get the resulting book published under a free license — that is, a license that fully follows the Debian Free Software Guidelines.
ru_ru: Кампания имела 2 цели: превысить порог в €15,000 для перевода и порог в €25,000 для выпуска перевода под свободной лицензий. Эта лицензия полностью соответствует руководствам по свободному програмному обеспечению Debian.

source: When the Ulule campaign ended, the first goal had been achieved with €24,345 raised. The liberation fund was not complete however, with only €14,935 raised. As initially announced, the liberation campaign continued independently from Ulule on the book's official website.
ru_ru: Когда кампания на Ulule закончилась была достигнута отметка в €24,345. Однако освобождение не было закончено и остановилось на €14,935. Как было первоначально объявлено, кампания по освобождению продолжилась независимо от Ulule на официальном сайте книги.

source: While we were busy translating the book, donations towards the liberation continued to flow in… And in April 2012, the liberation fund was completed. You can thus benefit from this book under the terms of a free license.
ru_ru: Пока мы были заняты переводом, пожертвования на освобождение продолжалось. В апреле 2012 особождение успешно завершилось, поэтому вы можете пользоваться этой книгой под свободной лицензией.

source: We would like to thank everybody who contributed to these fundraising campaigns, either by pledging some money or by passing the word around. We couldn't have done it without you.
ru_ru: Мы хотели бы поблагодарить каждого, кто принимал участие в этих кампаниях, кто помог с финансированием или советом. Мы бы не смогли сделать этого без вас.

source: Supportive Companies and Organizations
ru_ru: Поддержка компаний и организаций

source: We had the pleasure of getting significant contributions from many free software-friendly companies and organizations. Thank you to <ulink url="http://www.codelutin.com">Code Lutin</ulink>, <ulink url="http://eof.eu.org">École Ouverte Francophone</ulink>, <ulink url="http://www.evolix.fr">Evolix</ulink>, <ulink url="http://www.fantinibakery.com">Fantini Bakery</ulink>, <ulink url="http://fsffrance.org">FSF France</ulink>, <ulink url="http://www.offensive-security.com">Offensive Security</ulink> (the company behind <ulink url="http://www.backtrack-linux.org">BackTrack Linux</ulink>), <ulink url="http://www.opensides.be">Opensides</ulink>, <ulink url="http://www.proxmox.com">Proxmox Server Solutions Gmbh</ulink>, SSIELL (Société Solidaire d'Informatique En Logiciels Libres), and <ulink url="http://www.syminet.com">Syminet</ulink>.
ru_ru: Мы были обрадованы значительным вкладом многих компаний и организаций дружественных миру свободного программного обеспечения. Спасибо <ulink url="http://www.codelutin.com">Code Lutin</ulink>, <ulink url="http://eof.eu.org">École Ouverte Francophone</ulink>, <ulink url="http://www.evolix.fr">Evolix</ulink>, <ulink url="http://www.fantinibakery.com">Fantini Bakery</ulink>, <ulink url="http://fsffrance.org">FSF France</ulink>, <ulink url="http://www.offensive-security.com">Offensive Security</ulink> (компания, занимающаяся <ulink url="http://www.backtrack-linux.org">BackTrack Linux</ulink>), <ulink url="http://www.opensides.be">Opensides</ulink>, <ulink url="http://www.proxmox.com">Proxmox Server Solutions Gmbh</ulink>, SSIELL (Société Solidaired'Informatique En Logiciels Libres) и <ulink url="http://www.syminet.com">Syminet</ulink>.

source: We would also like to thank <ulink url="http://www.omgubuntu.co.uk">OMG! Ubuntu</ulink> and <ulink url="http://www.april.org">April</ulink> for their help in promoting the operation.
ru_ru: Мы так же хотим поблагодарить <ulink url="http://www.omgubuntu.co.uk">OMG! Ubuntu</ulink> и <ulink url="http://www.april.org">April</ulink> за их содействие в этом проекте.

source: Individual Supporters
ru_ru: Частные меценаты

source: With over 650 supporters in the initial fundraising, and several hundred more in the continued liberation campaign, it is thanks to people like you that this project has been possible. Thank you!
ru_ru: Мы благодарим более 650 сторонников в первоначальном сборе и несколько сотен принявших участие в продолжившейся кампании по освобождению. Без них этот проект не увидел бы свет. Спасибо!

source: We want to address our special thanks to those who contributed at least €35 (sometimes much more!) to the liberation fund. We are glad that there are so many people who share our values about freedom and yet recognize that we deserved a compensation for the work that we have put into this project.
ru_ru: Мы хотим выразить отдельную благодарность людяи, пожертвовавшим по меньшей мере €35 (а порой гораздо больше!) за выпуск книги под свободной лицензией. Мы очень рады, что так много людей разделяют наши взгляды на свободу и понимают, что мы заслуживаем компенсацию за наши труды, вложенные в этот проект.

source: So thank you Alain Coron, Alain Thabaud, Alan Milnes, Alastair Sherringham, Alban Dumerain, Alessio Spadaro, Alex King, Alexandre Dupas, Ambrose Andrews, Andre Klärner, Andreas Olsson, Andrej Ricnik, Andrew Alderwick, Anselm Lingnau, Antoine Emerit, Armin F. Gnosa, Avétis Kazarian, Bdale Garbee, Benoit Barthelet, Bernard Zijlstra, Carles Guadall Blancafort, Carlos Horowicz — Planisys S.A., Charles Brisset, Charlie Orford, Chris Sykes, Christian Bayle, Christian Leutloff, Christian Maier, Christian Perrier, Christophe Drevet, Christophe Schockaert (R3vLibre), Christopher Allan Webber, Colin Ameigh, Damien Dubédat, Dan Pettersson, Dave Lozier, David Bercot, David James, David Schmitt, David Tran Quang Ty, Elizabeth Young, Fabian Rodriguez, Ferenc Kiraly, Frédéric Perrenot — Intelligence Service 001, Fumihito Yoshida, Gian-Maria Daffré, Gilles Meier, Giorgio Cittadini, Héctor Orón Martínez, Henry, Herbert Kaminski, Hideki Yamane, Hoffmann Information Services GmbH, Holger Burkhardt, Horia Ardelean, Ivo Ugrina, Jan Dittberner, Jim Salter, Johannes Obermüller, Jonas Bofjäll, Jordi Fernandez Moledo, Jorg Willekens, Joshua, Kastrolis Imanta, Keisuke Nakao, Kévin Audebrand, Korbinian Preisler, Kristian Tizzard, Laurent Bruguière, Laurent Hamel, Leurent Sylvain, Loïc Revest, Luca Scarabello, Lukas Bai, Marc Singer, Marcelo Nicolas Manso, Marilyne et Thomas, Mark Janssen — Sig-I/O Automatisering, Mark Sheppard, Mark Symonds, Mathias Bocquet, Matteo Fulgheri, Michael Schaffner, Michele Baldessari, Mike Chaberski, Mike Linksvayer, Minh Ha Duong, Moreau Frédéric, Morphium, Nathael Pajani, Nathan Paul Simons, Nicholas Davidson, Nicola Chiapolini, Ole-Morten, Olivier Mondoloni, Paolo Innocenti, Pascal Cuoq, Patrick Camelin, Per Carlson, Philip Bolting, Philippe Gauthier, Philippe Teuwen, PJ King, Praveen Arimbrathodiyil (j4v4m4n), Ralf Zimmermann, Ray McCarthy, Rich, Rikard Westman, Robert Kosch, Sander Scheepens, Sébastien Picard, Stappers, Stavros Giannouris, Steve-David Marguet, T. Gerigk, Tanguy Ortolo, Thomas Hochstein, Thomas Müller, Thomas Pierson, Tigran Zakoyan, Tobias Gruetzmacher, Tournier Simon, Trans-IP Internet Services, Viktor Ekmark, Vincent Demeester, Vincent van Adrighem, Volker Schlecht, Werner Kuballa, Xavier Neys, and Yazid Cassam Sulliman.
ru_ru: Итак, наша особая благодарность следующим людям: Алайн Корон, Алайн Тобод, Алан Мильнс, Алестер Шерингхам, Албан Дамрейн, Алессио Спарадо, Алекс Кинг, Александр Дюпас, Амброс Андрюс, Андре Клярнер, Андреас Олссон, Андрей Рикник, Андрей Альдервик, Ансельм Лигно, Антуан Эмерит, Армин Ф. Гноса, Аветис Казариан, Бдаль Гарби, Бенуа Бартеле, Бернард Жильстра, Карл Годаль Бланкафорт, Карлос Хорович — Planisys S.A., Чарльз Бриссет, Чарли Орфорд, Крис Сайкс, Кристиан Бэйль, Кристиан Лейтлоф, Кристиан Майер, Кристиан Перье, Кристоф Древе, Кристов Шокарт (R3vLibre), Кристофер Аллан Веббер, Колин Ами, Дамьен Дюбеда, Дэн Петтерсон, Дэйв Лозьер, Дэвид Беркот, Дэвид Джеймс, Дэвид Шмит, Дэвид Тран Куанг Тай, Элизабет Янг, Фабьен Родригез, Ферекн Киралай, Фредерик Перрено — Intelligence Service 001, Фумито Йошида, Жан-Мариа Даффре, Жиль Майер, Жоржио Читтадини, Гектор Орон Мартинез, Генри, Гербрерт Камински, Хидеки Яман, Hoffmann Information Services GmbH, Хольгер Брукхарт, Хориа Арделин, Иво Угрина, Жан Диттебернер, Джим Сальтер, Йоханнес Обермюллер, Йонас Боржал, Жорди Фернандес Моледо, Йорг Виллекенс, Йошуа, Кастроллис Иманта, Кейсуке Накао, Кевин Одебранд, Корбиниан Прейслер, Кристиан Тиззард, Лорен Брюжер, Лорен Хамель, Лорен Сильвиан, Луик Ревест, Лука Скарабелло, Лукас Бай, Марк Сингер, Марчело Николас Мансо, Мэрилин Томас, Марк Йансен — Sig-I/O Automatisering, Марк Шеппард, Марк Саймондс, Матиас Боке, Матео Фальгери, Майкл Шаффнер, Мишель Болдессари, Майк Чаберски, Майк Линксвайер, Мин Ха Дон, Моро Фредерис, Морфиум, Натаел Пажани, Натан Пол Саймонс, Николя Давидсон, Николя Чиаполини, Оле-Мортен, Оливьер Мондолони, Паоло Иннокенти, Паскаль Сиок, Патрик Камелин, Пер Карлсон, Филип Болтинг, Филиппе Готьер, Филиппе Тейвень, ПЖ Кинг, Правин Арибратодил (j4v4m4n), Ральф Зимерман, Рэй Маккарти, Рик, Рикард Вестман, Роберт Коч, Сандер Шипенс, Себастьян Пикард, Стапперс, Ставрос Гинорис, Стив-Дэйвид Марго, Т. Грижк, Тангу Ортоло, Томас Хочстейн, Томас Мюллер, Томас Пирсон, Тигран Закоян, Тоби Грютмахер, Турне Симон, Trans-IP Internet Services, Виктор Экмарк, Винсент Демистер, Винсент ван Адригем, Волкер Члехт, Вернер Кубалла, Ксавьер Нис и Язид Гассам Сулейман.

source: Special Thanks to Contributors
ru_ru: Особая благодарность участникам

source: This book would not be what it is without the contributions of several persons who each played an important role. We would like to thank Marilyne Brun, who helped us to translate the sample chapter and who worked with us to define some common translation rules. She also revised several chapters which were desperately in need of supplementary work. Thank you to Anthony Baldwin (of Baldwin Linguas) who translated several chapters for us.
ru_ru: Эта книга не была бы именно такой без участия нескольких участников, каждый из которых играл очень важную роль. Мы хотели бы поблагодарить Мэрилин Брун, которая помогала переводить выборочные разделы и работа над определением общих правил перевода. Она так же переработала несколько глав, которые нуждались в серьёзной корректировке. Спасибо Антону Балдвину (из Baldwin Linguas), который перевёл несколько глав для нас.

source: We benefited from the generous help of proofreaders: Daniel Phillips, Gerold Rupprecht, Gordon Dey, Jacob Owens, and Tom Syroid. They each reviewed many chapters. Thank you very much!
ru_ru: Мы так же благодарны нашим корректорам: Дэниел Филлипс, Гаролдь Рупрехт, Гордон Дэй, Якоб Оуенс и Том Сиройд. Каждый из них рецензировал множество глав.

source: If you have the pleasure to read these lines in a paperback copy of the book, then you should join us to thank Benoît Guillon, Jean-Côme Charpentier, and Sébastien Mengin who worked on the interior book design. Benoît is the upstream author of <ulink url="http://dblatex.sourceforge.net">dblatex</ulink> — the tool we used to convert DocBook into LaTeX (and then PDF). Sébastien is the designer who created this nice book layout and Jean-Côme is the LaTeX expert who implemented it as a stylesheet usable with dblatex. Thank you guys for all the hard work!
ru_ru: Если вы читаете эти строки на бумажной копии книги, то вам стоит поблагодарить Бенуа Гильона, Жан-Ком Шарпентьера и Себастьяна Менгина. Они работали над дизайном книги. Бенуа так же является автором <ulink url="http://dblatex.sourceforge.net">dblatex</ulink> (утилита для конвертирования DocBook в LaTeX (а затме в PDF). Себастьян сверстал книгу, а Жан-Ком - эксперт LaTeX, разработал стили совместимые с dblatex. Спасибо за ваш тяжёлый труд!

source: Finally, thank you to Thierry Stempfel for the nice pictures introducing each chapter, and thank you to Doru Patrascu for the beautiful book cover.
ru_ru: Ну и наконец мы хотели бы поблагодарить Тьери Стампфеля за прекрасные изображения перед началом каждой главы и Дору Патраску за великолепную обложку книги.

source: Personal Acknowledgments from Raphaël
ru_ru: Персональные благодарности от Рафаэля

source: First off, I would like to thank Nat Makarevitch, who offered me the possibility to write this book and who provided strong guidance during the year it took to get it done. Thank you also to the fine team at Eyrolles, and Muriel Shan Sei Fan in particular. She has been very patient with me and I learned a lot with her.
ru_ru: Прежде всего я бы хотел поблагодарить Нат Макаревич, кто предоставил мне возможно написать эту книгу и кто руководил проектом в течении всей работы. Спасибо отличной команде Eyrolles и Мюрей Шан Сей Фан в частности. Она всегда была очень терпеливой ко мне и я многому у неё научился.

source: The period of the Ulule campaign was very demanding for me but I would like to thank everybody who helped to make it a success, and in particular the Ulule team who reacted very quickly to my many requests. Thank you also to everybody who promoted the operation. I don't have any exhaustive list (and if I had it would probably be too long) but I would like to thank a few people who were in touch with me: Joey-Elijah Sneddon and Benjamin Humphrey of OMG! Ubuntu, Frédéric Couchet of April.org, Jake Edge of Linux Weekly News, Clement Lefebvre of Linux Mint, Ladislav Bodnar of Distrowatch, Steve Kemp of Debian-Administration.org, Christian Pfeiffer Jensen of Debian-News.net, Artem Nosulchik of LinuxScrew.com, Stephan Ramoin of Gandi.net, Matthew Bloch of Bytemark.co.uk, the team at Divergence FM, Rikki Kite of Linux New Media, Jono Bacon, the marketing team at Eyrolles, and numerous others that I have forgotten (sorry about that).
ru_ru: Кампания на Ulule была крайне необходима, и я хочу поблагодарить всех, кто помог прийти нам к успеху и особенно команду Ulule, которая очень оперативно откликались на множество моих обращений. Так же я хочу выразить благодарность всем, кто помогал в этом проекте. У меня нет полного списка людей (а если бы и был, то он был бы невероятно длинным), но я хочу поблагодарить нескольких людей, которые были со мной: Джоуи-Элийя Снеддон и Бенжамин Намфри из OMG! Ubuntu, Фредерик Кочет из April.org, Жак Идж из Linux Weekly News, Клемент Лефёбвр из Linux Mint, Ладислав Боднарь из Distrowatch, Стив Кемп из Debian-Administration.org, Кристиан Пфейфер Йенсен из Debian-News.net, Артём Носульчик из LinuxScrew.com, Стефан Рамон из Gandi.net, Мэттью Блох из Bytemark.co. uk, команду Divergence FM, Рикки Кайт из Linux New Media, Джоно Бэёкон, рекламный отдел Eyrolles и всех остальных, кого я забыл (прошу прощения за это).

source: I would like to address a special thanks to Roland Mas, my co-author. We have been collaborating on this book since the start and he has always been up to the challenge. And I must say that completing the Debian Administrator's Handbook has been a lot of work…
ru_ru: Ещё я хотел бы выразить особую благодарность Роланду Масу, моему соавтору. Мы работали вместе над этой книгой с самого начала и он всегда был в курсе всех событий. И я должен сказать, что для написания Настольной книги администратора Debian было приложено немало усилий.

source: Last but not least, thank you to my wife, Sophie. She has been very supportive of my work on this book and on Debian in general. There have been too many days (and nights) when I left her alone with our 2-year-old son to make some progress on the book. I am grateful for her support and know how lucky I am to have her.
ru_ru: Последнее, но не менее важное: спасибо моей жене Софи. Она очень поддерживала меня в период работы над книгой и вообще в работе с прокетом Debian. Было слишком много дней (и ночей), когда мне приходилось оставлять её одну с двухлетним сыном, чтобы немного поработать над книгой. Я очень признателен за поддержку и я счастлив, что она есть у меня.

source: Personal Acknowledgments from Roland
ru_ru: Персональные благодарности от Роланда

source: Well, Raphaël preempted most of my “external” thank-yous already. I am still going to emphasize my personal gratitude to the good folks at Eyrolles, with whom collaboration has always been pleasant and smooth. Hopefully the results of their excellent advice hasn't been lost in translation.
ru_ru: Рафаэль уже успел поблагодарить многих людей с которыми работал и я. Но я всё же выражу мою персональную благодарность замечательным людям из Eyrolles, сотрудничать с которыми всегда очень приятно. Надеюсь их ценные советы не потеряются в процессе перевода.

source: I am extremely grateful to Raphaël for taking on the administrative part of this English edition. From organizing the funding campaign to the last details of the book layout, producing a translated book is so much more than just translating and proofreading, and Raphaël did (or delegated and supervised) it all. So thanks.
ru_ru: Я безмерно благодарен Рафаэлю за принятие управленчиских обязанностей английского издания на себя. Всё, от организации сбора денег до вопросов вёрстки, выпуска перевод и множество других вопросов за рамками непосредственно перевода и корректировки делал Рафаэль. Спасибо!

source: Thanks also to all who more or less directly contributed to this book, by providing clarifications or explanations, or translating advice. They are too many to mention, but most of them can usually be found on various #debian-* IRC channels.
ru_ru: Спасибо всем, кто в большей или меньшей степени помога в работе над книгой пояснением, объяснением или советом по переводу. Их очень много, но большинство из них можно найти на различных IRC каналах #debian-*

source: There is of course some overlap with the previous set of people, but specific thanks are still in order for the people who actually do Debian. There wouldn't be much of a book without them, and I am still amazed at what the Debian project as a whole produces and makes available to any and all.
ru_ru: Конечно среди следующих людей есть уже упомянутые ранее, но особая благодарность людям который разрабатывают Debian. Без них не было бы этой книги и я до сих пор изумляюсь как проект Debian разрабатывается и доступен всем и каждому.

source: More personal thanks go to my friends and my clients, for their understanding when I was less responsive because I was working on this book, and also for their constant support, encouragement and egging on. You know who you are; thanks.
ru_ru: Так же особую благодарность я выражаю всем моим друзьям и клиентам, которые понимали, что я серьёзно загружен из-за работы над книгой, за их поддержку и воодушевления. Вы сами знаете что это вы. Спасибо!

source: And finally; I am sure they would be surprised by being mentioned here, but I would like to extend my gratitude to Terry Pratchett, Jasper Fforde, Tom Holt, William Gibson, Neal Stephenson, and of course the late Douglas Adams. The countless hours I spent enjoying their books are directly responsible for my being able to take part in translating this one.
ru_ru: И в заключении, я бы хотел поблагодарить Терри Пратчета, Джаспера Ффорда, Тома Хольта, Вильма Гибсона, Нила Стивенсона и, конечно же, Дугласа Адамса, хотя они и очень удивятся, увидев свои имена здесь. Те бесчисленные часы, которые я провёл за чтением их книг, дали мне возможность принять участие в этом переводе.
