Repository: sash-kan/debian-handbook-ru
Catalog: */06_apt.po
Languages: ru_ru

source: When APT checks <filename>/etc/apt/preferences</filename>, it first takes into account the most specific entries (often those specifying the concerned package), then the more generic ones (including for example all the packages of a distribution). If several generic entries exist, the first match is used. The available selection criteria include the package's name and the source providing it. Every package source is identified by the information contained in a <filename>Release</filename> file that APT downloads together with the <filename>Packages.gz</filename> files. It specifies the origin (usually “Debian” for the packages of official mirrors, but it can also be a person's or an organization's name for third-parties repositories). It also gives the name of the distribution (usually <emphasis role="distribution">Stable</emphasis>, <emphasis role="distribution">Testing</emphasis>, <emphasis role="distribution">Unstable</emphasis> or <emphasis role="distribution">Experimental</emphasis> for the standard distributions provided by Debian) together with its version (for example 5.0 for Debian <emphasis role="distribution">Lenny</emphasis>). Let's have a look at its syntax through some realistic case studies of this mechanism.
ru_ru: Когда APT проверяет файл <filename>/etc/apt/preferences</filename>, то сначала применяются наиболее характерные записи (зачастую те, что указывают на определённый пакет), а затем уже более общие (включающие, например, все пакеты дистрибутива). Если в файле встречаются несколько записей общего характера, то используется только первое совпадение. Доступные критерии выбора включают в себя имя пакета и источник, предоставляющий его. Каждый источник пакетов идентифицируется по информации, содержащейся в файле <filename>Release</filename>, который APT загружает одновременно с файлами <filename>Packages.gz</filename>. Он указывает происхождение (обычно “Debian” для пакетов из официального зеркала, но он также может быть именем частного лица или организации для репозиториев третьих лиц). Он также содержит имя дистрибутива (обычно <emphasis role="distribution">Stable</emphasis>, <emphasis role="distribution">Testing</emphasis>, <emphasis role="distribution">Unstable</emphasis> или <emphasis role="distribution">Experimental</emphasis> для стандартных дистрибутивов, предоставляемых Debian) и его версию (например, 5.0 для Debian <emphasis role="distribution">Lenny</emphasis>). Давайте посмотрим на синтаксис этого файла в нескольких реальных примерах использования данного механизма.

source: <emphasis>SPECIFIC CASE</emphasis> Priority of <emphasis role="distribution">experimental</emphasis>
ru_ru: <emphasis>ОСОБЫЙ СЛУЧАЙ</emphasis> Приоритет <emphasis role="distribution">experimental</emphasis>

source: If you listed <emphasis role="distribution">Experimental</emphasis> in your <filename>sources.list</filename> file, the corresponding packages will almost never be installed because their default APT priority is 1. This is of course a specific case, designed to keep users from installing <emphasis role="distribution">Experimental</emphasis> packages by mistake. The packages can only be installed by typing <command>aptitude install <replaceable>package</replaceable>/experimental</command> — users typing this command can only be aware of the risks that they take. It is still possible (though <emphasis>not</emphasis> recommended) to treat packages of <emphasis role="distribution">Experimental</emphasis> like those of other distributions by giving them a priority of 500. This is done with a specific entry in <filename>/etc/apt/preferences</filename>:
ru_ru: Если вы добавили <emphasis role="distribution">Experimental</emphasis> в ваш файл <filename>sources.list</filename>, то соответствующие пакеты практически никогда не будут установлены по той причине, что их приоритет APT равен 1. Это, разумеется, особый случай, призванный предотвратить ошибочную установку пакетов из <emphasis role="distribution">Experimental</emphasis>. Эти пакеты могут быть установлены только командой <command>aptitude install <replaceable>package</replaceable>/experimental</command> - пользователи, вводящие данную команду, должны осознавать возможный риск. Обрабатывать пакеты из <emphasis role="distribution">Experimental</emphasis> как из других дистрибутивов по-прежнему возможно, если устанавливать для них приоритет 500 (хотя это и <emphasis>не</emphasis> рекомендуется). Этого можно добиться внесением особой записи в <filename>/etc/apt/preferences</filename>:

source: Let's suppose that you only want to use packages from the stable version of Debian. Those provided in other versions should not be installed except if explicitly requested. You could write the following entries in the <filename>/etc/apt/preferences</filename> file:
ru_ru: Давайте предположим, что вы хотите использовать пакеты только из стабильной версии Debian. Те пакеты, что предоставляются другими версиями, не должны устанавливаться за исключением тех случаев, когда это явно указано. Вы можете оставить следующие записи в файле <filename>/etc/apt/preferences</filename>:

source: <literal>a=stable</literal> defines the name of the selected distribution. <literal>o=Debian</literal> limits the scope to packages whose origin is “Debian”.
ru_ru: <literal>a=stable</literal> определяет имя выбранного дистрибутива. <literal>o=Debian</literal> ограничивает выбор пакетов теми, что имеют происхождение “Debian”.

source: Let's now assume that you have a server with several local programs depending on the version 5.10 of Perl and that you want to ensure that upgrades will not install another version of it. You could use this entry:
ru_ru: Давайте теперь предположим, что у вас есть сервер с несколькими локальными программами, зависящими от Perl версии 5.10, и вы хотите удостовериться, что обновление не установит иную версию Perl. Вы можете использовать следующую запись:

source: The reference documentation for this configuration file is available in the manual page <citerefentry><refentrytitle>apt_preferences</refentrytitle><manvolnum>5</manvolnum></citerefentry>, which you can display with <command>man apt_preferences</command>.
ru_ru: Справочная документация по этому конфигурационному файлу доступна на страницах руководства <citerefentry><refentrytitle>apt_preferences</refentrytitle><manvolnum>5</manvolnum></citerefentry>, которое вы можете вывести командой <command>man apt_preferences</command>.

source: <emphasis>TIP</emphasis> Comments in <filename>/etc/apt/preferences</filename>
ru_ru: <emphasis>СОВЕТ</emphasis> Комментарии в <filename>/etc/apt/preferences</filename>

source: There is no official syntax to put comments in the <filename>/etc/apt/preferences</filename> file, but some textual descriptions can be provided by putting one or more “<literal>Explanation</literal>” fields at the start of each entry:
ru_ru: Не существует официального синтаксиса для добавления комментариев в файл <filename>/etc/apt/preferences</filename>, но некоторое текстовое описание можно разместить в одном или нескольких полях <literal>Explanation</literal> в начале каждой секции:

source: Working with Several Distributions
ru_ru: Работа с несколькими дистрибутивами

source: <command>aptitude</command> being such a marvelous tool, it is tempting to pick packages coming from other distributions. For example, after having installed a <emphasis role="distribution">Stable</emphasis> system, you might want to try out a software package available in <emphasis role="distribution">Testing</emphasis> or <emphasis role="distribution">Unstable</emphasis> without diverging too much from the system's initial state.
ru_ru: Такой изумительный инструмент как <command>aptitude</command> искушает к использованию пакетов из других дистрибутивов. Например, после установки системы из ветки <emphasis role="distribution">Stable</emphasis>, вам захочется попробовать программы, доступные в <emphasis role="distribution">Testing</emphasis> или <emphasis role="distribution">Unstable</emphasis>, при этом не слишком отклоняясь от первоначального состояния системы.

source: Even if you will occasionally encounter problems while mixing packages from different distributions, <command>aptitude</command> manages such coexistence very well and limits risks very effectively. The best way to proceed is to list all distributions used in <filename>/etc/apt/sources.list</filename> (some people always put the three distributions, but remember that <emphasis role="distribution">Unstable</emphasis> is reserved for experienced users) and to define your reference distribution with the <literal>APT::Default-Release</literal> parameter (see <xref linkend="section.apt-mise-a-jour" />).
ru_ru: Даже если вы иногда и столкнётесь с проблемами, смешивая пакеты из разных дистрибутивов, <command>aptitude</command> вполне способна управлять таким совместным существованием и очень эффективно ограничивает риски. Лучшим способом продолжить совместное использование будет внесение всех необходимых дистрибутивов в <filename>/etc/apt/sources.list</filename> (кто-то всегда записывает туда три дистрибутива, но следует помнить, что <emphasis role="distribution">Unstable</emphasis> зарезервирован для опытных пользователей) и определение целевого дистрибутива параметром <literal>APT::Default-Release</literal>(смотри <xref linkend="section.apt-mise-a-jour" />).

source: Let's suppose that <emphasis role="distribution">Stable</emphasis> is your reference distribution but that <emphasis role="distribution">Testing</emphasis> and <emphasis role="distribution">Unstable</emphasis> are also listed in your <filename>sources.list</filename> file. In this case, you can use <command>aptitude install <replaceable>package</replaceable>/testing</command> to install a package from <emphasis role="distribution">Testing</emphasis>. If the installation fails due to some unsatisfiable dependencies, let it solve those dependencies within <emphasis role="distribution">Testing</emphasis> by adding the <literal>-t testing</literal> parameter. The same obviously applies to <emphasis role="distribution">Unstable</emphasis>.
ru_ru: Предположим, что <emphasis role="distribution">Stable</emphasis> - это ваш целевой дистрибутив, но <emphasis role="distribution">Testing</emphasis> и <emphasis role="distribution">Unstable</emphasis> также включены в ваш файл <filename>sources.list</filename>. В этом случае вы можете использовать команду <command>aptitude install <replaceable>package</replaceable>/testing</command> для установки пакета из ветки <emphasis role="distribution">Testing</emphasis>. Если установка будет прервана вследствие нескольких неудовлетворённых зависимостей, то их можно разрешить в пределах ветки <emphasis role="distribution">Testing</emphasis> добавлением параметра <literal>-t testing</literal>. Очевидно, что тоже самое применимо и к <emphasis role="distribution">Unstable</emphasis>.

source: In this situation, upgrades (<command>safe-upgrade</command> and <command>dist-upgrade</command>) are done within <emphasis role="distribution">Stable</emphasis> except for packages already upgraded to an other distribution: those will follow updates available in the other distributions. We'll explain this behavior with the help of the default priorities set by APT below. Do not hesitate to use <command>apt-cache policy</command> (see sidebar) to verify the given priorities.
ru_ru: В подобной ситуации обновления (<command>safe-upgrade</command> и <command>dist-upgrade</command>) выполняются в рамках <emphasis role="distribution">Stable</emphasis> за исключением тех пакетов, что были установлены из других дистрибутивов: они будут обновляться вслед за изменениями в соответствующих ветках. Мы поясним это поведение примером ниже, устанавливаемым APT по умолчанию. Не стесняйтесь использовать <command>apt-cache policy</command> (см. сноску) для проверки текущих приоритетов.

source: Everything centers around the fact that APT only considers packages of higher or equal version than the installed one (assuming that <filename>/etc/apt/preferences</filename> has not been used to force priorities higher than 1000 for some packages).
ru_ru: Всё крутится вокруг того, что APT рассматривает только пакеты более высокой или равной версии чем тот, что уже установлен (предполагая, что <filename>/etc/apt/preferences</filename> не был использован для повышения приоритета некоторых пакетов выше 1000).

source: <emphasis>TIP</emphasis> <command>apt-cache policy</command>
ru_ru: <emphasis>СОВЕТ</emphasis> <command>apt-cache policy</command>

source: To gain a better understanding of the mechanism of priority, do not hesitate to execute <command>apt-cache policy</command> to display the default priority associated with each package source. You can also use <command>apt-cache policy <replaceable>package</replaceable></command> to display the priorities of all available versions of a given package.
ru_ru: Смело выполняйте команду <command>apt-cache policy</command> для более глубокого понимания механизма политик и для отображения политик по умолчанию, связанных с каждым источником пакетов. Вы также можете использовать команду <command>apt-cache policy <replaceable>package</replaceable></command> для вывода приоритетов всех доступных версий указанного пакета.

source: Let's assume that you have installed version 1 of a first package from <emphasis role="distribution">Stable</emphasis> and that version 2 and 3 are available respectively in <emphasis role="distribution">Testing</emphasis> and <emphasis role="distribution">Unstable</emphasis>. The installed version has a priority of 100 but the version available in <emphasis role="distribution">Stable</emphasis> (the very same) has a priority of 990 (because it is part of the target release). Packages in <emphasis role="distribution">Testing</emphasis> and <emphasis role="distribution">Unstable</emphasis> have a priority of 500 (the default priority of a non-installed version). The winner is thus version 1 with a priority of 990. The package “stays in <emphasis role="distribution">Stable</emphasis>”.
ru_ru: Предположим, что вы установили версию 1 первого пакета из <emphasis role="distribution">Stable</emphasis> и что версии 2 и 3 доступны соответственно в <emphasis role="distribution">Testing</emphasis> и <emphasis role="distribution">Unstable</emphasis>. Установленная версия имеет приоритет 100, а версия в <emphasis role="distribution">Stable</emphasis> (та же самая) имеет приоритет 990 (по той причине, что она входит в состав целевого релиза). Пакеты в <emphasis role="distribution">Testing</emphasis> и <emphasis role="distribution">Unstable</emphasis> имеют приоритет 500 (приоритет по умолчанию для неустановленной версии). Победителем в данном случае будет версия 1, имеющая приоритет 990. Данный пакет “остаётся из ветки <emphasis role="distribution">Stable</emphasis>”.

source: Let's take the example of another package whose version 2 has been installed from <emphasis role="distribution">Testing</emphasis>. Version 1 is available in <emphasis role="distribution">Stable</emphasis> and version 3 in <emphasis role="distribution">Unstable</emphasis>. Version 1 (of priority 990 — thus lower than 1000) is discarded because it is lower than the installed version. This only leaves version 2 and 3, both of priority 500. Faced with this alternative, APT selects the newest version, the one from <emphasis role="distribution">Unstable</emphasis>.If you don't want a package installed from <emphasis role="distribution">Testing</emphasis> to migrate to <emphasis role="distribution">Unstable</emphasis>, you have to assign a priority lower than 500 (490 for example) to packages coming from <emphasis role="distribution">Unstable</emphasis>. You can modify <filename>/etc/apt/preferences</filename> to this effect:
ru_ru: Давайте рассмотрим пример другого пакета, версия 2 которого была установлена из <emphasis role="distribution">Testing</emphasis>. Версия 1 доступна из <emphasis role="distribution">Stable</emphasis> и версия 3 - из <emphasis role="distribution">Unstable</emphasis>. Версия 1 (приоритет которой 990 - меньше 1000) отбрасывается, поскольку её приоритет ниже установленной версии. Таким образом, остаются только версии 2 и 3, обе с приоритетом 500. APT в подобной ситуации выбирает более новую версию, ту, что из <emphasis role="distribution">Unstable</emphasis>. Если вы не желаете миграции пакета из <emphasis role="distribution">Testing</emphasis> в <emphasis role="distribution">Unstable</emphasis>, то вам необходимо назначить пакетам из <emphasis role="distribution">Unstable</emphasis> приоритет ниже 500 (490, например). Для этого можно изменить файл <filename>/etc/apt/preferences</filename> следующим образом:

source: The <command>apt-cache</command> Command
ru_ru: Команда <command>apt-cache</command>

source: <primary>APT</primary><secondary>package search</secondary>
ru_ru: <primary>APT</primary><secondary>поиск пакетов</secondary>

source: <primary>APT</primary><secondary>header display</secondary>
ru_ru: <primary>APT</primary><secondary>отображение заголовка</secondary>

source: <primary>search of packages</primary>
ru_ru: <primary>поиск пакетов</primary>

source: <primary>package</primary><secondary>search</secondary>
ru_ru: <primary>пакет</primary><secondary>поиск</secondary>

source: The <command>apt-cache</command> command can display much of the information stored in APT's internal database. This information is a sort of cache since it is gathered from the different sources listed in the <filename>sources.list</filename> file. This happens during the <command>aptitude update</command> operation.
ru_ru: Команда <command>apt-cache</command> может отобразить большую часть информации, находящейся во внутренней базе данных APT. Эта информация представляет собой разновидность кэша, поскольку она собирается из разных источников, перечисленных в файле <filename>sources.list</filename>. Сбор осуществляется при выполнении команды <command>aptitude update</command>.

source: <emphasis>VOCABULARY</emphasis> Cache
ru_ru: <emphasis>СЛОВАРЬ</emphasis> Кэш

source: A cache is a temporary storage system used to speed up frequent data access when the usual access method is expensive (performance-wise). This concept can be applied in numerous situations and at different scales, from the core of microprocessors up to high-end storage systems.
ru_ru: Кэшем называют систему временного хранения, используемую для ускорения частых обращений к данным, которая используется в тех случаях, когда традиционные методы являются дорогими (с точки зрения производительности). Эта концепция применима во многих ситуациях и различных масштабах, от ядра микропроцессора до высокопроизводительных систем хранения данных.

source: In the case of APT, the reference <filename>Packages</filename> files are those located on Debian mirrors. That said, it would be very ineffective to go through the network for every search that we might want to do in the database of available packages. That is why APT stores a copy of those files (in <filename>/var/lib/apt/lists/</filename>) and searches are done within those local files. Similarly, <filename>/var/cache/apt/archives/</filename> contains a cache of already downloaded packages to avoid downloading them again if you need to reinstall them after a removal.
ru_ru: В случае с APT эталонные файлы <filename>Packages</filename> находятся на зеркалах Debian. Таким образом, выполнять поиск по сети в базе данных доступных пакетов каждый раз как только это необходимо было бы неэффективно. Именно поэтому APT хранит копию этих файлов (в <filename>/var/lib/apt/lists/</filename>) и выполняет поиск в локальных файлах. Точно также <filename>/var/cache/apt/archives/</filename> содержит кэш загруженных пакетов с целью избежать их повторной загрузки в том случае, если вам понадобится вновь установить их после удаления.

source: The <command>apt-cache</command> command can do keyword-based package searches with <command>apt-cache search <replaceable>keyword</replaceable></command>. It can also display the headers of the package's available versions with <command>apt-cache show <replaceable>package</replaceable></command>. This command provides the package's description, its dependencies, the name of its maintainer, etc. Note that <command>aptitude search</command> and <command>aptitude show</command> work in the same way. <indexterm><primary><command>apt-cache show</command></primary></indexterm><indexterm><primary><command>apt-cache search</command></primary></indexterm><indexterm><primary><command>aptitude show</command></primary></indexterm><indexterm><primary><command>aptitude search</command></primary></indexterm>
ru_ru: Команда <command>apt-cache</command> может производить поиск пакетов по ключевым словам вызовом <command>apt-cache search <replaceable>keyword</replaceable></command>. Она также может отобразить заголовки доступных версий пакета после вызова <command>apt-cache show <replaceable>package</replaceable></command>. Эта команда выводит описание пакета, его зависимости, имя сопровождающего и так далее. Следует заметить, что <command>aptitude search</command> и <command>aptitude show</command> работают таким же образом. <indexterm><primary><command>apt-cache show</command></primary></indexterm><indexterm><primary><command>apt-cache search</command></primary></indexterm><indexterm><primary><command>aptitude show</command></primary></indexterm><indexterm><primary><command>aptitude search</command></primary></indexterm>

source: Some features are more rarely used. For instance, <command>apt-cache policy</command> displays the priorities of package sources as well as those of individual packages. Another example is <command>apt-cache dumpavail</command> which displays the headers of all available versions of all packages. <command>apt-cache pkgnames</command> displays the list of all the packages which appear at least once in the cache.<indexterm><primary><command>apt-cache policy</command></primary></indexterm><indexterm><primary><command>apt-cache dumpavail</command></primary></indexterm>
ru_ru: Некоторые функции используются реже. Например, <command>apt-cache policy</command> отображает приоритеты как источников пакетов, так и отдельных пакетов. Другим примером может быть <command>apt-cache dumpavail</command>, которая показывает заголовки всех доступных версий всех пакетов. <command>apt-cache pkgnames</command> выводит список всех пакетов, которые как минимум один раз были в кэше.<indexterm><primary><command>apt-cache policy</command></primary></indexterm><indexterm><primary><command>apt-cache dumpavail</command></primary></indexterm>

source: Frontends: <command>aptitude</command>, <command>synaptic</command>
ru_ru: Оболочки: <command>aptitude</command>, <command>synaptic</command>

source: <primary>APT</primary><secondary>interfaces</secondary>
ru_ru: <primary>APT</primary><secondary>интерфейсы</secondary>

source: APT is a C++ program whose code mainly resides in the <command>libapt-pkg</command> shared library. Using a shared library facilitates the creation of user interfaces (front-ends), since the code contained in the library can easily be reused. Historically, <command>apt-get</command> was only designed as a test front-end for <command>libapt-pkg</command> but its success tends to obscure this fact.
ru_ru: APT - это программа на C++, код которой большей частью находится в разделяемой библиотеке <command>libapt-pkg</command>. Использование разделяемой библиотеки способствует созданию пользовательских интерфейсов (оболочек), поскольку код, содержащийся в библиотеке, может быть легко использован повторно. Изначально <command>apt-get</command> была задумана как тестовая оболочка для <command>libapt-pkg</command>, но её успех затмил этот факт.
