Repository: sash-kan/debian-handbook-ru
Catalog: */06_apt.po
Languages: ru_ru

source: Once these first steps are done, it is time to handle the upgrade itself, either with <command>aptitude</command> or <command>synaptic</command>. You should carefully check the suggested actions before applying them: you might want to add suggested packages or deselect packages which are only recommended and known not to be useful. In any case, the front-end should come up with a scenario ending in a coherent and up-to-date <emphasis role="distribution">Squeeze</emphasis> system. Then, all you need is to do is wait while the required packages are downloaded, answer the Debconf questions and possibly those about locally modified configuration files, and sit back while APT does its magic.
ru_ru: Как только эти первые шаги выполнены, наступает черёд самого обновления либо с помощью <command>aptitude</command>, либо <command>synaptic</command>. Вам стоит тщательно проверить предлагаемые действия до их применения: вы можете пожелать установить предлагаемые пакеты или отменить выбор тех пакетов, что всего лишь рекомендованы, но не будут использоваться. В любом случае оболочка должна выполнить тот сценарий, что приведёт к гармоничной и современной системе <emphasis role="distribution">Squeeze</emphasis>.

source: Handling Problems after an Upgrade
ru_ru: Устранение проблем после обновления

source: In spite of the Debian maintainers' best efforts, a major system upgrade isn't always as smooth as you could wish. New software versions may be incompatible with previous ones (for instance, their default behavior or their data format may have changed). Also, some bugs may slip through the cracks despite the testing phase which always precedes a Debian release.
ru_ru: Несмотря на максимальные усилия сопровождающих Debian, глобальное обновление системы не всегда проходит так гладко, как этого бы хотелось. Новые версии программ могут оказаться несовместимыми с предыдущими (например, могут измениться их поведение по умолчанию или формат данных). Кроме того, некоторые ошибки могут просочиться даже несмотря на имеющеюся фазу тестирования, всегда предшествующую выпуску Debian.

source: To anticipate some of these problems, you can install the <emphasis role="pkg">apt-listchanges</emphasis> package, which displays information about possible problems at the beginning of a package upgrade. This information is compiled by the package maintainers and put in <filename>/usr/share/doc/<replaceable>package</replaceable>/NEWS.Debian</filename> files for the benefit of users. Reading these files (possibly through <emphasis role="pkg">apt-listchanges</emphasis>) should help you avoid bad surprises.
ru_ru: Для предупреждения некоторых проблем вы можете установить пакет <emphasis role="pkg">apt-listchanges</emphasis>, который отображает информацию о возможных проблемах перед началом обновления пакетов. Эта информация составляется сопровождающими пакетов и помещается в файлы <filename>/usr/share/doc/<replaceable>package</replaceable>/NEWS.Debian</filename> на благо пользователей. Чтение этих файлов (возможно посредством <emphasis role="pkg">apt-listchanges</emphasis>) должно помочь вам избежать неприятных сюрпризов.

source: You might sometimes find that the new version of a software doesn't work at all. This generally happens if the application isn't particularly popular and hasn't been tested enough; a last-minute update can also introduce regressions which are only found after the stable release. In both cases, the first thing to do is to have a look at the bug tracking system at <literal>http://bugs.debian.org/<replaceable>package</replaceable></literal>, and check whether the problem has already been reported. If it hasn't, you should report it yourself with <command>reportbug</command>. If it is already known, the bug report and the associated messages are usually an excellent source of information related to the bug:
ru_ru: Иногда вы можете столкнуться с тем, что новые версии программ совсем не работают. В большинстве случаев это случается с непопулярными программами, которые были недостаточно хорошо протестированы: выпуск новой версии в последний момент также может привести к ошибкам, которые будут обнаружены только после стабильного релиза. В обоих случаях первым делом необходимо заглянуть в систему отслеживания ошибок на странице <literal>http://bugs.debian.org/<replaceable>package</replaceable></literal> и проверить, не было ли сообщений об этой проблеме. Если таковых нет, то вам следует самостоятельно сообщить о ней с помощью <command>reportbug</command>. Если же о проблеме уже известно, то отчёт об ошибке и последующие сообщения послужат отличным источником информации:

source: sometimes a patch already exists, and it is available on the bug report; you can then recompile a fixed version of the broken package locally (see <xref linkend="sect.rebuilding-package" />);
ru_ru: иногда патч уже существует и доступен в отчёте об ошибке; вы можете локально пересобрать исправленную версию пакета с ошибками (см. <xref linkend="sect.rebuilding-package" />);

source: in other cases, users may have found a workaround for the problem and shared their insights about it in their replies to the report;
ru_ru: в других случаях пользователи могли обнаружить обходной путь для решения проблемы и поделились своими находками в сообщениях, содержащихся в отчёте;

source: in yet other cases, a fixed package may have already been prepared and made public by the maintainer.
ru_ru: вполне вероятно, что сопровождающий уже подготовил и опубликовал исправленную версию пакета.

source: Depending on the severity of the bug, a new version of the package may be prepared specifically for a new revision of the stable release. When this happens, the fixed package is made available in the <literal>proposed-updates</literal> section of the Debian mirrors (see <xref linkend="section.proposed-updates" />). The corresponding entry can then be temporarily added to the <filename>sources.list</filename> file, and updated packages can be installed with <command>apt-get</command> or <command>aptitude</command>.
ru_ru: В зависимости от серьёзности ошибки новая версия пакета может быть подготовлена специально для новой ревизии стабильного выпуска. Если такое случается, то исправленная версия пакета доступна в секции <literal>proposed-updates</literal> на зеркалах Debian (см. <xref linkend="section.proposed-updates" />). Соответствующую запись можно затем временно добавить в файл <filename>sources.list</filename>, а обновлённые пакеты можно установить командами <command>apt-get</command> или <command>aptitude</command>.

source: Sometimes the fixed package isn't available in this section yet because it is pending a validation by the Stable Release Managers. You can verify if that's the case on their web page. Packages listed there aren't available yet, but at least you know that the publication process is ongoing. <ulink type="block" url="http://release.debian.org/proposed-updates/stable.html" />
ru_ru: Иногда исправленный пакет отсутствует в этой секции по той причине, что он ожидает утверждения Управляющими Стабильным Выпуском. Удостовериться в этом вы можете на их странице. Пакеты, перечисленные там, пока ещё недоступны, но вы сможете по крайней мере узнать, что они в процессе публикации. <ulink type="block" url="http://release.debian.org/proposed-updates/stable.html" />

source: Keeping a System Up to Date
ru_ru: Поддержка системы в актуальном состоянии

source: The Debian distribution is dynamic and changes continually. Most of the changes are in the <emphasis role="distribution">Testing</emphasis> and <emphasis role="distribution">Unstable</emphasis> versions, but even <emphasis role="distribution">Stable</emphasis> is updated from time to time, mostly for security-related fixes. Whatever version of Debian a system runs, it is generally a good idea to keep it up to date, so that you can get the benefit of recent evolutions and bug fixes.
ru_ru: Дистрибутив Debian динамичен и постоянно меняется. Большинство изменений происходят в версиях <emphasis role="distribution">Testing</emphasis> и <emphasis role="distribution">Unstable</emphasis>, но даже <emphasis role="distribution">Stable</emphasis> иногда обновляется, в основном по причинам проблем с безопасностью. Какая бы версия системы ни была установлена, поддерживать её в актуальном состоянии - это хорошая идея, поскольку вы сможете воспользоваться преимуществами последних усовершенствований и исправлений ошибок.

source: While it is of course possible to periodically run a tool to check for available updates and run the upgrades, such a repetitive task is tedious, especially when it needs to be performed on several machines. Fortunately, like many repetitive tasks, it can be partly automated, and a set of tools have already been developed to that effect.
ru_ru: Разумеется, иногда вы можете запускать инструмент для проверки доступных обновлений и производить эти обновления, но подобная повторяющаяся работа утомительна, особенно если её необходимо выполнять на нескольких машинах. К счастью, как и в случае большинства монотонных задач, её можно частично автоматизировать и для этого уже разработан набор инструментов.

source: The first of these tools is <command>apticron</command>, in the package of the same name. Its main effect is to run a script daily (via <command>cron</command>). The script updates the list of available packages, and, if some installed packages are not in the latest available version, it sends an email with a list of these packages along with the changes that have been made in the new versions. Obviously, this package mostly targets users of Debian <emphasis role="distribution">Stable</emphasis>, since the daily emails would be very long for the more mobile versions of Debian. When updates are available, <command>apticron</command> automatically downloads them. It does not install them — the administrator will still do it — but having the packages already downloaded and available locally (in APT's cache) makes the job faster.
ru_ru: Первым инструментом из этого набора является <command>apticron</command>, доступный в пакете под тем же именем. Его основная задача - ежедневный запуск скрипта (посредством <command>cron</command>). Скрипт обновляет список доступных пакетов и в том случае, когда некоторые установленные пакеты не соответствуют последней доступной версии, он отправляет письмо со списком таких пакетов, а также с теми изменениями, что были произведены в новых версиях. Очевидно, что этот инструмент в большей степени предназначен для пользователей Debian <emphasis role="distribution">Stable</emphasis>, поскольку в случае более динамичных версий Debian эти письма могут быть довольно длинными. Если есть доступные обновления, то <command>apticron</command> автоматически загружает их. Он не устанавливает их, администратору по-прежнему необходимо это делать самостоятельно, но наличие уже загруженных и локально доступных пакетов (в кэше APT) ускоряет работу.

source: Administrators in charge of several computers will no doubt appreciate being informed of pending upgrades, but the upgrades themselves are still as tedious as they used to be, which is where the <filename>/etc/cron.daily/apt</filename> script (in the <emphasis role="pkg">apt</emphasis> package) comes in handy. This script is also run daily (and non-interactively) by <command>cron</command>. To control its behavior, use APT configuration variables (which are therefore stored in a file under <filename>/etc/apt/apt.conf.d/</filename>). The main three variables are:
ru_ru: Администраторы, управляющие несколькими компьютерами, несомненно будут рады информации о предстоящих обновлениях, но сами обновления всё ещё остаются утомительной работой; вот здесь-то и пригодится скрипт <filename>/etc/cron.daily/apt</filename> (из пакета <emphasis role="pkg">apt</emphasis>). Этот скрипт также выполняется <command>cron</command> ежедневно (и неинтерактивно). Используйте переменные в настройках APT (которые хранятся в файле, находящемся в каталоге <filename>/etc/apt/apt.conf.d/</filename>) для контроля над его поведением. Тремя основными переменными являются:

source: This option allows you to specify the frequency (in days) at which the package lists are refreshed. <command>apticron</command> users can do without this variable, since <command>apticron</command> already does this task.
ru_ru: Этот параметр позволяет вам определить частоту (в днях) обновления списка пакетов. Пользователи <command>apticron</command> могут обойтись и без этого параметра, поскольку <command>apticron</command> уже выполняет эту задачу.

source: Again, this option indicates a frequency (in days), this time for the downloading of the actual packages. Again, <command>apticron</command> users won't need it.
ru_ru: И этот параметр определяет частоту (в днях), но на этот раз для загрузки реальных пакетов. И снова пользователи <command>apticron</command> не нуждаются в нём.

source: This last option covers a feature that <command>apticron</command> doesn't have. It controls how often obsolete packages (those not referenced by any distribution anymore) are removed from the APT cache. This keeps the APT cache at a reasonable size and means that you don't need to worry about that task.
ru_ru: Этот последний параметр относится к настройке, которой нет в <command>apticron</command>. Он контролирует частоту удаление устаревших пакетов (те, что больше не относятся ни к одному из дистрибутивов) из кэша APT. Это позволяет поддерживать кэш APT в разумных пределах и подразумевает, что вы не должны беспокоиться об этой задаче.

source: Other options can allow you to control the cache cleaning behavior with more precision. They are not listed here, but they are described in the <filename>/etc/cron.daily/apt</filename> script.
ru_ru: Прочие параметры позволят вам контролировать очистку кэша с большей точностью. Здесь они не перечислены, но все эти параметры описаны в скрипте <filename>/etc/cron.daily/apt</filename>.

source: These tools work very well for servers, but desktop users generally prefer a more interactive system. That is why the “Graphical desktop environment” task installs <command>update-notifier</command> and <command>update-manager</command>. The former displays an icon in the notification area of desktop environments when updates are available; clicking on this icon then runs <command>update-manager</command>, a simplified interface to perform updates. You can browse through available updates, read the description of the relevant packages and their <filename>changelog</filename>, and select whether to apply the update or not on a case-by-case basis. Note that these packages contain configuration data for <filename>/etc/cron.daily/apt</filename> so that it refreshes the lists of available packages and downloads the relevant ones. The <command>update-notifier</command>/<command>update-manager</command> combination is far from having as many features as <command>aptitude</command> and <command>synaptic</command>, since it only handles the upgrades of packages which are already installed; as a consequence, its minimalistic interface leaves little room for mistakes, and therefore little risk of breaking the system.
ru_ru: Все эти инструменты хорошо работают на серверах, но пользователи домашних компьютеров предпочитают интерактивную систему. Именно по этой причине задача “Графическое окружение рабочего стола” устанавливает пакеты <command>update-notifier</command> и <command>update-manager</command>. Первый отображает иконку в области уведомления рабочих столов тогда, когда доступны обновления; щелчок мышью по этой иконке запускает <command>update-manager</command> - упрощённый интерфейс для выполнения обновлений. Вы можете пролистать доступные обновления, прочитать описания соответствующих пакетов и их <filename>changelog</filename>, и в каждом конкретном случае решить применять ли обновления или нет. Обратите внимание, что эти пакеты содержат конфигурационные данные для <filename>/etc/cron.daily/apt</filename>, поэтому он обновляет список доступных пакетов и загружает необходимые. Связка <command>update-notifier</command>/<command>update-manager</command> далека по функционалу от <command>aptitude</command> и <command>synaptic</command>, поскольку она обслуживает обновление только тех пакетов, что уже установлены; как следствие, её минималистичный интерфейс практически не даёт возможностей совершить ошибку и снижает риск повреждения системы.

source: Upgrading with <command>update-manager</command>
ru_ru: Обновление с помощью <command>update-manager</command>

source: Automatic Upgrades
ru_ru: Автоматические обновления

source: <primary>upgrade</primary><secondary>automatic (of the system)</secondary>
ru_ru: <primary>обновление</primary><secondary>автоматическое (системы)</secondary>

source: Since Falcot Corp has many computers but only limited manpower, its administrators try to make upgrades as automatic as possible. The programs in charge of these processes must therefore run with no human intervention.
ru_ru: Так как Falcot Corp имеет много компьютеров, а человеческие ресурсы компании ограничены, то администраторы стараются максимально автоматизировать процессы обновления. Поэтому программа, управляющая этими процессами, должна работать без вмешательства человека.

source: Configuring <command>dpkg</command>
ru_ru: Настраиваем <command>dpkg</command>

source: As we have already mentioned (see sidebar <xref linkend="cadre.questions-conffiles" />), <command>dpkg</command> can be instructed not to ask for confirmation when replacing a configuration file (with the <literal>--force-confdef --force-confold</literal> options). Interactions can, however, have three other sources: some come from APT itself, some are handled by <command>debconf</command>, and some happen on the command line due to package configuration scripts.
ru_ru: Как мы уже упоминали (см. врезку <xref linkend="cadre.questions-conffiles" />), <command>dpkg</command> можно проинструктировать не спрашивать подтверждений при замене конфигурационных файлов (ключами <literal>--force-confdef --force-confold</literal>). Однако вмешательство может потребоваться в трёх других случаях: управление самой APT, управление <command>debconf</command> и управление конфигурационными скриптами из командной строки.

source: Configuring APT
ru_ru: Настраиваем APT

source: The case of APT is simple: the <literal>-y</literal> option (or <literal>--assume-yes</literal>) tells APT to consider the answer to all its questions to be “yes”.
ru_ru: В случае с APT всё просто: ключ <literal>-y</literal> (или <literal>--assume-yes</literal>) указывает APT отвечать “yes” на все запросы.

source: Configuring <command>debconf</command>
ru_ru: Настраиваем <command>debconf</command>

source: The case of <command>debconf</command> deserves more details. This program was, from its inception, designed to control the relevance and volume of questions displayed to the user, as well as the way they are shown. That is why its configuration requests a minimal priority for questions; only questions above the minimal priority are displayed. <command>debconf</command> assumes the default answer (defined by the package maintainer) for questions which it decided to skip.
ru_ru: Случай с <command>debconf</command> заслуживает большего внимания. Эта программа с самого начала служила для контроля уровня значимости и количества вопросов, задаваемых пользователю, а также способом их отображения. Именно по этой причине её настройка требует установки минимальных приоритетов для вопросов; выводятся только те вопросы, чей приоритет выше минимального. <command>debconf</command> принимает ответ по умолчанию (определяется сопровождающим пакета) для тех вопросов, что решено пропустить.

source: The other relevant configuration element is the interface used by the front-end. If you choose <literal>noninteractive</literal> out of the choices, all user interaction is disabled. If a package tries to display an informative note, it will be sent to the administrator by email.
ru_ru: Ещё одним необходимым конфигурационным элементом является интерфейс используемой оболочки. Если вы выберете <literal>неинтерактивный</literal> из всех возможных вариантов, то взаимодействие с пользователем будет отключено. Если пакет попытается вывести информационное сообщение, то оно будет отправлено администратору по почте.

source: To reconfigure <command>debconf</command>, use the <command>dpkg-reconfigure</command> tool from the <emphasis role="pkg">debconf</emphasis> package; the relevant command is <command>dpkg-reconfigure debconf</command>. Note that the configured values can be temporarily overridden with environment variables when needed (for instance, <varname>DEBIAN_FRONTEND</varname> controls the interface, as documented in the <citerefentry><refentrytitle>debconf</refentrytitle><manvolnum>7</manvolnum></citerefentry> manual page).
ru_ru: Для изменения конфигурации <command>debconf</command> используйте утилиту <command>dpkg-reconfigure</command> из пакета <emphasis role="pkg">debconf</emphasis>; соответствующая команда будет <command>dpkg-reconfigure debconf</command>. Стоит заметить, что настроенные значения можно при необходимости временно заменить переменными окружения (например, <varname>DEBIAN_FRONTEND</varname> устанавливает интерфейс, о чём сказано на странице руководства <citerefentry><refentrytitle>debconf</refentrytitle><manvolnum>7</manvolnum></citerefentry>).

source: Handling Command Line Interactions
ru_ru: Управление взаимодействием в командной строке

source: The last source of interactions, and the hardest to get rid of, is the configuration scripts run by <command>dpkg</command>. There is unfortunately no standard solution, and no answer is overwhelmingly better than another.
ru_ru: Последним источником взаимодействия, от которого сложнее всего избавиться, являются конфигурационные скрипты, выполняемые <command>dpkg</command>. К сожалению, здесь не существует стандартного решения, и ни один из ответов не может быть лучше другого.

source: The common approach is to suppress the standard input by redirecting the empty content of <filename>/dev/null</filename> into it with <command><replaceable>command</replaceable> &lt;/dev/null</command>, or to feed it with an endless stream of newlines. None of these methods are 100 % reliable, but they generally lead to the default answers being used, since most scripts consider a lack of reply as an acceptance of the default value.
ru_ru: Общим подходом является подавление стандартного ввода путём перенаправления на него пустого содержимого <filename>/dev/null</filename> командой <command><replaceable>command</replaceable> &lt;/dev/null</command> или запуск на него бесконечного потока символов перевода строки. Ни один и этих методов не является надёжным на 100 %, но они в большинстве случаев приводят к выбору ответов по умолчанию, поскольку большинство скриптов расценивают явное отсутствие ответа как выбор варианта по умолчанию.

source: The Miracle Combination
ru_ru: Чудесная связка

source: By combining the previous elements, it is possible to design a small but rather reliable script which can handle automatic upgrades.
ru_ru: Объединяя ранее упомянутые элементы, можно создать маленький, но достаточно надёжный скрипт, который будет управлять автоматическими обновлениями.

source: Non-interactive upgrade script
ru_ru: Неинтерактивный скрипт для обновления

source: <emphasis>IN PRACTICE</emphasis> The Falcot Corp case
ru_ru: <emphasis>НА ПРАКТИКЕ</emphasis> Случай в Falcot Corp
