Repository: sash-kan/debian-handbook-ru
Catalog: */06_apt.po
Languages: ru_ru

source: <command>aptitude</command> is an interactive program that can be used in semi-graphical mode on the console. You can browse the list of installed and available packages, look up all the available information, and select packages to install or remove. The program is designed specifically to be used by administrators, so that its default behaviors are much more intelligent than <command>apt-get</command>'s, and its interface much easier to understand.
ru_ru: <command>aptitude</command> является интерактивной программой, которая используется в консоли в полуграфическом режиме. Вы можете пролистать список установленных и доступных пакетов, найти всю необходимую информацию и выбрать пакеты для установки или удаления. Эта программа предназначена специально для администраторов, поэтому её действия по умолчанию более интеллектуальны, чем у <command>apt-get</command>, и её интерфейс более понятен.

source: The <command>aptitude</command> package manager
ru_ru: Менеджер пакетов <command>aptitude</command>

source: When it starts, <command>aptitude</command> shows a list of packages sorted by state (installed, non-installed, or installed but not available on the mirrors — other sections display tasks, virtual packages, and new packages that appeared recently on mirrors). To facilitate thematic browsing, other views are available. In all cases, <command>aptitude</command> displays a list combining categories and packages on the screen. Categories are organized through a tree structure, whose branches can respectively be unfolded or closed with the <keycombo><keycap>Enter</keycap></keycombo>, <keycombo><keycap>[</keycap></keycombo> and <keycombo><keycap>]</keycap></keycombo> keys. <keycombo><keycap>+</keycap></keycombo> should be used to mark a package for installation, <keycombo><keycap>-</keycap></keycombo> to mark it for removal and <keycombo><keycap>_</keycap></keycombo> to purge it (note than these keys can also be used for categories, in which case the corresponding actions will be applied to all the packages of the category). <keycombo><keycap>u</keycap></keycombo> updates the lists of available packages and <keycombo action="simul"><keycap>Shift</keycap><keycap>u</keycap></keycombo> prepares a global system upgrade. <keycombo><keycap>g</keycap></keycombo> switches to a summary view of the requested changes (and typing <keycombo><keycap>g</keycap></keycombo> again will apply the changes), and <keycombo><keycap>q</keycap></keycombo> quits the current view. If you are in the initial view, this will effectively close <command>aptitude</command>.
ru_ru: Сразу после запуска <command>aptitude</command> показывает список пакетов, отсортированный по их состоянию (установленные, не установленные или установленные, но недоступные на зеркалах - прочие секции отображают задачи, виртуальные пакеты и новые пакеты, которые недавно появились на зеркалах). Для упрощения тематической навигации существуют и другие режимы просмотра. В любом случае <command>aptitude</command> выводит на экран комбинированный список категорий и пакетов. Категории организованы в виде древовидной структуры, ветви которой можно развернуть или закрыть клавишами <keycombo><keycap>Enter</keycap></keycombo>, <keycombo><keycap>[</keycap></keycombo> или <keycombo><keycap>]</keycap></keycombo>. Клавишу <keycombo><keycap>+</keycap></keycombo> следует использовать для отметки пакета на установку, <keycombo><keycap>-</keycap></keycombo> для отметки на удаление и <keycombo><keycap>_</keycap></keycombo> для полной очистки (следует отметить, что эти же клавиши можно использовать и для категорий, в случае чего выбранное действие будет применено ко всем пакетам в данной категории). Нажатие <keycombo><keycap>u</keycap></keycombo> обновляет список доступных пакетов и <keycombo action="simul"><keycap>Shift</keycap><keycap>u</keycap></keycombo> подготавливает общее обновление системы.

source: <emphasis>DOCUMENTATION</emphasis> <command>aptitude</command>
ru_ru: <emphasis>ДОКУМЕНТАЦИЯ</emphasis> <command>aptitude</command>

source: This section does not cover the finer details of using <command>aptitude</command>, it rather focuses on giving you a survival kit to use it. <command>aptitude</command> is rather well documented and we advise you to use its complete manual available in the <emphasis role="pkg">aptitude-doc-en</emphasis> package. <ulink type="block" url="file:///usr/share/doc/aptitude/html/en/index.html" />
ru_ru: Эта секция не описывает всех тонкостей использования <command>aptitude</command>, напротив, в ней представлены основные инструменты. <command>aptitude</command> хорошо документирована и мы советуем вам использовать подробную инструкцию, доступную в пакете <emphasis role="pkg">aptitude-doc-en</emphasis>. <ulink type="block" url="file:///usr/share/doc/aptitude/html/en/index.html" />

source: To search for a package, you can type <keycombo><keycap>/</keycap></keycombo> followed by a search pattern. This pattern matches the name of the package, but can also be applied to the description (if preceded by <literal>~d</literal>), to the section (with <literal>~s</literal>) or to other characteristics detailed in the documentation. The same patterns can filter the list of displayed packages: type the <keycombo><keycap>l</keycap></keycombo> key (as in <foreignphrase>limit</foreignphrase>) and enter the pattern.
ru_ru: Для поиска пакета вы можете нажать <keycombo><keycap>/</keycap></keycombo> для ввода шаблона. Этот шаблон используется для поиска по имени пакета, но его также можно применить и для поиска по описанию (если ему предшествует <literal>~d</literal>), для поиска по секции (используйте <literal>~s</literal>) или по другим характеристикам, указанным в документации. Эти же шаблоны могут быть применены для фильтрации списка пакетов: нажмите клавишу <keycombo><keycap>l</keycap></keycombo> (как в <foreignphrase>limit</foreignphrase>) и введите шаблон.

source: Tracking Automatically Installed Packages
ru_ru: Отслеживание автоматически установленных пакетов

source: One of the essential functionalities of <command>aptitude</command> (which has also been integrated to <command>apt-get</command> since <emphasis role="distribution">Lenny</emphasis>) is the tracking of packages installed only through dependencies. These packages are called “automatic” and are tagged with an “A” in the list of packages — they often include libraries for instance. When a package is removed, the corresponding automatic packages are also selected for removal unless another “manually installed” package depends on them. It is possible to mark a package as automatic (with <keycombo action="simul"><keycap>Shift</keycap> <keycap>m</keycap></keycombo>) or to remove the mark (<keycombo><keycap>m</keycap></keycombo> key). When maintaining a system with <command>aptitude</command>, it is a good habit to mark as automatic any package that you don't need directly so that they are automatically removed when they aren't necessary anymore. You can either navigate the list of installed packages and play with <keycombo action="simul"><keycap>Shift</keycap> <keycap>m</keycap></keycombo>, or apply the flag to entire sections (for example the <literal>libs</literal> section). This habit can help you to keep your system tidy and offers a simple way to visualize the packages in use on a machine, without all the libraries and dependencies that you don't really care about. The related pattern that can be used with <keycombo><keycap>l</keycap></keycombo> (to activate the filter mode) is <literal>~i!~M</literal>. It specifies that you only want to see installed packages (<literal>~i</literal>) not marked as automatic (<literal>!~M</literal>).
ru_ru: Одной их важнейших функций <command>aptitude</command> (которая также была интегрирована в <command>apt-get</command> с выходом <emphasis role="distribution">Lenny</emphasis>) является отслеживание пакетов, установленных исключительно по зависимостям. Такие пакеты называются “автоматические” и помечаются буквой “A” в списке пакетов - часто они содержат, например, библиотеки. В случае удаления пакета соответствующие автоматические пакеты также помечаются для удаления, если другие “установленные вручную” пакеты не зависят от них. Пакет можно пометить как автоматический (<keycombo action="simul"><keycap>Shift</keycap> <keycap>m</keycap></keycombo>) или удалить такую метку (клавиша <keycombo><keycap>m</keycap></keycombo>). Хорошей привычкой при обслуживании системы с помощью <command>aptitude</command> может быть отметка всех пакетов, которые не используются напрямую, автоматическими для того, чтоб они удалялись автоматически как только в них не будет необходимости. Вы можете либо перейти в список установленных пакетов и использовать <keycombo action="simul"><keycap>Shift</keycap> <keycap>m</keycap></keycombo>, либо установить этот флаг для целых секций (к примеру, для секции <literal>libs</literal>). Подобная привычка поможет вам содержать систему в порядке и предоставляет простой способ представления используемых в системе пакетов, причём без представляющих малый интерес библиотек и зависимостей. Соответствующий шаблон, который можно использовать после нажатия <keycombo><keycap>l</keycap></keycombo> (для активации режима фильтрации) - <literal>~i!~M</literal>. Он означает, что вы хотите видеть только те установленные пакеты (<literal>~i</literal>), что не помечены как автоматические (<literal>!~M</literal>).

source: People might want to know why an automatically installed package is present on the system. To get this information from the command-line, you can use <command>aptitude why <replaceable>package</replaceable></command>:
ru_ru: Пользователям может быть интересно узнать причину, по корой тот или иной пакет автоматически установлен в системе. Для получения этой информации из командной строки вы можете воспользоваться <command>aptitude why <replaceable>package</replaceable></command>:

source: <emphasis>WORTH FOLLOWING</emphasis> Recent evolutions of <command>apt-get</command> and <command>aptitude</command>
ru_ru: <emphasis>К СВЕДЕНИЮ</emphasis> Последние изменения в <command>apt-get</command> и <command>aptitude</command>

source: Some of the advantages that <command>aptitude</command> historically had over <command>apt-get</command> have recently disappeared. For instance, since the release of <emphasis role="distribution">Lenny</emphasis>, <command>apt-get</command> memorizes the packages that have been installed only to satisfy dependencies, just like <command>aptitude</command> has always done. It can also follow recommendations expressed by one package on another.
ru_ru: Некоторые преимущества, которые <command>aptitude</command> исторически имела перед <command>apt-get</command>, недавно исчезли. Например, после выпуска <emphasis role="distribution">Lenny</emphasis> <command>apt-get</command> запоминает те пакеты, что были установлены исключительно для удовлетворения зависимостей, как это всегда было в <command>aptitude</command>. Она также способна следовать рекомендациям одного пакета относительно другого.

source: Among the recent evolutions of <command>aptitude</command>, a new version with a graphical interface is currently being developed. Even if it's available in <emphasis role="distribution">Squeeze</emphasis> (in the separate <emphasis role="pkg">aptitude-gtk</emphasis> package), it's not complete yet and is subject to stability issues.
ru_ru: Одним из последних изменений в <command>aptitude</command> является разработка новой версии графического интерфейса. Хотя он и присутствует в <emphasis role="distribution">Squeeze</emphasis> (в отдельном пакете <emphasis role="pkg">aptitude-gtk</emphasis>), этот интерфейс ещё не завершён и в нём существуют проблемы со стабильностью.

source: <emphasis>TOOL</emphasis> Using <command>aptitude</command> on the command-line interface
ru_ru: <emphasis>ИНСТРУМЕНТ</emphasis> Использование <command>aptitude</command> в командной строке

source: Most of <command>aptitude</command>'s features are accessible via the interactive interface as well as via command-lines. These command-lines will seem familiar to regular users of <command>apt-get</command> and <command>apt-cache</command>.
ru_ru: Большинство функций <command>aptitude</command> доступно как через интерактивный интерфейс, так и в командной строке. Эти команды будут знакомы постоянным пользователям <command>apt-get</command> и <command>apt-cache</command>.

source: The advanced features of <command>aptitude</command> are also available on the command-line. You can use the same package search patterns as in the interactive version. For example, if you want to run the previously suggested cleanup of “automatic” packages, and if you know that none of the locally installed programs require any particular libraries or Perl modules, you can mark the corresponding packages as automatic with a single command:
ru_ru: Продвинутые функции <command>aptitude</command> также доступны и в командной строке. Вы можете использовать те же шаблоны поиска, что и в интерактивной версии. Например, если вы хотите выполнить предложенную ранее очистку “автоматических” пакетов и если вы уверены, что ни одна из локально установленных программ не требует каких-либо библиотек и модулей Perl, то вы можете пометить соответствующие пакеты как автоматические одной командой:

source: Here, you can clearly see the power of the search pattern system of <command>aptitude</command>, which enables the instant selection of all the packages in the <literal>libs</literal> and <literal>perl</literal> sections.
ru_ru: Здесь можно отчетливо увидеть всю силу системы поисковых шаблонов <command>aptitude</command>, которая позволяет одномоментно выбрать все пакеты в секциях <literal>libs</literal> и <literal>perl</literal>.

source: Beware, if some packages are marked as automatic and if no other package depends on them, they will be removed immediately (after a confirmation request).
ru_ru: Будьте осторожны, если некоторые пакеты помечены как автоматические и нет других пакетов, которые от них зависят, то они будут немедленно удалены (после запроса на подтверждение).

source: <emphasis>ALTERNATIVE</emphasis> <command>deborphan</command> and <command>debfoster</command>
ru_ru: <emphasis>АЛЬТЕРНАТИВА</emphasis> <command>deborphan</command> и <command>debfoster</command>

source: Before <command>aptitude</command> came to life with its tracking of automatic packages, there were two utilities producing lists of unnecessary packages: <command>deborphan</command> and <command>debfoster</command>.
ru_ru: До того как в <command>aptitude</command> было реализовано отслеживание автоматических пакетов, существовали две утилиты, формирующие список неиспользуемых пакетов: <command>deborphan</command> and <command>debfoster</command>.

source: <command>deborphan</command> is the most rudimentary of both. It simply scans the <literal>libs</literal> and <literal>oldlibs</literal> sections (in the absence of supplementary instructions) looking for the packages that are currently installed and that no other packages depends on. The resulting list can then serve as a basis to remove unneeded packages.
ru_ru: <command>deborphan</command> является самой простейшей из двух. Она просто сканирует секции <literal>libs</literal> и <literal>oldlibs</literal> (в отсутствие дополнительных инструкций) в поисках тех пакетов, что установлены, но не включены в зависимости других пакетов. Список, полученный в результате, может служить основанием для удаления неиспользуемых пакетов.

source: <command>debfoster</command> has a more elaborate approach, very similar to <command>aptitude</command>'s: it maintains a list of packages that have been explicitly installed, and remembers what packages are really required between each invocation. If new packages appear on the system and if <command>debfoster</command> doesn't know them as required packages, they will be shown on the screen together with a list of their dependencies. The program then offers a choice: remove the package (possibly together with those that depend on it), mark it as explicitly required, or ignore it temporarily.
ru_ru: <command>debfoster</command> использует более продуманный подход, очень похожий на тот, что имеется в <command>aptitude</command>: она содержит список явно установленных пакетов и запоминает, какие пакеты действительно необходимы между каждым вызовом. Если в системе появляются новые пакеты и <command>debfoster</command> не считает их необходимыми, то они будут выведены на экран совместно со списком их зависимостей. Далее программа предложит на выбор: удалить пакет (возможно, что вместе с теми пакетами, которые зависят от текущего), пометить его как явно необходимый или временно игнорировать.

source: Managing Recommendations, Suggestions and Tasks
ru_ru: Рекомендации, предложения и задачи по управлению

source: Another interesting feature of <command>aptitude</command> is the fact that it respects recommendations between packages while still giving users the choice not to install them on a case by case basis. For example, the <emphasis role="pkg">gnome-desktop-environment</emphasis> package recommends <emphasis role="pkg">gnome-accessibility</emphasis> (among others). When you select the former for installation, the latter will also be selected (and marked as automatic if not already installed on the system). Typing <keycombo><keycap>g</keycap></keycombo> will make it obvious: <emphasis role="pkg">gnome-accessibility</emphasis> appears on the summary screen of pending actions in the list of packages installed automatically to satisfy dependencies. However, you can decide not to install it by deselecting it before confirming the operations.
ru_ru: Ещё одной интересной особенностью <command>aptitude</command> является следование рекомендациям, содержащимся в пакетах, и в то же время предоставление пользователям возможности не всегда их устанавливать. Например, пакет <emphasis role="pkg">gnome-desktop-environment</emphasis> рекомендует (среди прочих) <emphasis role="pkg">gnome-accessibility</emphasis>. Если вы устанавливаете первый, то второй также будет отмечен для установки (и отмечен как автоматический, если он не был установлен в системе до этого момента). Этот факт станет очевидным после нажатия <keycombo><keycap>g</keycap></keycombo>: <emphasis role="pkg">gnome-accessibility</emphasis> появится на общем экране ожидающих выполнения действий в списке пакетов, установленных автоматически для удовлетворения зависимостей. Однако вы можете решить не устанавливать его и отменить выбор до подтверждения операции.

source: Note that this recommendation tracking feature does not apply to upgrades. For instance, if a new version of <emphasis role="pkg">gnome-desktop-environment</emphasis> recommends a package that it did not recommend formerly, the package won't be marked for installation. However, it will be listed on the upgrade screen so that the administrator can still select it for installation.
ru_ru: Стоит отметить, что функция отслеживания рекомендаций не применима к обновлениям. К примеру, если новая версия <emphasis role="pkg">gnome-desktop-environment</emphasis> рекомендует пакет, который не был в списке рекомендаций ранее, то этот пакет не будет отмечен для установки. Тем не менее он будет перечислен в списке пакетов на экране обновления с тем, чтоб администратор мог отметить его для установки.

source: Suggestions between packages are also taken into account, but in a manner adapted to their specific status. For example, since <emphasis role="pkg">gnome-desktop-environment</emphasis> suggests <emphasis role="pkg">gnome-audio</emphasis>, the latter will be displayed on the summary screen of pending actions (in the section of packages suggested by other packages). This way, it is visible and the administrator can decide whether to take the suggestion into account or not. Since it is only a suggestion and not a dependency or a recommendation, the package will not be selected automatically — its selection requires a manual intervention from the user (thus, the package will not be marked as automatic).
ru_ru: Предложения пакетов также принимаются во внимание, но с учётом их особого статуса. Например, <emphasis role="pkg">gnome-desktop-environment</emphasis> предлагает <emphasis role="pkg">gnome-audio</emphasis>, который будет показан на общем экране ожидающих выполнения действий (в секции пакетов, предложенных другими пакетами). Таким образом, предложение будет видно и администратор сможет решить, принимать ли его во внимание или нет. Поскольку это всего лишь предложение, а не зависимость или рекомендация, пакет не будет выбран автоматически - его выбор требует личного вмешательства со стороны пользователя (таким образов, пакет не будет отмечен как автоматический).

source: In the same spirit, remember that <command>aptitude</command> makes intelligent use of the concept of task. Since tasks are displayed as categories in the screens of package lists, you can either select a full task for installation or removal, or browse the list of packages included in the task to select a smaller subset.
ru_ru: Следует помнить также, что <command>aptitude</command> разумно использует концепцию задач. Поскольку задачи отображаются как категории на экранах списков пакетов, вы можете либо выбрать целую задачу для установки или удаления, либо перейти в список пакетов данной задачи и выбрать меньшее подмножество.

source: Better Solver Algorithms
ru_ru: Улучшенные решающие алгоритмы
