Repository: sash-kan/debian-handbook-ru
Catalog: */06_apt.po
Languages: ru_ru

source: Maintenance and Updates: The APT Tools
ru_ru: Поддержка и обновление

source: What makes Debian so popular with administrators is how easily software can be installed and how easily the whole system can be updated. This unique advantage is largely due to the <emphasis>APT</emphasis> program, the features of which Falcot Corp administrators studied with enthusiasm.
ru_ru: Простота установки программного обеспечения и обновления всей системы делает Debian таким популярным среди администраторов. Это однозначное преимущество в основном существует благодаря программе <emphasis>APT</emphasis>, возможности которой с энтузиазмом изучали администраторы Falcot Corp.

source: <indexterm><primary>APT</primary></indexterm> <indexterm><primary>Advanced Package Tool</primary></indexterm> APT is the abbreviation for Advanced Package Tool. What makes this program “advanced” is its approach to packages. It doesn't simply evaluate them individually, but it considers them as a whole and produces the best possible combination of packages depending on what is available and compatible (according to dependencies).
ru_ru: <indexterm><primary>APT</primary></indexterm> <indexterm><primary>Advanced Package Tool</primary></indexterm> APT - это аббревиатура, означающая Продвинутый Пакетный Инструментарий. Именно подход к пакетам делает эту программу “продвинутой“. Она не просто оценивает пакеты индивидуально, но рассматривает их как единое целое и образует лучшую из возможных комбинаций пакетов в зависимости от того, что доступно и совместимо (в соответствии с зависимостями).

source: <emphasis>VOCABULARY</emphasis> Package source and source package
ru_ru: <emphasis>СЛОВАРЬ</emphasis> Источник пакетов и пакет с исходными кодами

source: The word <emphasis>source</emphasis> can be ambiguous. A source package — a package containing the source code of a program — should not be confused with a package source — a repository (website, FTP server, CD-ROM, local directory, etc.) which contains packages.
ru_ru: Слово <emphasis>источник</emphasis> может быть двусмысленным. Пакет с исходными кодами - это пакет, содержащий исходный код программы и его не следует путать с источником пакетов - репозиторием (сайт, FTP сервер, CD-ROM, локальная директория и т. д.), который содержит пакеты.

source: APT needs to be given a “list of package sources”: the file <filename>/etc/apt/sources.list</filename> will list the different repositories (or “sources”) that publish Debian packages. APT will then import the list of packages published by each of these sources. This operation is achieved by downloading <filename>Packages.gz</filename> or <filename>Packages.bz2</filename> files (in case of a source of binary packages) and <filename>Sources.gz</filename> or <filename>Sources.bz2</filename> files (in case of a source of source packages) and by analyzing their contents. When an old copy of these files is already present, APT can update it by only downloading the differences (see sidebar <xref linkend="encadre.apt-pdiff" />).
ru_ru: APT необходимо передать “список источников пакетов”: файл <filename>/etc/apt/sources.list</filename> будет содержать различные репозитории (или “источники”), которые публикуют пакеты Debian. APT затем импортирует список пакетов, опубликованный каждым из этих источников. Эта операция выполняется путём загрузки файлов <filename>Packages.gz</filename> или <filename>Packages.bz2</filename> (в случае источника бинарных пакетов) и файлов <filename>Sources.gz</filename> или <filename>Sources.bz2</filename> (в случае источника пакетов с исходными кодами) и анализа их содержимого. Если устаревшая копия этих файлов уже присутствует, то APT может обновить их, загрузив только изменения (см. врезку <xref linkend="encadre.apt-pdiff" />).

source: <emphasis>BACK TO BASICS</emphasis> <command>gzip</command>, <command>bzip2</command>, <command>LZMA</command> and <command>XZ</command> Compression
ru_ru: <emphasis>К ОСНОВАМ</emphasis> <command>gzip</command>, <command>bzip2</command>, <command>LZMA</command> и <command>XZ</command> сжатие

source: A <filename>.gz</filename> extension refers to a file compressed with the <command>gzip</command> utility. <command>gzip</command> is the fast and efficient traditional Unix utility to compress files. Newer tools achieve better rates of compression but require more calculation time to compress a file. Among them, and by order of appearance, there are <command>bzip2</command> (generating files with a <filename>.bz2</filename> extension), <command>lzma</command> (generating <filename>.lzma</filename> files) and <command>xz</command> (generating <filename>.xz</filename> files).
ru_ru: Расширение <filename>.gz</filename> относится к файлу, сжатому утилитой <command>gzip</command>. <command>gzip</command> является быстрой и эффективной традиционной утилитой Unix для сжатия файлов. Более современные средства позволяют достичь лучших уровней сжатия, но требуют больше времени на вычисления. Среди них, в порядке возникновения, <command>bzip2</command> (создаёт файлы с расширением <filename>.bz2</filename>), <command>lzma</command> (создающая файлы <filename>.lzma</filename>) и <command>xz</command> (создающая файлы <filename>.xz</filename>).

source: Filling in the <filename>sources.list</filename> File
ru_ru: Заполнение файла <filename>sources.list</filename>

source: Each active line of the <filename>/etc/apt/sources.list</filename> file contains the description of a source, made of 3 parts separated by spaces.
ru_ru: Каждая активная стока файла <filename>/etc/apt/sources.list</filename> содержит описание источника и состоит из трёх частей, разделённых пробелами.

source: The first field indicates the source type:
ru_ru: Первое поле указывает на тип источника:

source: “<literal>deb</literal>” for binary packages,
ru_ru: “<literal>deb</literal>” для бинарных пакетов,

source: “<literal>deb-src</literal>” for source packages.
ru_ru: “<literal>deb-src</literal>” для пакетов с исходными кодами.

source: The second field gives the base URL of the source (combined with the filenames present in the <filename>Packages.gz</filename> files, it must give a full and valid URL): this can consist in a Debian mirror or in any other package archive set up by a third party. The URL can start with <literal>file://</literal> to indicate a local source installed in the system's file hierarchy, with <literal>http://</literal> to indicate a source accessible from a web server, or with <literal>ftp://</literal> for a source available on an FTP server. The URL can also start with <literal>cdrom://</literal> for CD-ROM based installations, although this is less frequent, since network-based installation methods are more and more common.
ru_ru: Второе поле содержит базовый URL источника (сгруппированный с именами файлов, содержащимися в <filename>Packages.gz</filename>, он должен составлять полный и допустимый URL): он может быть зеркалом Debian или любым другим архивом пакетов, установленным третьим лицом. URL может начинаться с <literal>file://</literal> для указания локального источника, установленного в файловой иерархии системы; с <literal>http://</literal> для указания источника, доступного с интернет-сервера; или с <literal>ftp://</literal> для источника, доступного на FTP сервере. URL также может начинаться с <literal>cdrom://</literal> в случае установки с CD-ROM, хотя этот случай встречается не столь часто, поскольку методы установки по сети являются более распространёнными.

source: The syntax of the last field depends on whether the source corresponds to a Debian mirror or not. In the case of a Debian mirror, name the chosen distribution (<literal>stable</literal>, <literal>testing</literal>, <literal>unstable</literal> or their current code names — see the list in sidebar <xref linkend="cadre.bruce-perens" />), then the sections to enable (chosen between <literal>main</literal>, <literal>contrib</literal>, and <literal>non-free</literal>). In all other cases, simply indicate the subdirectory of the desired source (this is often a simple “<filename>./</filename>” which refers to the absence of a subdirectory — the packages are then directly at the specified URL).
ru_ru: Синтаксис последнего поля зависит от того, соответствует ли источник зеркалу Debian или нет. В случае зеркала Debian укажите тип выбранной сборки (<literal>stable</literal>, <literal>testing</literal>, <literal>unstable</literal> или их кодовые имена - смотрите список во врезке <xref linkend="cadre.bruce-perens" />), а затем активные секции (выберите из <literal>main</literal>, <literal>contrib</literal>, и <literal>non-free</literal>). Во всех остальных случаях просто укажите поддиректорию желаемого источника (часто это просто “<filename>./</filename>”, который указывает на отсутствие поддиректории - пакеты находятся непосредственно по указанному URL).

source: <emphasis>VOCABULARY</emphasis> The <foreignphrase>main</foreignphrase>, <foreignphrase>contrib</foreignphrase> and <foreignphrase>non-free</foreignphrase> archives
ru_ru: <emphasis>СЛОВАРЬ</emphasis> Архивы <foreignphrase>main</foreignphrase>, <foreignphrase>contrib</foreignphrase> и <foreignphrase>non-free</foreignphrase>

source: <primary>section</primary><secondary><foreignphrase>main</foreignphrase></secondary>
ru_ru: <primary>секция</primary><secondary><foreignphrase>main</foreignphrase></secondary>

source: <primary><foreignphrase>main</foreignphrase>, section</primary>
ru_ru: <primary><foreignphrase>main</foreignphrase>, секция</primary>

source: <primary>section</primary><secondary><foreignphrase>contrib</foreignphrase></secondary>
ru_ru: <primary>секция</primary><secondary><foreignphrase>contrib</foreignphrase></secondary>

source: <primary><foreignphrase>contrib</foreignphrase>, section</primary>
ru_ru: <primary><foreignphrase>contrib</foreignphrase>, секция</primary>

source: <primary>section</primary><secondary><foreignphrase>non-free</foreignphrase></secondary>
ru_ru: <primary>секция</primary><secondary><foreignphrase>non-free</foreignphrase></secondary>

source: <primary><foreignphrase>non-free</foreignphrase>, section</primary>
ru_ru: <primary><foreignphrase>non-free</foreignphrase>, секция</primary>

source: Debian uses three sections to differentiate packages according to the licenses chosen by the authors of each program. <foreignphrase>Main</foreignphrase> (the main archive) gathers all packages which fully comply with the Debian Free Software Guidelines.
ru_ru: В Debian используется три секции для разграничения пакетов по типу лицензии, выбранной автором каждой программы. В <foreignphrase>main</foreignphrase> (основной архив) собраны все пакеты, которые полностью соответствуют Руководству Debian по Свободному Программному Обеспечению.

source: The <foreignphrase>non-free</foreignphrase> archive is different because it contains software which does not (entirely) conform to these principles but which can nevertheless be distributed freely. This archive, which is not officially part of Debian, is a service for users who could need those software — however Debian always recommends giving priority to free software. The existence of this section represents a considerable problem for Richard M. Stallman and keeps the Free Software Foundation from recommending Debian to users.
ru_ru: Архив <foreignphrase>non-free</foreignphrase> отличается тем, что содержит программное обеспечение, которое не (полностью) соответствует этим принципам, но которое тем не менее может распространяться свободно. Данный архив, который официально не является частью Debian, служит нуждам тех пользователей, которым может понадобиться это программное обеспечение - однако, Debian всегда рекомендует отдавать предпочтение свободному программному обеспечению. Существование этой секции представляет значительную проблему для Ричарда М. Столлмана и не позволяет Фонду Свободного Программного Обеспечения рекомендовать Debian пользователям.

source: <foreignphrase>Contrib</foreignphrase> (contributions) is a stock of open source software which cannot function without some non-free elements. These elements can be software from the <foreignphrase>non-free</foreignphrase> section, or non-free files such as game ROMs, BIOS of consoles, etc. <foreignphrase>Contrib</foreignphrase> also includes free software whose compilation requires proprietary elements. This was initially the case for the OpenOffice.org office suite, which used to require a proprietary Java environment.
ru_ru: <foreignphrase>Contrib</foreignphrase> (contributions) - это репозиторий программного обеспечения с открытым кодом, которое не может функционировать без некоторых несвободных элементов. Этими элементами могут быть программы из секции <foreignphrase>non-free</foreignphrase>, несвободные файлы, как, например, ROM игр, BIOS консолей и т. д. <foreignphrase>Contrib</foreignphrase> также включает в себя программное обеспечение, компиляция которого требует проприетарных элементов. Изначально это было справедливо для офисного пакета OpenOffice.org, который требовал проприетарного окружения Java.

source: Generally, the contents of a standard <filename>sources.list</filename> file can be the following:
ru_ru: В общем случае, содержимое стандартного файла <filename>sources.list</filename> может быть следующим:

source: <filename>/etc/apt/sources.list</filename> file
ru_ru: файл <filename>/etc/apt/sources.list</filename>

source: This file lists all sources of packages associated with the stable version of Debian. If you would like to use <emphasis role="distribution">Testing</emphasis> or <emphasis role="distribution">Unstable</emphasis>, you will of course have to add (or replace them with) the appropriate lines. When the desired version of a package is available on several mirrors, the first one listed in the <filename>sources.list</filename> file will be used. For this reason, non-official sources are usually added at the end of the file.
ru_ru: В этом файле перечислены все источники пакетов, связанные со стабильной версией Debian. Если вы хотите использовать <emphasis role="distribution">Testing</emphasis> или <emphasis role="distribution">Unstable</emphasis>, то вам, разумеется, придется добавить (или заменить ими) соответствующие строки. Если требуемая версия пакета доступна на нескольких зеркалах, то будет использовано первое зеркало, перечисленное в файле <filename>sources.list</filename>. По этой причине неофициальные источники обычно добавляются в конце данного файла.

source: <emphasis>TIP</emphasis> <filename>/etc/apt/sources.list.d/*.list</filename> files
ru_ru: <emphasis>СОВЕТ</emphasis> файлы <filename>/etc/apt/sources.list.d/*.list</filename>

source: If many package sources are referenced, it can be useful to split them in multiple files. Each part is then stored in <filename>/etc/apt/sources.list.d/<replaceable>filename</replaceable>.list</filename> (see sidebar <xref linkend="cadre-repertoire.d" />).
ru_ru: Если имеется множество ссылок на источники пакетов, то разделение их на несколько файлов может быть полезным. В этом случае каждая часть хранится в <filename>/etc/apt/sources.list.d/<replaceable>filename</replaceable>.list</filename> (смотрите врезку <xref linkend="cadre-repertoire.d" />).

source: <emphasis>QUICK LOOK</emphasis> <command>apt-spy</command>
ru_ru: <emphasis>КРАТКИЙ ЭКСКУРС</emphasis> <command>apt-spy</command>

source: This software tests the download speed from several Debian mirrors and generates a <filename>sources.list</filename> file which points to the the fastest mirror.
ru_ru: Эта программа тестирует скорость загрузки с нескольких зеркал Debian и генерирует файл <filename>sources.list</filename>, в котором указаны зеркала с наибольшей скоростью.

source: The mirror selected during installation is generally suitable since its selection is based on the country. However, if the download is a little slow, or after a move, you can try running the application available in the <emphasis role="pkg">apt-spy</emphasis> package.
ru_ru: Зеркало, выбранное на этапе установки, является подходящим в большинстве случаев, поскольку его выбор основан на стране. Однако если загрузка происходит относительно медленно, как, например, после переезда, вы можете попробовать запустить приложение из пакета <emphasis role="pkg">apt-spy</emphasis>.

source: The <filename>sources.list</filename> file contains several other entry types: some describe the Debian CD-ROMs you have. Contrary to other entries, a CD-ROM is not always available since it has to be inserted into the drive and since only one disc can be read at a time — consequently, these sources are managed in a slightly different way. These entries need to be added with the <command>apt-cdrom</command> program, usually executed with the <literal>add</literal> parameter. The latter will then request the disc to be inserted in the drive and will browse its contents looking for <filename>Packages</filename> files. It will use these files to update its database of available packages (this is usually done by the <command>aptitude update</command> command). From then on, APT can require the disc to be inserted if it needs one of its packages.
ru_ru: Файл <filename>sources.list</filename> может содержать несколько других типов записей: некоторые описывают ваши CD-ROM с Debian. В отличие от других записей, CD-ROM не всегда доступны, поскольку их необходимо вставлять в дисковод и только один диск может быть прочитан в данный момент времени - следовательно, эти источники управляются несколько по-иному. Данные записи должны быть добавлены программой <command>apt-cdrom</command>, обычно запускаемой с параметром <literal>add</literal>. Эта программа попросит вставить диск в дисковод и затем просканирует его содержимое в поиске файлов <filename>Packages</filename>. Она использует эти файлы для обновления своей базы данных доступных пакетов (обычно эта операция выполняется командой <command>aptitude update</command>). С этого момента APT может потребовать вставить диск, если ей потребуется один из этих пакетов.

source: Other Available Official Repositories
ru_ru: Другие доступные официальные репозитории

source: <emphasis role="distribution">Stable</emphasis> Updates
ru_ru: Обновления <emphasis role="distribution">Stable</emphasis>

source: Once published, the <emphasis role="distribution">Stable</emphasis> distribution is only updated about once every 2 months in order to integrate the security updates published on <literal>security.debian.org</literal>.
ru_ru: После публикации дистрибутив <emphasis role="distribution">Stable</emphasis> обновляется примерно раз в два месяца с целью интеграции обновлений безопасности, доступных на <literal>security.debian.org</literal>.

source: This minor release can also include updates for packages that have to evolve over time... like <emphasis role="pkg">spamassassin</emphasis>'s spam detection rules, <emphasis role="pkg">clamav</emphasis>'s virus database, or the daylight-saving rules of all timezones (<emphasis role="pkg">tzdata</emphasis>).
ru_ru: Эти небольшие обновления также могут включать в себя обновления пакетов, которые были усовершенствованы со временем, как, например, правила обнаружения спама <emphasis role="pkg">spamassassin</emphasis>, базы вирусов <emphasis role="pkg">clamav</emphasis> или правила перевода на летнее время для всех временных зон (<emphasis role="pkg">tzdata</emphasis>).

source: All those updates are prepared in a repository known as <literal>proposed-updates</literal>. Anyone can use this repository to test those updates before their official publication. The extract below uses the <literal>squeeze-proposed-updates</literal> alias which is both more explicit and more consistent since <literal>lenny-proposed-updates</literal> also exists (for the <emphasis role="distribution">Oldstable</emphasis> updates):
ru_ru: Все эти обновления подготавливаются в репозитории, известном как <literal>proposed-updates</literal>. Любой пользователь может использовать этот репозиторий для тестирования обновлений до их официальной публикации. В выдержке ниже используется более явный и непротиворечивый псевдоним <literal>squeeze-proposed-updates</literal>, поскольку существует ещё и <literal>lenny-proposed-updates</literal> (для обновлений <emphasis role="distribution">Oldstable</emphasis>):

source: Once ready, the most important updates — those which cannot wait for the next minor Debian release — are published in the <literal>stable-updates</literal> repository (which most systems are expected to use):
ru_ru: Наиболее важные обновления, те что нельзя откладывать до очередного минорного релиза Debian, публикуются сразу после готовности в репозитории <literal>stable-updates</literal> (который, вероятно, используют большинство дистрибутивов):

source: The Backports From <literal>backports.debian.org</literal>
ru_ru: Бэкпорты <literal>backports.debian.org</literal>

source: Unsurprisingly, the <literal>backports.debian.org</literal> server hosts “package backports”. The term refers to a package of a recent software which has been recompiled for an older distribution, generally for <emphasis role="distribution">Stable</emphasis>. When the distribution becomes a little dated, numerous software projects have released new versions that are not integrated into the current <emphasis role="distribution">Stable</emphasis> (which is only modified to address the most critical problems, such as security problems). Since the <emphasis role="distribution">Testing</emphasis> and <emphasis role="distribution">Unstable</emphasis> distributions can be more risky, some volunteers sometimes offer recompilations of recent software applications for <emphasis role="distribution">Stable</emphasis>, which has the advantage to limit potential instability to a small number of chosen packages. <ulink type="block" url="http://backports.debian.org/" />
ru_ru: Неудивительно, что сервер <literal>backports.debian.org</literal> содержит “бэкпорты пакетов”. Этот термин относится к пакету нового программного обеспечения, которое было перекомпилировано под более старый дистрибутив, обычно это <emphasis role="distribution">Stable</emphasis>. Когда этот дистрибутив слегка устаревает, многочисленные проекты программного обеспечения выпускают новые версии, которые не включаются в текущую ветку <emphasis role="distribution">Stable</emphasis> (которая изменяется только в случае устранения критических уязвимостей, таких как проблемы с безопасностью). Поскольку дистрибутивы <emphasis role="distribution">Testing</emphasis> и <emphasis role="distribution">Unstable</emphasis> могут быть нестабильными, некоторые добровольцы иногда предлагают перекомпилированные приложения для <emphasis role="distribution">Stable</emphasis>, преимуществом которого является возможность ограничивать потенциальную нестабильность ограниченным числом избранных пакетов. <ulink type="block" url="http://backports.debian.org/" />

source: The <filename>sources.list</filename> entry for backports targeting the <emphasis role="distribution">Squeeze</emphasis> distribution is the following:
ru_ru: Запись в файле <filename>sources.list</filename> для бэкпортов дистрибутива <emphasis role="distribution">Squeeze</emphasis> является следующей:

source: The <emphasis role="distribution">Experimental</emphasis> Repository
ru_ru: Репозиторий <emphasis role="distribution">Experimental</emphasis>
