Repository: sash-kan/debian-handbook-ru
Catalog: */06_apt.po
Languages: ru_ru

source: Falcot computers are a heterogeneous system, with machines having various functions. Administrators will therefore pick the most relevant solution for each computer.
ru_ru: Компьютеры Falcot представляют собой гетерогенную систему, узлы которой выполняют разнообразные функции. Поэтому администраторы выбирают наиболее подходящие решения для каждого компьютера.

source: In practice, the servers running <emphasis role="distribution">Squeeze</emphasis> are configured with the “miracle combination” above, and are kept up to date automatically. Only the most critical servers (the firewalls, for instances) are set up with <command>apticron</command>, so that upgrades always happen under the supervision of an administrator.
ru_ru: На практике серверы с установленным <emphasis role="distribution">Squeeze</emphasis> настроены с помощью вышеописанной “чудесной связки” и автоматически поддерживаются в актуальном состоянии. Только наиболее критичные серверы (межсетевые экраны, например) используют <command>apticron</command>, а обновление всегда выполняется под контролем администратора.

source: The office workstations in the administrative services also run <emphasis role="distribution">Squeeze</emphasis>, but they are configured with the <command>update-notifier</command>/<command>update-manager</command> combination, so that users trigger the upgrades themselves. The rationale for this decision is that if upgrades happen without an explicit action, the behavior of the computer might change unexpectedly, which could cause confusion for the main users.
ru_ru: На офисных рабочих станциях также установлен <emphasis role="distribution">Squeeze</emphasis>, но там настроена связка <command>update-notifier</command>/<command>update-manager</command>, поэтому пользователи самостоятельно запускают обновление. Объяснением такого решения служит тот факт, что в случае обновления без каких-либо явных действий поведение компьютера может неожиданно измениться, что может озадачить пользователей.

source: In the lab, the few computers using <emphasis role="distribution">Testing</emphasis> — to take advantage of the latest software versions — are not upgraded automatically either. Administrators only configure APT to prepare the upgrades but not enact them; when they decide to upgrade (manually), the tedious parts of refreshing package lists and downloading packages will be avoided, and administrators can focus on the really useful part.
ru_ru: В лаборатории имеются несколько компьютеров под управлением <emphasis role="distribution">Testing</emphasis> для использования последних версий программ, которые автоматически не обновляются. Администраторы настроили APT подготавливать обновления, но не запускать их; когда они решат обновиться (в ручном режиме), то самая утомительная часть по обновлению списка пакетов и загрузке пакетов уже будет выполнена, и администраторы смогут сосредоточиться на действительно необходимых задачах.

source: Searching for Packages
ru_ru: Поиск пакетов

source: With the large and ever-growing amount of software in Debian, there emerges a paradox: Debian usually has a tool for most tasks, but that tool can be very difficult to find amongst the myriad other packages. The lack of appropriate ways to search for (and to find) the right tool has long been a problem. Fortunately, this problem has almost entirely been solved.
ru_ru: В Debian существует парадокс с огромным и постоянно растущим объёмом программного обеспечения: Debian обладает инструментами для любых задач, но найти эти инструменты среди бесчисленных пакетов затруднительно. Недостаток способов поиска (и нахождения) подходящего инструмента достаточно долго был проблемой. К счастью, эта проблема практически полностью решена.

source: The most trivial search possible is looking up an exact package name. If <command>apt-cache show <replaceable>package</replaceable></command> returns a result, then the package exists. Unfortunately, this requires knowing or even guessing the package name, which isn't always possible.
ru_ru: Самый простой из всех возможных способов поиска - поиск по точному имени пакета. Если <command>apt-cache show <replaceable>package</replaceable></command> возвращает результат, то этот пакет существует. К сожалению, такой подход требует знания или предположения об имени пакета, что не всегда возможно.

source: <emphasis>TIP</emphasis> Package naming conventions
ru_ru: <emphasis>СОВЕТ</emphasis> Соглашения по наименованию пакетов

source: Some categories of packages are named according to a conventional naming scheme; knowing the scheme can sometimes allow you to guess exact package names. For instance, for Perl modules, the convention says that a module called <literal>XML::Handler::Composer</literal> upstream should be packaged as <emphasis role="pkg">libxml-handler-composer-perl</emphasis>. The library enabling the use of the <command>gconf</command> system from Python is packaged as <emphasis role="pkg">python-gconf</emphasis>. It is unfortunately not possible to define a fully general naming scheme for all packages, even though package maintainers usually try to follow the choice of the upstream developers.
ru_ru: Некоторые категории пакетов именуются в соответствии с определённой схемой назначения имени; знание этой схемы может иногда помочь вам угадать точное название пакета. Например, в случае с модулями Perl соглашение гласит, что модуль с именем <literal>XML::Handler::Composer</literal> должен быть упакован в <emphasis role="pkg">libxml-handler-composer-perl</emphasis>. Библиотека, предоставляющая доступ к системе <command>gconf</command> из Python, упакована в <emphasis role="pkg">python-gconf</emphasis>. К сожалению, определить общую схему именования для всех пакетов не представляется возможным, хотя сопровождающие обычно стараются следовать модели, принятой у вышестоящих разработчиков.

source: A slightly more successful searching pattern is a plain-text search in package names, but it remains very limited. You can generally find results by searching package descriptions: since each package has a more or less detailed description in addition to its package name, a keyword search in these descriptions will often be useful. <command>apt-cache</command> is the tool of choice for this kind of search; for instance, <command>apt-cache search video</command> will return a list of all packages whose name or description contains the keyword “video”.
ru_ru: Несколько более удачный подход предполагает использование обычного текста для поиска в именах пакетов, но он всё ещё слишком ограничен. В общем случае вы можете получить результат от поиска в описаниях пакетов: поскольку каждый пакет имеет более или менее подробное описание в дополнение к своему имени, то поиск по ключевым словам в этих описаниях часто может быть полезен. <command>apt-cache</command> - это инструмент для подобного поиска; например, <command>apt-cache search video</command> выведет список всех пакетов, чьи имена или описания содержат слово “video”.

source: For more complex searches, a more powerful tool such as <command>aptitude</command> is required. <command>aptitude</command> allows you to search according to a logical expression based on the package's meta-data fields. For instance, the following command searches for packages whose name contains <literal>kino</literal>, whose description contains <literal>video</literal> and whose maintainer's name contains <literal>paul</literal>:
ru_ru: Для более сложных поисковых запросов требуется более мощный инструмент, такой как <command>aptitude</command>. <command>aptitude</command> позволяет выполнять поиск по полям метаданных в пакетах в соответствии с логическим выражением. Например, следующая команда ищет пакеты, имена которых содержат <literal>kino</literal>, описание содержит <literal>video</literal> и имя сопровождающего содержит <literal>paul</literal>:

source: The search only returns one package, <emphasis role="pkg">kino</emphasis>, which satisfies all three criteria.
ru_ru: Поиск возвращает только один пакет - <emphasis role="pkg">kino</emphasis> - который удовлетворяет всем трём критериям.

source: Even these multi-criteria searches are rather unwieldy, which explains why they are not used as much as they could. A new tagging system has therefore been developed, and it provides a new approach to searching. Packages are given tags that provide a thematical classification along several strands, known as a “facet-based classification”. In the case of <emphasis role="pkg">kino</emphasis> above, the package's tags indicate that Kino is a Gnome-based software that works on video data and whose main purpose is editing.
ru_ru: Но такие запросы по множеству критериев громоздки, что объясняет их не столь высокую популярность, каковой она могла бы быть. Поэтому была разработана новая система меток, которая предлагает новый подход к поиску. Пакетам назначаются метки, которые обеспечивают тематическую классификацию по нескольким направлениям, известную как “фасетная классификация”. В приведённом выше примере с <emphasis role="pkg">kino</emphasis> метки пакета указывают на то, что Kino - это программа, основанная на Gnome, которая работает с видеоданными и предназначена для их редактирования.

source: Browsing this classification can help you to search for a package which corresponds to known needs; even if it returns a (moderate) number of hits, the rest of the search can be done manually. To do that, you can use the <literal>~G</literal> search pattern in <command>aptitude</command>, but it is probably easier to simply navigate the site where tags are managed: <ulink type="block" url="http://debtags.alioth.debian.org/cloud/" /> Selecting the <literal>works-with::video</literal> and <literal>use::editing</literal> tags yields a handful of packages, including the <emphasis role="pkg">kino</emphasis> and <emphasis role="pkg">pitivi</emphasis> video editors. This system of classification is bound to be used more and more as time goes on, and package managers will gradually provide efficient search interfaces based on it. <indexterm><primary><emphasis role="pkg">debtags</emphasis></primary></indexterm> <indexterm><primary>tag</primary></indexterm>
ru_ru: Навигация по классификации поможет вам найти пакет, который удовлетворяет вашим потребностям; даже если она возвращает некоторое (небольшое) количество пакетов, то оставшаяся часть поиска может быть выполнена вручную. Для этого можно использовать шаблон поиска <literal>~G</literal> в <command>aptitude</command>, но, вероятно, проще всего будет перейти на сайт, на котором осуществляется управление метками: <ulink type="block" url="http://debtags.alioth.debian.org/cloud/" /> Выбор меток <literal>works-with::video</literal> и <literal>use::editing</literal> приводит к целой пригоршне пакетов, включая видеоредакторы <emphasis role="pkg">kino</emphasis> и <emphasis role="pkg">pitivi</emphasis>. Эта система классификации приобретает популярность со временем и управляющие пакетами постепенно предоставляют эффективные интерфейсы поиска, основанные на ней. <indexterm><primary><emphasis role="pkg">debtags</emphasis></primary></indexterm> <indexterm><primary>tag</primary></indexterm>

source: To sum up, the best tool for the job depends on the complexity of the search that you wish to do:
ru_ru: В заключение, выбор наилучшего инструмента для поиска будет зависеть от сложности вашего поискового запроса:

source: <command>apt-cache</command> only allows searching in package names and descriptions, which is very convenient when looking for a particular package that matches a few target keywords;
ru_ru: <command>apt-cache</command> позволяет искать только в именах и описаниях пакетов, что может быть удобно при поиске определённого пакета, удовлетворяющего нескольким ключевым словам;

source: when the search criteria also include relationships between packages or other meta-data such as the name of the maintainer, <command>synaptic</command> will be more useful;
ru_ru: если же критерий поиска включает в себя взаимосвязь между пакетами или другие метаданные, такие как, например, имя сопровождающего, то <command>synaptic</command> будет более полезным;

source: when a tag-based search is needed, a good tool is <command>packagesearch</command>, a graphical interface dedicated to searching available packages along several criteria (including the names of the files that they contain);
ru_ru: если требуется поиск по меткам, то хорошим инструментом будет <command>packagesearch</command> - графический интерфейс, предназначенный для поиска доступных пакетов по нескольким критериям (включая имена файлов, которые в них содержатся);

source: finally, when the searches involve complex expressions with logic operations, the tool of choice will be <command>aptitude</command>'s search pattern syntax, which is quite powerful despite being somewhat obscure; it works in both the command-line and the interactive modes.
ru_ru: и, наконец, когда поисковые запросы состоят из сложных выражений с логическими операциями, тогда подходящим инструментом будет синтаксис поисковых шаблонов <command>aptitude</command>, являющийся довольно мощным не смотря на то, что он слегка непонятен; он работает как в командной строке, так и в интерактивном режиме.
