Repository: sash-kan/debian-handbook-ru
Catalog: */06_apt.po
Languages: ru_ru

source: To conclude this section, let's note that <command>aptitude</command> has more elaborate algorithms compared to <command>apt-get</command> when it comes to resolving difficult situations. When a set of actions is requested and when these combined actions would lead to an incoherent system, <command>aptitude</command> evaluates several possible scenarios and presents them in order of decreasing relevance. However, these algorithms are not failproof. Fortunately there is always the possibility to manually select the actions to perform. When the currently selected actions lead to contradictions, the upper part of the screen indicates a number of “broken” packages (and you can directly navigate to those packages by pressing <keycombo><keycap>b</keycap></keycombo>). It is then possible to manually build a solution for the problems found. In particular, you can get access to the different available versions by simply selecting the package with <keycombo><keycap>Enter</keycap></keycombo>. If the selection of one of these versions solves the problem, you should not hesitate to use the function. When the number of broken packages gets down to zero, you can safely go the summary screen of pending actions for a last check before you apply them.
ru_ru: В завершение этого раздела следует отметить, что <command>aptitude</command> использует более продуманные алгоритмы по сравнению с <command>apt-get</command> в части разрешения сложных ситуаций. В случае запроса целого набора действий и когда эти действия совместно могут привести к бессвязной системе, <command>aptitude</command> оценивает несколько возможных сценариев и выводит их в порядке уменьшения значимости. Данные алгоритмы, однако, не безошибочны. К счастью, всегда существует возможность ручного выбора требуемого действия. В том случае, когда выбранные действия противоречивы, в верхней части экрана выводится список “поломанных” пакетов (и вы можете перейти непосредственно к этим пакетам, нажав <keycombo><keycap>b</keycap></keycombo>). Далее уже в ручном режиме возможно принять решение по найденным проблемам. В частности, вы можете получить доступ к разным версиям пакета просто выделив его и нажав <keycombo><keycap>Enter</keycap></keycombo>. В том случае, когда выбор одной из версий позволяет решить проблему, вам стоит без колебаний воспользоваться данной функцией. Вы можете с уверенностью перейти к общему экрану ожидающих выполнения действий для последней проверки перед их применением в том случае, когда количество сломанных пакетов снизится до нуля.

source: <emphasis>NOTE</emphasis> <command>aptitude</command>'s log
ru_ru: <emphasis>ЗАМЕТКА</emphasis> Журнал <command>aptitude</command>

source: Like <command>dpkg</command>, <command>aptitude</command> keeps a trace of executed actions in its logfile (<filename>/var/log/aptitude</filename>). However, since both commands work at a very different level, you cannot find the same information in their respective logfiles. While <command>dpkg</command> logs all the operations executed on individual packages step by step, <command>aptitude</command> gives a broader view of high-level operations like a system-wide upgrade.
ru_ru: Как и <command>dpkg</command>, <command>aptitude</command> хранит записи выполненных действий в своём журнале (<filename>/var/log/aptitude</filename>). Но поскольку эти две команды работают на разных уровнях, вы не сможете найти одинаковые записи в их журналах. <command>dpkg</command> записывает все операции, выполняемые с отдельными пакетами пошагово, в то время как <command>aptitude</command> предоставляет более широкий обзор высокоуровневых операций, таких как обновление в рамках всей системы.

source: Beware, this logfile only contains a summary of operations performed by <command>aptitude</command>. If other front-ends (or even <command>dpkg</command> itself) are occasionally used, then <command>aptitude</command>'s log will only contain a partial view of the operations, so you can't rely on it to build a trustworthy history of the system.
ru_ru: Будьте внимательны, в этом файле журнала содержатся только краткие записи операций, выполненных <command>aptitude</command>. Если периодически используются другие оболочки (или даже сама <command>dpkg</command>), то в журнале <command>aptitude</command> будет отражена только часть операций, поэтому не стоит полагаться на этот журнал для составления подлинной истории изменений в системе.

source: <command>synaptic</command> is a graphical package manager for Debian which features a clean and efficient graphical interface based on GTK+/GNOME. Its many ready-to-use filters give fast access to newly available packages, installed packages, upgradable packages, obsolete packages and so on. If you browse through these lists, you can select the operations to be done on the packages (install, upgrade, remove, purge); these operations are not performed immediately, but put into a task list. A single click on a button then validates the operations, and they are performed in one go.
ru_ru: <command>synaptic</command> - это графический менеджер пакетов для Debian, имеющий простой и эффективный графический интерфейс, основанный на GTK+/GNOME. Множество готовых фильтров, содержащихся в нём, предоставляют быстрый доступ к новым пакетам; установленным пакетам; пакетам, для которых доступно обновление; устаревшим пакетам и так далее. При навигации по этим спискам пакетов вы можете выбрать действие, которое требуется совершить с данными пакетами (установка, обновление, удаление, полная очистка); эти операции не выполняются немедленно, а заносятся в список задач. Простое нажатие одной кнопки подтверждает операции и они все выполняются за один раз.

source: <command>synaptic</command> package manager
ru_ru: Менеджер пакетов <command>synaptic</command>

source: Checking Package Authenticity
ru_ru: Проверка подлинности пакетов

source: <primary>package</primary><secondary>authenticity check</secondary>
ru_ru: <primary>пакет</primary><secondary>проверка подлинности</secondary>

source: <primary>package</primary><secondary>seal</secondary>
ru_ru: <primary>пакет</primary><secondary>печать</secondary>

source: <primary>pacakage</primary><secondary>signature</secondary>
ru_ru: <primary>пакет</primary><secondary>подпись</secondary>

source: <primary>signature</primary><secondary>of a package</secondary>
ru_ru: <primary>подпись</primary><secondary>пакета</secondary>

source: Security is very important for Falcot Corp administrators. Accordingly, they need to ensure that they only install packages which are guaranteed to come from Debian with no tampering on the way. A computer cracker could try to add malicious code to an otherwise legitimate package. Such a package, if installed, could do anything the cracker designed it to do, including for instance disclosing passwords or confidential information. To circumvent this risk, Debian provides a tamper-proof seal to guarantee — at install time — that a package really comes from its official maintainer and hasn't been modified by a third party.
ru_ru: Безопасность очень важна для администраторов Falcot Corp. Соответственно, они должны быть уверены, что устанавливают те пакеты, что гарантированно предоставляются Debian без каких-либо вмешательств третьих лиц. Компьютерный взломщик может попытаться внести вредоносный код в легальный пакет. После установки такой пакет мог бы выполнять любые действия, которые взломщик заложил в него, включая, например, раскрытие паролей или конфиденциальной информации. Debian предоставляет устойчивую к взлому печать с целью предотвращения таких рисков, на этапе установки она гарантирует, что пакет действительно получен от официального сопровождающего и не был изменён третьим лицом.

source: The seal works with a chain of cryptographical hashes and a signature. The signed file is the <filename>Release</filename> file, provided by the Debian mirrors. It contains a list of the <filename>Packages</filename> files (including their compressed forms, <filename>Packages.gz</filename> and <filename>Packages.bz2</filename>, and the incremental versions), along with their MD5, SHA1 and SHA256 hashes, which ensures that the files haven't been tampered with. These <filename>Packages</filename> files contain a list of the Debian packages available on the mirror, along with their hashes, which ensures in turn that the contents of the packages themselves haven't been altered either.
ru_ru: Эта печать работает с последовательностью криптографических хэшей и подписью. Подписанный файл - это файл <filename>Release</filename>, предоставляемый зеркалами Debian. Он содержит список файлов <filename>Packages</filename> (включая их сжатые виды, <filename>Packages.gz</filename> и <filename>Packages.bz2</filename>, а также инкрементальные версии), совместно с их хэшами MD5, SHA1 и SHA256, которые удостоверяют, что файлы не были модифицированы. Файлы <filename>Packages</filename> содержат список пакетов Debian, доступных на данном зеркале, совместно с их хэшами, что удостоверяет в свою очередь, что содержимое самих пакетов также не было изменено.

source: The trusted keys are managed with the <command>apt-key</command> command found in the <emphasis role="pkg">apt</emphasis> package. This program maintains a keyring of GnuPG public keys, which are used to verify signatures in the <filename>Release.gpg</filename> files available on the mirrors. It can be used to add new keys manually (when non-official mirrors are needed). Generally however, only the official Debian keys are needed. These keys are automatically kept up-to-date by the <emphasis role="pkg">debian-archive-keyring</emphasis> package (which invokes <command>apt-key</command> when it is installed or upgraded). However, the first installation of this particular package requires caution: even if the package is signed like any other, the signature cannot be verified externally. Cautious administrators should therefore check the fingerprints of imported keys before trusting them to install new packages:
ru_ru: Управление доверенными ключами осуществляются командой <command>apt-key</command>, которую можно найти в пакете <emphasis role="pkg">apt</emphasis>. Эта программа содержит связку открытых GnuPG ключей, которые используются для проверки подписей в файлах <filename>Release.gpg</filename>, доступных на зеркалах. Её можно использовать для добавления новых ключей вручную (в том случае, когда необходимы неофициальные зеркала). Однако в большинстве случаев требуются только официальные ключи Debian. Эти ключи автоматически поддерживаются в актуальном состоянии пакетом <emphasis role="pkg">debian-archive-keyring</emphasis> (который вызывает <command>apt-key</command> после собственной установки или обновления). Однако первая установка именно этого пакета требует внимания: даже если пакет и подписан, как и прочие, его подпись нельзя проверить внешне. Поэтому внимательные администраторы должны проверять сигнатуры импортируемых ключей до того, как доверить им установку новых пакетов.

source: <emphasis>IN PRACTICE</emphasis> Adding trusted keys
ru_ru: <emphasis>НА ПРАКТИКЕ</emphasis> Добавление доверенных ключей

source: <primary>trusted key</primary>
ru_ru: <primary>доверенные ключ</primary>

source: When a third-party package source is added to the <filename>sources.list</filename> file, APT needs to be told about the corresponding GPG trusted key (otherwise it will keep complaining that it can't ensure the authenticity of the packages coming from that repository). The first step is of course to get the public key. More often than not, the key will be provided as a small text file, which we'll call <filename>key.asc</filename> in the following examples.
ru_ru: Когда сторонний источник пакетов добавлен в файл <filename>sources.list</filename>, APT необходимо указать на соответствующий доверенный GPG ключ (в противном случае она продолжит жаловаться на то, что подлинность пакетов из этого источника не может быть удостоверена). Первым шагом, разумеется, будет получение открытого ключа. Обычно этот ключ предоставляется в виде небольшого тестового файла, который мы будем называть <filename>key.asc</filename> в последующих примерах.

source: To add the key to the trusted keyring, the administrator can run <command>apt-key add &lt; key.asc</command>. Another way is to use the <command>synaptic</command> graphical interface: its “Authentication” tab in the <menuchoice><guimenu>Settings</guimenu> <guisubmenu>Repositories</guisubmenu></menuchoice> menu gives the possibility of importing a key from the <filename>key.asc</filename> file.
ru_ru: Для добавления ключа в доверенную связку администратор может выполнить команду <command>apt-key add &lt; key.asc</command>. Другой путь - использовать графический интерфейс <command>synaptic</command>: вкладка “Аутентификация” в меню <menuchoice><guimenu>Настройки</guimenu> <guisubmenu>Репозитории</guisubmenu></menuchoice> предоставляет возможность импорта ключа из файла <filename>key.asc</filename>.

source: For people who would want a dedicated application and more details on the trusted keys, it is possible to use <command>gui-apt-key</command> (in the package of the same name), a small graphical user interface which manages the trusted keyring. <indexterm><primary><emphasis role="pkg">gui-apt-key</emphasis></primary></indexterm>
ru_ru: Для тех же, кто захочет отдельное приложение и дополнительную информацию по доверенным ключам, существует <command>gui-apt-key</command> (находится в пакете с аналогичным именем), которая является скромным графическим интерфейсом для управления доверенной связкой. <indexterm><primary><emphasis role="pkg">gui-apt-key</emphasis></primary></indexterm>

source: Once the appropriate keys are in the keyring, APT will check the signatures before any risky operation, so that front-ends will display a warning if asked to install a package whose authenticity can't be ascertained.
ru_ru: Как только подходящие ключи будут в связке, APT проверит подписи до выполнения каких-либо опасных операций, таким образом оболочки отобразят предупреждающее сообщение при установке пакета, подлинность которого не может быть установлена.

source: Upgrading from One Stable Distribution to the Next
ru_ru: Обновление от одного стабильного дистрибутива к следующему

source: One of the best-known features of Debian is its ability to upgrade an installed system from one stable release to the next: <foreignphrase>dist-upgrade</foreignphrase> — a well-known phrase — has largely contributed to the project's reputation. With a few precautions, upgrading a computer can take as little as a few, or a few dozen, minutes depending on the download speed from the package repositories.
ru_ru: Одной из широко известных особенностей Debian является его возможность обновить установленную систему от одного стабильного выпуска к следующему: <foreignphrase>dist-upgrade</foreignphrase> - хорошо известная фраза - внесла огромный вклад в репутацию проекта. С некоторыми предосторожностями обновление системы займёт несколько минут или несколько десятков минут в зависимости от скорости загрузки из репозитория пакетов.

source: Recommended Procedure
ru_ru: Рекомендованная Процедура

source: Since Debian has quite some time to evolve in-between stable releases, you should read the release notes before upgrading.
ru_ru: Поскольку Debian требуется некоторое время на развитие между очередными стабильными выпусками, вам следует читать сопроводительные записи до обновления.

source: <emphasis>BACK TO BASICS</emphasis> Release notes
ru_ru: <emphasis>К ОСНОВАМ</emphasis> Сопроводительные записи

source: The release notes for an operating system (and, more generally, for any software) are a document giving an overview of the software, with some details concerning the particularities of one version. These documents are generally short compared to the complete documentation, and they usually list the features which have been introduced since the previous version. They also give details on upgrading procedures, warnings for users of previous versions, and sometimes errata.
ru_ru: Сопроводительные записи для операционной системы (и, в общем, для любого программного обеспечения) - это документ, представляющий обзор программы и некоторые детали относительно особенностей одной из версий. Этот документ в большинстве случаев значительно короче полной документации и в нём обычно перечислены функции, реализованные с момента выхода последней версии. В записках также представлены пояснения по процедуре обновления, предупреждения для пользователей предыдущих версий, а иногда и список опечаток.

source: Release notes are available online: the release notes for the current stable release have a dedicated URL, while older release notes can be found with their codenames: <ulink type="block" url="http://www.debian.org/releases/stable/releasenotes" /> <ulink type="block" url="http://www.debian.org/releases/lenny/releasenotes" />
ru_ru: Сопроводительные записки доступны в сети: сопроводительные записки текущей стабильной версии имеют специальный URL, в то время как записки для более старых версий могут быть найдены по их кодовым именам: <ulink type="block" url="http://www.debian.org/releases/stable/releasenotes" /> <ulink type="block" url="http://www.debian.org/releases/lenny/releasenotes" />

source: In this section, we will focus on upgrading a <emphasis role="distribution">Lenny</emphasis> system to <emphasis role="distribution">Squeeze</emphasis>. This is a major operation on a system; as such, it is never 100% risk-free, and should not be attempted before all important data has been backed up.
ru_ru: В этом разделе мы сосредоточимся на обновлении системы <emphasis role="distribution">Lenny</emphasis> до <emphasis role="distribution">Squeeze</emphasis>. Это глобальная системная операция, поэтому она не может быть безопасной на 100% и её следует предпринимать после резервного копирования всех важных данных.

source: Another good habit which makes the upgrade easier (and shorter) is to tidy your installed packages and keep only the ones that are really needed. Helpful tools to do that include <command>aptitude</command>, <command>deborphan</command> and <command>debfoster</command> (see <xref linkend="aptitude" />). For example, you can use the following command:
ru_ru: Ещё одна хорошая привычка, позволяющая упростить (и ускорить) обновление - приводить в порядок установленные пакеты и хранить только те, что действительно необходимы. Полезными инструментами для этой задачи являются <command>aptitude</command>, <command>deborphan</command> и <command>debfoster</command> (см. <xref linkend="aptitude" />). Например, вы можете воспользоваться следующей командой:

source: Now for the upgrading itself. First, you need to change the <filename>/etc/apt/sources.list</filename> file to tell APT to get its packages from <emphasis role="distribution">Squeeze</emphasis> instead of <emphasis role="distribution">Lenny</emphasis>. If the file only contains references to <emphasis role="distribution">Stable</emphasis> rather than explicit codenames, the change isn't even required, since <emphasis role="distribution">Stable</emphasis> always refers to the latest released version of Debian. In both cases, the database of available packages must be refreshed (with the <command>aptitude update</command> command or the refresh button in <command>synaptic</command>).
ru_ru: А теперь непосредственно к обновлению. Во-первых, вам необходимо изменить файл <filename>/etc/apt/sources.list</filename> и указать APT получать пакеты из <emphasis role="distribution">Squeeze</emphasis>, а не <emphasis role="distribution">Lenny</emphasis>. Если файл содержит ссылки только на версию <emphasis role="distribution">Stable</emphasis>, а не на её кодовое имя, то никаких изменений не требуется, поскольку <emphasis role="distribution">Stable</emphasis> всегда указывает на последнюю выпущенную версию Debian. В обоих случаях необходимо обновить базу данных доступных пакетов (командой <command>aptitude update</command> или кнопкой обновления в <command>synaptic</command>).

source: Once these new package sources are registered, you need to upgrade the <emphasis role="pkg">aptitude</emphasis> and <emphasis role="pkg">apt</emphasis> packages; their versions in <emphasis role="distribution">Lenny</emphasis> have some limitations that could compromise the automatic upgrade.
ru_ru: Как только эти новые источники пакетов будут зарегистрированы, вам необходимо обновить пакеты <emphasis role="pkg">aptitude</emphasis> и <emphasis role="pkg">apt</emphasis>; их версии в <emphasis role="distribution">Lenny</emphasis> имеют некоторые ограничения, которые могут подвергнуть опасности автоматическое обновление.

source: Remember to upgrade (or install) the most essential packages listed below, otherwise you might find that your system is unbootable:
ru_ru: Не забудьте обновить (или установить) наиболее важные пакеты, перечисленные ниже, в противном случае вы можете обнаружить, что ваша система не загружается:

source: the bootloader <emphasis role="pkg">grub-pc</emphasis> or <emphasis role="pkg">grub-legacy</emphasis> (sometimes <emphasis role="pkg">lilo</emphasis>);
ru_ru: загрузчик <emphasis role="pkg">grub-pc</emphasis> или <emphasis role="pkg">grub-legacy</emphasis> (иногда <emphasis role="pkg">lilo</emphasis>);

source: the tools that build the initial ramdisk (initrd): <emphasis role="pkg">initramfs-tools</emphasis>;
ru_ru: инструменты, создающие первоначальный виртуальный диск (initrd): <emphasis role="pkg">initramfs-tools</emphasis>;

source: the standard library: <emphasis role="pkg">libc6</emphasis> or one of its optimized variants such as <emphasis role="pkg">libc6-i686</emphasis>;
ru_ru: стандартная библиотека: <emphasis role="pkg">libc6</emphasis> или один из её оптимизированных вариантов, как например <emphasis role="pkg">libc6-i686</emphasis>;

source: the management system for device files: <emphasis role="pkg">udev</emphasis>;
ru_ru: система управления файлами устройств: <emphasis role="pkg">udev</emphasis>;

source: last but not least, the kernel: depending on the hardware, the metapackages to use are <emphasis role="pkg">linux-image-486</emphasis>, <emphasis role="pkg">linux-image-686</emphasis> or <emphasis role="pkg">linux-image-686-bigmem</emphasis>. These packages will only work for the i386 architecture; owners of computers based on different hardware will use other packages, most likely <emphasis role="pkg">linux-image-2.6-amd64</emphasis> for AMD64 or <emphasis role="pkg">linux-image-powerpc*</emphasis> for PowerPC).
ru_ru: и последний по порядку, но не по значимости - ядро: в зависимости от аппаратного обеспечения используются метапакеты <emphasis role="pkg">linux-image-486</emphasis>, <emphasis role="pkg">linux-image-686</emphasis> или <emphasis role="pkg">linux-image-686-bigmem</emphasis>. Эти пакеты будут работать только на архитектуре i386; владельцы компьютеров с другим типом аппаратного обеспечения будут использовать другие пакеты, вероятнее всего <emphasis role="pkg">linux-image-2.6-amd64</emphasis> для AMD64 или <emphasis role="pkg">linux-image-powerpc*</emphasis> для PowerPC.
