Repository: sash-kan/debian-handbook-ru
Catalog: */06_apt.po
Languages: ru_ru

source: The archive of <emphasis role="distribution">Experimental</emphasis> packages is present on all Debian mirrors, and contains packages which are not in the <emphasis role="distribution">Unstable</emphasis> version yet because of their substandard quality — they are often software development versions or pre-versions (alpha, beta, release candidate…). A package can also be sent there after undergoing subsequent changes which can generate problems. The maintainer then tries to uncover them thanks to advanced users who can manage important issues. After this first stage, the package is moved into <emphasis role="distribution">Unstable</emphasis>, where it reaches a much larger audience and where it will be tested in much more detail.
ru_ru: Архив пакетов ветки <emphasis role="distribution">Experimental</emphasis> присутствует на всех зеркалах Debian и содержит пакеты, которые пока ещё не включены в <emphasis role="distribution">Unstable</emphasis> по причине их низкого качества - обычно это рабочие или предварительные версии программ (пре-альфа, бета, предвыпускная версия…). Пакет также может быть отправлен туда после текущих последовательных изменений, которые могут вызвать проблемы. Далее сопровождающий старается локализовать их с помощью опытных пользователей, которым по силам справиться с основными проблемами. После этой начальной стадии пакет перемещается в <emphasis role="distribution">Unstable</emphasis>, где он становится доступным значительно большей аудитории и где он будет тестироваться тщательнее.

source: <emphasis role="distribution">Experimental</emphasis> is generally used by users who do not mind breaking their system and then repairing it. This distribution gives the possibility to import a package which a user wants to try or use as the need arises. That is exactly how Debian approaches it, since adding it in APT's <filename>sources.list</filename> file does not lead to the systematic use of its packages. The line to be added is:
ru_ru: <emphasis role="distribution">Experimental</emphasis> обычно используется теми пользователями, которые готовы разрушить свою систему, а затем восстановить её. Эта сборка предоставляет возможность импортировать тот пакет, который пользователь хочет попробовать или использовать при возникшей необходимости. Именно так Debian подходит к этой сборке, поскольку её добавление в файл <filename>sources.list</filename> утилиты APT не приводит к систематическому использованию пакетов этой сборки. Строка, которую необходимо добавить:

source: Non-Official Resources: <literal>apt-get.org</literal> and <literal>mentors.debian.net</literal>
ru_ru: Неофициальные ресурсы: <literal>apt-get.org</literal> и <literal>mentors.debian.net</literal>

source: There are numerous non-official sources of Debian packages set up by advanced users who have recompiled some softwares, by programmers who make their creation available to all, and even by Debian developers who offer pre-versions of their package online. A web site was set up to find these alternative sources more easily. It contains an impressive amount of Debian package sources which can immediately be integrated into <filename>sources.list</filename> files. However, be careful not to add random packages. Each source is designed for a particular version of Debian (the one used to compile the packages in question); each user should maintain a certain coherence in what they choose to install. <ulink type="block" url="http://www.apt-get.org/" />
ru_ru: Существуют многочисленные неофициальные источники пакетов Debian, подготовленные опытными пользователями, которые перекомпилировали часть программного обеспечения; программистами, которые сделали свои проекты доступными для всех; и даже разработчиками Debian, которые предлагают предварительные версии своих пакетов в сети. Для простого поиска этих альтернативных источников был создан сайт. Он содержится впечатляющее количество источников пакетов Debian, которые можно непосредственно добавить в файлы <filename>sources.list</filename>. Однако следует быть осторожным и не добавлять случайные пакеты. Каждый источник предназначен для определённой версии Debian (той, для которой пакет был собран); каждому пользователю нужно быть последовательным в том, что он выбирает для установки. <ulink type="block" url="http://www.apt-get.org/" />

source: The <literal>mentors.debian.net</literal> site is also interesting, since it gathers packages created by candidates to the status of official Debian developer or by volunteers who wish to create Debian packages without going through that process of integration. These packages are made available without any guarantee regarding their quality; make sure that you check their origin and integrity and then test them before you consider using them in production.
ru_ru: Сайт <literal>mentors.debian.net</literal> также является интересным ресурсом, поскольку на нём собраны пакеты, созданные кандидатами в официальные разработчики Debian или добровольцами, которые хотят создавать пакеты Debian без прохождения процедуры интеграции. Эти пакеты предоставляются без каких-либо гарантий качества; удостоверьтесь в их происхождении и целостности, а затем протестируйте прежде чем будете рассматривать эти пакеты для использования в производстве.

source: <emphasis>COMMUNITY</emphasis> The <literal>debian.net</literal> sites
ru_ru: <emphasis>СООБЩЕСТВО</emphasis> Сайты <literal>debian.net</literal>

source: The <emphasis>debian.net</emphasis> domain is not an official resource of the Debian project. Each Debian developer may use that domain name for their own use. These websites can contain unofficial services (sometimes personal sites) hosted on a machine which does not belong to the project and set up by Debian developers, or even prototypes about to be moved on to <emphasis>debian.org</emphasis>. Two reasons can explain why some of these prototypes remain on <emphasis>debian.net</emphasis>: either no one has made the necessary effort to transform it into an official service (hosted on the <emphasis>debian.org</emphasis> domain, and with a certain guarantee of maintenance), or the service is too controversial to be officialized.
ru_ru: Домен <emphasis>debian.net</emphasis> не является официальным ресурсом проекта Debian. Каждый разработчик Debian может использовать это доменное имя по своему усмотрению. Эти сайты могут содержать неофициальные сервисы (иногда частные сайты), размещенные на компьютере, не относящемуся к проекту и не обслуживаемому разработчиками Debian, или даже прототипы, которые в ближайшее время будут перемещены на <emphasis>debian.org</emphasis>. Существуют две причины, по которым эти прототипы остаются на <emphasis>debian.net</emphasis>: либо никто не предпринял достаточных усилий по преобразованию их в официальные сервисы (размещённые в домене <emphasis>debian.org</emphasis> и имеющие некоторую гарантию дальнейшего обслуживания), либо они слишком спорны для официальных сервисов.

source: Installing a package means giving root rights to its creator, because they decide on the contents of the initialization scripts which are run under that identity. Official Debian packages are created by volunteers who have been co-opted and reviewed and who can seal their packages so that their origin and integrity can be checked.
ru_ru: Установка пакета подразумевает передачу прав администратора автору пакета по той причине, что именно он определяет содержимое инициализационных скриптов, которые выполняются пакетом. Официальные пакеты Debian создаются добровольцами, работающими совместно и проводящими анализ, и которые могут подписать свои пакеты таким образом, что их целостность может быть проверена.

source: In general, be wary of a package whose origin you don't know and which isn't hosted on one of the official Debian servers: evaluate the degree to which you can trust the creator, and check the integrity of the package. <ulink type="block" url="http://mentors.debian.net/" />
ru_ru: В общем случае следует остерегаться пакетов, чьё происхождение вы не можете установить и которые не размещены на одном из официальных серверов Debian: определите уровень вашего доверия к автору и проверьте целостность пакета. <ulink type="block" url="http://mentors.debian.net/" />

source: <emphasis>GOING FURTHER</emphasis> Old package versions: <literal>snapshot.debian.org</literal>
ru_ru: <emphasis>ШАГ ВПЕРЁД</emphasis> Старые версии пакетов: <literal>snapshot.debian.org</literal>

source: A new service (introduced in April 2010) can be used to “go backwards in time” and to find an old version of a package. It can be used for example to identify which version of a package introduced a regression, and more concretely, to come back to the former version while waiting for the regression fix.
ru_ru: Для “путешествия назад в прошлое” и поиска старых версий пакетов существует новый сервис (представленный в апреле 2010). Его можно использовать, к примеру, для поиска той версии пакета, которая стала причиной ухудшений, а точнее для отката к предыдущей версии пакета и ожидания исправлений.

source: <command>aptitude</command> and <command>apt-get</command> Commands
ru_ru: Команды <command>aptitude</command> и <command>apt-get</command>

source: APT is a vast project, whose original plans included a graphical interface. It is based on a library which contains the core application, and <command>apt-get</command> is the first interface — command-line based — which was developed within the project.
ru_ru: APT - это обширный проект, в первоначальные планы которого входило создание графического интерфейса. Проект основан на библиотеке, содержащей базовое приложение, и <command>apt-get</command> в качестве первого интерфейса - консольного - разработанного в рамках проекта.

source: Numerous other graphical interfaces then appeared as external projects: <command>synaptic</command>, <command>aptitude</command> (which includes both a text mode interface and a graphical one — even if not complete yet), <command>wajig</command>, etc. The most recommended interface, <command>aptitude</command>, is the one used during the installation of Debian. Since its command-line syntax is very similar to <command>apt-get</command>'s, we will be focusing on <command>aptitude</command> in the examples given in this section. When there are major differences between <command>aptitude</command> and <command>apt-get</command>, these differences will be detailed.
ru_ru: Позже появились многочисленные внешние графические интерфейсы: <command>synaptic</command>, <command>aptitude</command> (который содержит как текстовый интерфейс, так и графический - пусть даже и не законченный), <command>wajig</command> и т. д. Чаще всего рекомендуемый интерфейс, <command>aptitude</command>, используется во время установки Debian. Поскольку его синтаксис командной строки очень похож на <command>apt-get</command>, мы сфокусируемся на <command>aptitude</command> в приведённых в этом разделе примерах. Если мы встретим существенные различия между <command>aptitude</command> и <command>apt-get</command>, то они будут описаны.

source: Initialization
ru_ru: Инициализация

source: For any work with APT, the list of available packages needs to be updated; this can be done simply through <command>aptitude update</command>. Depending on the speed of your connection, the operation can take a while since it involves downloading a certain number of <filename>Packages.(gz|bz2)</filename> files (or even <filename>Sources.(gz|bz2)</filename>), which have gradually become bigger and bigger as Debian has developed (more than 8 MB for the largest <filename>Packages.gz</filename> — from the <literal>main</literal> section). Of course, installing from a CD-ROM set does not require any downloading — in this case, the operation is very fast.
ru_ru: Для выполнения любой работы с APT необходимо обновить список пакетов; это делается простой командой <command>aptitude update</command>. Эта операция может занять некоторое время, которое зависит от скорости вашего соединения, поскольку она подразумевает загрузку определённого количества файлов <filename>Packages.(gz|bz2)</filename> (или даже <filename>Sources.(gz|bz2)</filename>), которые постепенно становятся всё больше и больше с развитием Debian (более 8 Мб для самого большого <filename>Packages.gz</filename> — из секции <literal>main</literal>). Разумеется, установка с CD-ROM не требует никакой загрузки - в этом случае операция выполняется быстро.

source: Installing and Removing
ru_ru: Установка и удаление

source: <primary>package</primary><secondary>installation</secondary>
ru_ru: <primary>пакет</primary><secondary>установка</secondary>

source: <primary>package</primary><secondary>removal</secondary>
ru_ru: <primary>пакет</primary><secondary>удаление</secondary>

source: <primary>installation</primary><secondary>of packages</secondary>
ru_ru: <primary>установка</primary><secondary>пакетов</secondary>

source: <primary>removal of a package</primary>
ru_ru: <primary>удаление пакета</primary>

source: With APT, packages can be added or removed from the system, respectively with <command>aptitude install <replaceable>package</replaceable></command> and <command>aptitude remove <replaceable>package</replaceable></command>. In both cases, APT will automatically install the necessary dependencies or delete the packages which depend on the package that is being removed. The <command>aptitude purge <replaceable>package</replaceable></command> or <command>apt-get purge <replaceable>package</replaceable></command> commands involve a complete uninstallation — the configuration files are also deleted.
ru_ru: Средствами APT пакеты могут быть добавлены или удалены из системы командами <command>aptitude install <replaceable>package</replaceable></command> и <command>aptitude remove <replaceable>package</replaceable></command> соответственно. В обоих случаях APT автоматически установит необходимые зависимости или удалит пакеты, которые зависят от удаляемого пакета. Команды <command>aptitude purge <replaceable>package</replaceable></command> или <command>apt-get purge <replaceable>package</replaceable></command> используются для полного удаления - удаляются также и конфигурационные файлы.

source: <emphasis>TIP</emphasis> Installing the same selection of packages several times
ru_ru: <emphasis>СОВЕТ</emphasis> Неоднократная установка одинакового набора пакетов

source: It can be useful to systematically install the same list of packages on several computers. This can be done quite easily.
ru_ru: Иногда необходимо систематически устанавливать одинаковый набор пакетов на несколько компьютеров. Сделать это довольно просто.

source: First, retrieve the list of packages installed on the computer which will serve as the “model” to copy.
ru_ru: Во-первых, нужно подготовить список пакетов, установленных на том компьютере, который будет служить “моделью” для копирования.

source: The <filename>pkg-list</filename> file then contains the list of installed packages. Next, transfer the <filename>pkg-list</filename> file on the computers you want to update and use the following commands:
ru_ru: Файл <filename>pkg-list</filename> будет содержать список установленных пакетов. Затем перенесите файл <filename>pkg-list</filename> на те компьютеры, которые вы хотите обновить, и используйте следующие команды:

source: The first command registers the list of packages you wish to install, then the <command>apt-get</command> invocation executes the required operations! <command>aptitude</command> does not have this command.
ru_ru: Первая команда регистрирует список тех пакетов, которые вы хотите установить, затем вызов <command>apt-get</command> выполняет требуемые операции. <command>aptitude</command> не имеет такой команды.

source: <emphasis>TIP</emphasis> Removing and installing at the same time
ru_ru: <emphasis>СОВЕТ</emphasis> Совместное удаление и установка

source: It is possible to ask <command>aptitude</command> (or <command>apt-get</command>) to install certain packages and remove others on the same command line by adding a suffix. With an <command>aptitude install</command> command, add “<literal>-</literal>” to the names of the packages you wish to remove. With an <command>aptitude remove</command> command, add “<literal>+</literal>” to the names of the packages you wish to install.
ru_ru: <command>aptitude</command> (или <command>apt-get</command>) можно попросить установить определённые пакеты или удалить некоторые одной командой с использованием суффикса. Добавьте “<literal>-</literal>” в вызове <command>aptitude install</command> перед именами тех пакетов, которые вы хотите удалить. Добавьте “<literal>+</literal>” в вызове <command>aptitude remove</command> перед именами тех пакетов, которые вы хотите установить.

source: The next example shows two different ways to install <replaceable>package1</replaceable> and to remove <replaceable>package2</replaceable>.
ru_ru: Следующий пример демонстрирует два различных способа установить <replaceable>package1</replaceable> и удалить <replaceable>package2</replaceable>.

source: <emphasis>TIP</emphasis> <command>apt-get --reinstall</command> and <command>aptitude reinstall</command>
ru_ru: <emphasis>СОВЕТ</emphasis> <command>apt-get --reinstall</command> и <command>aptitude reinstall</command>

source: The system can sometimes be damaged after the removal or modification of files in a package. The easiest way to retrieve these files is to reinstall the affected package. Unfortunately, the packaging system finds that the latter is already installed and politely refuses to reinstall it; to avoid this, use the <literal>--reinstall</literal> option of the <command>apt-get</command> command. The following command reinstalls <emphasis role="pkg">postfix</emphasis> even if it is already present:
ru_ru: Иногда система может быть повреждена в результате удаления или изменения файлов пакета. Переустановка повреждённого пакета является самым простым способом восстановления этих файлов. К сожалению, пакетная система обнаруживает, что эти файлы уже установлены и вежливо отказывается вновь их устанавливать; чтобы избежать такого поведения, используйте опцию <literal>--reinstall</literal> команды <command>apt-get</command>. Следующая команда переустанавливает <emphasis role="pkg">postfix</emphasis> даже в том случае, если он уже установлен.

source: The <command>aptitude</command> command line is slightly different, but achieves the same result with <command>aptitude reinstall postfix</command>.
ru_ru: Вызов <command>aptitude</command> немного отличается, но та же цель может быть достигнута командой <command>aptitude reinstall postfix</command>.

source: The problem does not arise with <command>dpkg</command>, but the administrator rarely uses it directly.
ru_ru: Данная проблема не возникает с <command>dpkg</command>, но администраторы редко используют её напрямую.

source: Be careful, using <command>apt-get --reinstall</command> to restore packages modified during an attack certainly cannot recover the system as it was. <xref linkend="sect.dealing-with-compromised-machine" /> details the necessary steps to take with a hacked system.
ru_ru: Будьте внимательны, использование <command>apt-get --reinstall</command> для восстановления пакетов, модифицированных во время атаки, определённо не может восстановить систему до её первоначального состояния. Раздел <xref linkend="sect.dealing-with-compromised-machine" /> подробно описывает действия, необходимые для восстановления скомпрометированной системы.

source: If the file <filename>sources.list</filename> mentions several distributions, it is possible to give the version of the package to install. A specific version number can be requested with <command>aptitude install <replaceable>package</replaceable>=<replaceable>version</replaceable></command>, but indicating its distribution of origin (<emphasis role="distribution">Stable</emphasis>, <emphasis role="distribution">Testing</emphasis> or <emphasis role="distribution">Unstable</emphasis>) — with <command>aptitude install <replaceable>package</replaceable>/<replaceable>distribution</replaceable></command> — is usually preferred. With this command, it is possible to go back to an older version of a package (if for instance you know that it works well), provided that it is still available in one of the sources referenced by the <filename>sources.list</filename> file. Otherwise the <literal>snapshot.debian.org</literal> archive can come to the rescue (see sidebar <xref linkend="cadre.snapshot.debian.org" />).
ru_ru: Если в файле <filename>sources.list</filename> упомянуты несколько сборок дистрибутива, то можно указать необходимую версию устанавливаемого пакета. Номер определённой версии можно запросить командой <command>aptitude install <replaceable>package</replaceable>=<replaceable>version</replaceable></command>, но указание сборки (<emphasis role="distribution">Stable</emphasis>, <emphasis role="distribution">Testing</emphasis> or <emphasis role="distribution">Unstable</emphasis>) командой <command>aptitude install <replaceable>package</replaceable>/<replaceable>distribution</replaceable></command> является более предпочтительным. Используя эту команду, вы можете установить более раннюю версию пакета (если, например, вы уверены в том, что она работает хорошо) при условии, что он доступен в одном из источников, указанных в файле <filename>sources.list</filename>. В противном случае пригодится архив <literal>snapshot.debian.org</literal>. (см. врезку <xref linkend="cadre.snapshot.debian.org" />).

source: Installation of the <emphasis role="distribution">unstable</emphasis> version of <emphasis role="pkg">spamassassin</emphasis>
ru_ru: Установка <emphasis role="distribution">unstable</emphasis> версии <emphasis role="pkg">spamassassin</emphasis>

source: <emphasis>GOING FURTHER</emphasis> The cache of <filename>.deb</filename> files
ru_ru: <emphasis>ШАГ ВПЕРЁД</emphasis> Кэш файлов <filename>.deb</filename>

source: APT keeps a copy of each downloaded <filename>.deb</filename> file in the directory <filename>/var/cache/apt/archives/</filename>. In case of frequent updates, this directory can quickly take a lot of disk space with several versions of each package; you should regularly sort through them. Two commands can be used: <command>aptitude clean</command> entirely empties the directory; <command>aptitude autoclean</command> only removes packages which cannot be downloaded (because they have disappeared from the Debian mirror) and are therefore clearly useless (the configuration parameter <literal>APT::Clean-Installed</literal> can prevent the removal of <filename>.deb</filename> files that are currently installed).
ru_ru: APT сохраняет копию каждого загруженного <filename>.deb</filename> файла в каталоге <filename>/var/cache/apt/archives/</filename>. В случае частых обновлений этот каталог может занимать много дискового пространства несколькими версиями каждого пакета; вам следует регулярно разбирать их. Для этого существуют две команды: <command>aptitude clean</command> полностью очищает каталог; <command>aptitude autoclean</command> удаляет только те пакеты, что больше не могут быть загружены (по той причине, что они были удалены с зеркала Debian) и поэтому совершенно бесполезны (конфигурационный параметр <literal>APT::Clean-Installed</literal> поможет отменить удаление тех <filename>.deb</filename> файлов, что установлены в настоящее время).

source: System Upgrade
ru_ru: Обновление системы
