Repository: sash-kan/debian-handbook-ru
Catalog: */06_apt.po
Languages: ru_ru

source: Regular upgrades are recommended, because they include the latest security updates. To upgrade, use <command>aptitude safe-upgrade</command> or <command>apt-get upgrade</command> (of course after <command>aptitude update</command>). This command looks for installed packages which can be upgraded without removing any packages. In other words, the goal is to ensure the least intrusive upgrade possible. <command>apt-get</command> is slightly more demanding than <command>aptitude</command> because it will refuse to install packages which were not installed beforehand.
ru_ru: Регулярные обновления рекомендованы по той причине, что они содержат последние обновления безопасности. Для обновления используйте команду <command>aptitude safe-upgrade</command> или <command>apt-get upgrade</command> (после <command>aptitude update</command>, разумеется). Эта команда находит те установленные пакеты, которые могут быть обновлены без удаления каких-либо пакетов. Другими словами, её цель - убедиться, что возможно обновление с наименьшим вмешательством. <command>apt-get</command> несколько более требовательна, чем <command>aptitude</command>, поскольку она откажется устанавливать те пакеты, что не были установлены ранее.

source: <emphasis>TIP</emphasis> Incremental upgrade
ru_ru: <emphasis>СОВЕТ</emphasis> Инкрементальное обновление

source: As we explained earlier, the aim of the <command>aptitude update</command> command is to download for each package source the corresponding <filename>Packages</filename> (or <filename>Sources</filename>) file. However, even after a <command>bzip2</command> compression, these files can remain rather large (the <filename>Packages.bz2</filename> for the <foreignphrase>main</foreignphrase> section of <emphasis role="distribution">Squeeze</emphasis> takes more than 8 MB). If you wish to upgrade regularly, these downloads can take up a lot of time.
ru_ru: Как мы объяснили ранее, целью команды <command>aptitude update</command> является загрузка файла <filename>Packages</filename> (или <filename>Sources</filename>) для каждого соответствующего источника пакетов. Однако даже после сжатия <command>bzip2</command> эти файлы могут быть значительного размера (файл <filename>Packages.bz2</filename> секции <foreignphrase>main</foreignphrase> дистрибутива <emphasis role="distribution">Squeeze</emphasis> имеет размер более 8 Мб). Если вы хотите обновляться регулярно, то эти загрузки могут занять продолжительное время.

source: A “new feature” (available since <emphasis role="distribution">Etch</emphasis>) is that APT can now download the changes since the previous update, as opposed to the entire file. To achieve this, official Debian mirrors distribute different files which list the differences between one version of the <filename>Packages</filename> file and the following version. They are generated at each update of the archives and a history of one week is kept. Each of these “diff” files only takes a few dozen kilobytes for <emphasis role="distribution">Unstable</emphasis>, so that the amount of data downloaded by a weekly <command>aptitude update</command> is often divided by 10. For distributions like <emphasis role="distribution">Stable</emphasis> and <emphasis role="distribution">Testing</emphasis>, which change less, the gain is even more noticeable.
ru_ru: Новой особенностью APT (доступна с момента выхода <emphasis role="distribution">Etch</emphasis>) является возможность загрузки изменений с момента последнего обновления, в отличие от полной загрузки файла. Официальные зеркала Debian распространяют другие файлы, в которых перечислены отличия между одной версией файла <filename>Packages</filename> и его последующей версией. Эти файлы генерируются после каждого обновления архивов и хранят недельную историю изменений. Любой из этих “diff”-файлов занимает всего несколько десятков килобайт для ветки <emphasis role="distribution">Unstable</emphasis>, поэтому объём данных, еженедельно загружаемый <command>aptitude update</command>, сокращается примерно в 10 раз. Для дистрибутивов <emphasis role="distribution">Stable</emphasis> и <emphasis role="distribution">Testing</emphasis>, которые обновляются ещё реже, выигрыш будет более значительным.

source: However, it can sometimes be of interest to force the download of the entire <filename>Packages.bz2</filename> file, especially when the last upgrade is very old and when the mechanism of incremental differences would not contribute much. This can also be interesting when network access is very fast but when the processor of the machine to upgrade is rather slow, since the time saved on the download is more than lost when the computer calculates the new versions of these files (starting with the older versions and applying the downloaded differences). To do that, you can use the configuration parameter <literal>Acquire::Pdiffs</literal> and set it to <literal>false</literal>.
ru_ru: Однако иногда может потребоваться принудительная загрузка всего файла <filename>Packages.bz2</filename>, особенно в тех случаях, когда последнее обновление происходило давно и механизм инкрементальных изменений будет бесполезен. Это также может представлять интерес при быстром доступе к сети, но медленном процессоре на той машине, где происходят обновления, поскольку время, сэкономленное на загрузке, будет потеряно на подготовку новых версий этих файлов (начиная от более старых версий и применяя загруженные изменения). Для этого вы можете использовать конфигурационный параметр <literal>Acquire::Pdiffs</literal> и установить ему значение <literal>false</literal>.

source: <command>aptitude</command> will generally select the most recent version number (except for <emphasis role="distribution">Experimental</emphasis> packages, which are ignored by default whatever their version number). If you specified <emphasis role="distribution">Testing</emphasis> or <emphasis role="distribution">Unstable</emphasis> in your <filename>sources.list</filename>, <command>aptitude safe-upgrade</command> will switch most of your <emphasis role="distribution">Stable</emphasis> system to <emphasis role="distribution">Testing</emphasis> or <emphasis role="distribution">Unstable</emphasis>, which might not be what you intended.
ru_ru: <command>aptitude</command> обычно выбирает номера последних версий (исключением являются пакеты из <emphasis role="distribution">Experimental</emphasis>, которые игнорируются вне зависимости от номера версии). Если вы укажите <emphasis role="distribution">Testing</emphasis> или <emphasis role="distribution">Unstable</emphasis> в вашем <filename>sources.list</filename>, <command>aptitude safe-upgrade</command> заменит большую часть вашего дистрибутива <emphasis role="distribution">Stable</emphasis> на <emphasis role="distribution">Testing</emphasis> или <emphasis role="distribution">Unstable</emphasis>, что может не соответствовать вашим ожиданиям.

source: To tell <command>aptitude</command> to use a specific distribution when searching for upgraded packages, you need to use the option <literal>-t</literal> or <literal>--target-release</literal>, followed by the name of the distribution you want (for example: <command>aptitude -t stable safe-upgrade</command>). To avoid specifying this option every time you use <command>aptitude</command>, you can add <literal>APT::Default-Release "stable";</literal> in the file <filename>/etc/apt/apt.conf.d/local</filename>.
ru_ru: Для указания <command>aptitude</command> использовать определённый дистрибутив во время поиска обновлённых пакетов, необходимо использовать опцию <literal>-t</literal> или <literal>--target-release</literal>, следующую перед именем желаемого дистрибутива (например: <command>aptitude -t stable safe-upgrade</command>). Вы можете добавить <literal>APT::Default-Release "stable";</literal> в файл <filename>/etc/apt/apt.conf.d/local</filename>, чтоб не использовать эту опцию при каждом вызове <command>aptitude</command>.

source: For more important upgrades, such as the change from one major Debian version to the next, you need to use <command>aptitude full-upgrade</command> (the option used to be named <literal>dist-upgrade</literal>, for “distribution upgrade”). With this instruction, <command>aptitude</command> will complete the upgrade even if it has to remove some obsolete packages or install new dependencies. This is also the command used by users who work daily with the Debian <emphasis role="distribution">Unstable</emphasis> release and follow its evolution day by day. It is so simple that it hardly needs explanation: APT's reputation is based on this great functionality.
ru_ru: Вам следует использовать команду <command>aptitude full-upgrade</command> для более важных обновлений, таких как, например, переход с одной основной версии Debian на другую (ранее эта опция называлась <literal>dist-upgrade</literal>, что означало “обновление дистрибутива”). По этой команде <command>aptitude</command> завершит обновление даже в том случае, если потребуется удалить некоторые устаревшие пакеты и установить новые зависимости. Эта команда также используется теми пользователями, кто ежедневно использует ветку <emphasis role="distribution">Unstable</emphasis> и следует за её изменениями. Это настолько просто, что едва ли требует объяснений: репутация APT основана на её прекрасной функциональности.

source: <command>aptitude dist-upgrade</command> is still available as a synonym for <command>aptitude full-upgrade</command>; <command>apt-get</command> only recognizes the former.
ru_ru: <command>aptitude dist-upgrade</command> по-прежнему доступна как синоним для <command>aptitude full-upgrade</command>; <command>apt-get</command> принимает только последнюю версию команды.

source: Configuration Options
ru_ru: Конфигурационные Опции

source: <primary>APT</primary><secondary>configuration</secondary>
ru_ru: <primary>Настройка APT</primary>

source: Besides the configuration elements already mentioned, it is possible to configure certain aspects of APT by adding directives in a file of the <filename>/etc/apt/apt.conf.d/</filename> directory. Remember for instance that it is possible for APT to tell <command>dpkg</command> to ignore file conflict errors by specifying <literal>DPkg::Options { "--force-overwrite"; }</literal>.
ru_ru: Помимо уже упомянутых конфигурационных элементов, некоторые аспекты APT можно настроить путем добавления указаний в файл директории <filename>/etc/apt/apt.conf.d/</filename>. Например, APT может указать <command>dpkg</command> игнорировать ошибки, относящиеся к конфликтам файлов, путём добавления опции <literal>DPkg::Options { "--force-overwrite"; }</literal>.

source: If the Web can only be accessed through a proxy, add a line like <literal>Acquire::http::proxy "http://<replaceable>yourproxy</replaceable>:3128"</literal>. For an FTP proxy, write <literal>Acquire::ftp::proxy "ftp://<replaceable>yourproxy</replaceable>"</literal>. To discover more configuration options, read the <citerefentry><refentrytitle>apt.conf</refentrytitle><manvolnum>5</manvolnum></citerefentry> manual page with the command <command>man apt.conf</command> (for details on manual pages, see next chapter).
ru_ru: Если сеть доступна только через прокси, добавьте стоку вида <literal>Acquire::http::proxy "http://<replaceable>yourproxy</replaceable>:3128"</literal>. Для доступа к FTP прокси, используйте <literal>Acquire::ftp::proxy "ftp://<replaceable>yourproxy</replaceable>"</literal>.

source: <emphasis>BACK TO BASICS</emphasis> Directories ending in <filename>.d</filename>
ru_ru: <emphasis>К ОСНОВАМ</emphasis> Директории, оканчивающиеся на <filename>.d</filename>

source: Directories with a <filename>.d</filename> suffix are used more and more often. Each directory represents a configuration file which is split over multiple files. In this sense, all of the files in <filename>/etc/apt/apt.conf.d/</filename> are instructions for the configuration of APT. APT includes them in alphabetical order, so that the last ones can modify a configuration element defined in one of the first ones.
ru_ru: Директории с суффиксом <filename>.d</filename> используются всё чаще. Каждая директория содержит конфигурационный файл, разделённый на несколько физических файлов. В этом смысле все файлы в <filename>/etc/apt/apt.conf.d/</filename> содержат инструкции для конфигурации APT. APT подключает их в алфавитном порядке, поэтому файлы, подключенные последними, могут изменить конфигурационные элементы, определённые в предыдущих файлах.

source: This structure brings some flexibility to the machine administrator and to the package maintainers. Indeed, the administrator can easily modify the configuration of the software by adding a ready-made file in the directory in question without having to change an existing file. Package maintainers use the same approach when they need to adapt the configuration of another software to ensure that it perfectly co-exists with theirs. However, the Debian policy explicitly forbids modifying configuration files of other packages — only users are allowed to do this. Remember that during a package upgrade, the user gets to choose the version of the configuration file that should be kept when a modification has been detected. Any external modification of the file would trigger that request, which would disturb the administrator, who is sure not to have changed anything.
ru_ru: Подобная структура предоставляет определённую гибкость для администратора компьютера и сопровождающих пакета. Действительно, администратор может легко модифицировать конфигурацию программного обеспечения, добавив заранее приготовленный файл в необходимую директорию, без необходимости изменять существующий файл. Сопровождающие пакетов руководствуются таким же подходом, когда им необходимо адаптировать конфигурацию другой программы и удостовериться, что она будет сосуществовать с их программой. Однако политика Debian явно запрещает модифицировать конфигурационные файлы других пакетов - это разрешено только пользователям. Помните об этом во время обновления, поскольку пользователю придётся выбирать сохраняемую версию конфигурационного файла в том случае, когда были обнаружены изменения. Любые внешние изменения данного файла порождают такой запрос, который побеспокоит администратора и позволит ему удостовериться в том, что не было произведено никаких изменений.

source: Without a <filename>.d</filename> directory, it is impossible for an external package to change the settings of a program without modifying its configuration file. Instead it must invite the user to do it himself and lists the operations to be done in the file <filename>/usr/share/doc/<replaceable>package</replaceable>/README.Debian</filename>.
ru_ru: В том случае, когда директория <filename>.d</filename> отсутствует, внешний пакет не может изменить настройки программы без модификации её конфигурационного файла. Он должен предложить пользователю сделать это самостоятельно и перечислить список операций в файле <filename>/usr/share/doc/<replaceable>package</replaceable>/README.Debian</filename>.

source: Depending on the application, the <filename>.d</filename> directory is used directly or managed by an external script which will concatenate all the files to create the configuration file itself. It is important to execute the script after any change in that directory so that the most recent modifications are taken into account. In the same way, it is important not to work directly in the configuration file created automatically, since everything would be lost at the next execution of the script. Choosing one method (<filename>.d</filename> directory used directly or a file generated from that directory) is usually imposed by implementation constraints, but in both cases the gains in terms of configuration flexibility more than make up for the small complications that they entail. The Exim 4 mail server is an example of the generated file method: it can be configured through several files (<filename>/etc/exim4/conf.d/*</filename>) which are concatenated into <filename>/var/lib/exim4/config.autogenerated</filename> by the <command>update-exim4.conf</command> command.
ru_ru: В зависимости от приложения, директория <filename>.d</filename> используется напрямую или внешним скриптом, который объединяет все файлы в собственно файл конфигурации. Важно выполнить этот скрипт после любых изменений в этой директории с тем, чтоб самые последние изменения были применены. По той же причине не следует напрямую изменять автоматически созданные конфигурационные файлы, поскольку изменения будут утрачены после очередного выполнения скрипта. Выбор одного из методов (директория <filename>.d</filename> используется напрямую или файл конфигурации создаётся на основе её содержимого) обычно определяется ограничениями реализации, но в обоих случаях выигрыш от гибкости настройки получается выше, чем вызванное этими методами небольшое неудобство.

source: Managing Package Priorities
ru_ru: Управление приоритетами пакетов

source: One of the most important aspects in the configuration of APT is the management of the priorities associated with each package source. For instance, you might want to extend one distribution with one or two newer packages from <emphasis role="distribution">Testing</emphasis>, <emphasis role="distribution">Unstable</emphasis> or <emphasis role="distribution">Experimental</emphasis>. It is possible to assign a priority to each available package (the same package can have several priorities depending on its version or the distribution providing it). These priorities will influence APT's behavior: for each package, it will always select the version with the highest priority (except if this version is older than the installed one and if its priority is less than 1000).
ru_ru: Одним из наиболее важных аспектов настройки APT является управление приоритетами, связанными с каждым источником пакетов. К примеру, вы можете добавить в существующий дистрибутив один или несколько пакетов из веток <emphasis role="distribution">Testing</emphasis>, <emphasis role="distribution">Unstable</emphasis> или <emphasis role="distribution">Experimental</emphasis>. Приоритет можно назначить каждому доступному пакету (один и тот же пакет может иметь несколько приоритетов в зависимости от версии или предоставляющего его дистрибутива). Эти приоритеты влияют на поведение APT: она всегда будет выбирать версию пакета с наивысшим приоритетом (за исключение тех случаев, когда версия пакета является более старой, чем уже установленная, или его приоритет меньше 1000).

source: <primary>APT</primary><secondary><foreignphrase>pinning</foreignphrase></secondary>
ru_ru: <primary>APT</primary><secondary><foreignphrase>фиксация</foreignphrase></secondary>

source: <primary>package</primary><secondary>priority</secondary>
ru_ru: <primary>пакет</primary><secondary>приоритет</secondary>

source: <primary>APT</primary><secondary>preferences</secondary>
ru_ru: <primary>APT</primary><secondary>настройки</secondary>

source: <primary><filename>preferences</filename></primary>
ru_ru: <primary><filename>настройки</filename></primary>

source: APT defines several default priorities. Each installed package version has a priority of 100. A non-installed version has a priority of 500 by default, but it can jump to 990 if it is part of the target release (defined with the <literal>-t</literal> command-line option or the <literal>APT::Target-Release</literal> configuration directive).
ru_ru: APT определяет несколько приоритетов по умолчанию. Каждая установленная версия пакета имеет приоритет 100. Неустановленная версия по умолчанию имеет приоритет 500, но он может быть повышен до 990 в том случае, когда пакет принадлежит целевому релизу (определяется опцией командной строки <literal>-t</literal> или директивой конфигурации <literal>APT::Target-Release</literal>).

source: You can modify the priorities by adding entries in the file <filename>/etc/apt/preferences</filename> with the names of the affected packages, their version, their origin and their new priority.
ru_ru: Вы можете изменять приоритеты путём добавления записей в файл <filename>/etc/apt/preferences</filename>, содержащих имя пакета, его версию, происхождение и его новый приоритет.

source: APT will never install an older version of a package (that is, a package whose version number is lower than the one of the currently installed package) except if its priority is higher than 1000. APT will always install the highest priority package which follows this constraint. If two packages have the same priority, APT installs the newest one (whose version number is the highest). If two packages of same version have the same priority but differ in their content, APT installs the version that is not installed (this rule has been created to cover the case of a package update without the increment of the revision number, which is usually required).
ru_ru: APT никогда не установит более старую версию пакета (то есть тот пакет, у которого номер версии меньше, чем у уже установленного) за исключением тех случаев, когда его приоритет выше 1000. APT всегда будет устанавливать пакеты с наивысшим приоритетом, подчиняющимся этому ограничению. В случае двух пакетов с одинаковым приоритетом APT установит более новый (то есть тот, у которого номер версии выше). В случае двух пакетов одинаковых версий с одинаковым приоритетом, но имеющих различное содержимое, APT установит ту версию, что не была установлена (это правило было создано для тех случаев, когда пакет обновляется без увеличения номера версии, что обычно необходимо делать).

source: In more concrete terms, a package whose priority is less than 0 will never be installed. A package with a priority ranging between 0 and 100 will only be installed if no other version of the package is already installed. With a priority between 100 and 500, the package will only be installed if there is no other newer version installed or available in another distribution. A package of priority between 500 and 990 will only be installed if there is no newer version installed or available in the target distribution. With a priority between 990 and 1000, the package will be installed except if the installed version is newer. A priority greater than 1000 will always lead to the installation of the package even if it forces APT to downgrade to an older version.
ru_ru: Говоря более строго, пакет с приоритетом меньше 0 никогда не будет установлен. Пакет, чей приоритет находится в диапазоне от 0 до 100 будет установлен только в том случае, если не установлено никакой другой версии этого пакета. Пакет с приоритетом от 100 до 500 будет установлен только тогда, когда не установлена более новая версии или она недоступна в других дистрибутивах. Пакет с приоритетом в диапазоне от 500 до 990 будет установлен только тогда, когда более новая версия не установлена или недоступна в целевом дистрибутиве. Пакет с приоритетом от 990 до 1000 будет установлен, исключением является тот случай, когда установлена более новая версия. Приоритет выше 1000 приведёт к тому, что пакет будет установлен в любом случае, даже если APT придется выполнить обновление до более старой версии.
