Repository: sash-kan/debian-handbook-ru
Catalog: */70_conclusion.po
Languages: ru_ru

source: Future
ru_ru: Будущее

source: Improvements
ru_ru: Улучшения

source: Opinions
ru_ru: Мнения

source: Conclusion: Debian's Future
ru_ru: Заключение: будущее Debian

source: The story of Falcot Corp ends with this last chapter; but Debian lives on, and the future will certainly bring many interesting surprises.
ru_ru: C последней главой книги заканчивается и история компании Falcot Corp, но история Debian продолжается, и будущее полно интересных сюрпризов.

source: Upcoming Developments
ru_ru: Развитие Debian

source: Weeks (or months) before a new version of Debian is released, the Release Manager picks the codename for the next version. Now that Debian version 6.0 is out, the developers are already busy working on the next version, codenamed <emphasis role="distribution">Wheezy</emphasis>…
ru_ru: За несколько недель (или месяцев) до выхода новой версии Debian, менеджер релизов выбирает кодовое название новой версии. После выхода Debian 6.0 разработчики активно работают над следующей версией с кодовым названием <emphasis role="distribution">Wheezy</emphasis>…

source: There's no official list of planned changes, and Debian never makes promises relating to technical goals of the coming versions. However, a few development trends can already be noted, and there are many reasons to believe they will turn into concrete results in the new version.
ru_ru: Официального списка запланированных изменений не существует, и Debian никогда не дает обещаний относительно технических целей следующих версий. Всё же можно заметить несколько тенденций в развитии Debian, и мы можем верить, что в новой версии они принесут реальные плоды.

source: The package management system will be able to install packages for several different architectures on the same system (this is known as “multi-arch support”). This will allow installing 32 bit applications on a 64 bit system, and vice-versa. Another project worth mentioning is <emphasis>Constantly Usable Testing</emphasis>, which aims at labeling <emphasis role="distribution">Testing</emphasis> as an officially supported distribution that can be recommended to the general public. The default “init” process (<command>sysvinit</command>) may also be replaced by more modern systems such as <command>upstart</command> or <command>systemd</command>.
ru_ru: Система управления пакетами научится устанавливать пакеты для нескольких различных архитектур на одной и той же системе (известно под названием "поддержка нескольких архитектур"), что позволит устанавливать на 64-битной системе пакеты для 32-битных систем, и наоборот. Еще один проект, который стоит упомянуть, — это <emphasis>постоянно пригодный для использования Testing</emphasis>, который направлен на признание дистрибутива <emphasis role="distribution">Testing</emphasis> в качестве официально поддерживаемого и рекомендуемого для использования широким слоям. Возможно, что процесс "init" по умолчанию (<command>sysvinit</command>) будет заменен на более современную систему, например, <command>upstart</command> или <command>systemd</command>.

source: Of course, all the main software suites will have had a major release. For instance, <emphasis role="distribution">Wheezy</emphasis> will include a 3.x version of GNOME, which brings a deep and promising change in the usual graphical desktop paradigm.
ru_ru: И конечно же, все основные программы обновятся до новых версий. Например, в Debian <emphasis role="distribution">Wheezy</emphasis> войдет GNOME 3.x, который привнесет значительные многообещающие изменения в традиционную парадигму графических оболочек.

source: Debian's Future
ru_ru: Будущее Debian

source: In addition to these internal developments, one can reasonably expect new Debian-based distributions to come to light, thanks to the growing popularity of <emphasis>debian-installer</emphasis> and its flexibility. New specialized subprojects will also be started, in order to widen Debian's reach to new horizons.
ru_ru: Кроме этих внутренних изменений, вполне можно ожидать появления новых дистрибутивов, основанных на Debian, благодаря растущей популярности <emphasis>debian-installer</emphasis> и его гибкости. Также, будет положен старт новым специализированным проектам, которые расширят область применения Debian.

source: The Debian user community will increase, and new contributors will join the project… including, maybe, you!
ru_ru: Сообщество пользователей Debian расширяется, и в проект придут новые участники… включая, может быть, и вас!

source: The Debian project is stronger than ever, and well on its way towards its goal of an universal distribution; the inside joke within the Debian community is about <foreignphrase>World Domination</foreignphrase>.
ru_ru: Проект Debian сейчас на вершине развития и уверенно идёт к цели — стать универсальным дистрибутивом. Сообщество Debian шутит про то, что цель — <foreignphrase>мировое господство</foreignphrase>.

source: In spite of its old age and its respectable size, Debian keeps on growing in all kinds of (sometimes unexpected) directions. Contributors are teeming with ideas, and discussions on development mailing lists, even when they look like bickerings, keep increasing the momentum. Debian is sometimes compared to a black hole, of such density that any new free software project is attracted.
ru_ru: Несмотря на почтенный возраст и большой размер, Debian продолжает расти во всех (иногда необычным) направлениях. Участники подают очень много идей, и обсуждения в списках рассылках разработчиков всегда увеличивают скорость разработки, даже когда они напоминают перепалку. Иногда Debian сравнивают с черной дырой такой плотности, что притягиваются все новые свободные программы.

source: Beyond the apparent satisfaction of most Debian users, a deep trend is becoming more and more undisputable: people are increasingly realising that collaborating, rather than doing business solo, leads to better results for everyone. Such is the rationale used by distributions merging into Debian by way of subprojects.
ru_ru: Кроме очевидного удовлетворения пользователей Debian, всё больше и больше людей понимают: для достижения лучших результатов необходимо работать совместно, а не в одиночку. Именно поэтому дистрибутивы вливаются в Debian посредством создания субпроектов.

source: The Debian project is therefore not threatened by extinction…
ru_ru: Таким образом, проекту Debian не угрожает вымирание…

source: Future of this Book
ru_ru: Будущее этой книги

source: We would like this book to evolve in the spirit of free software. We therefore welcome contributions, remarks, suggestions, and criticism. Please direct them to Raphaël (<email>hertzog@debian.org</email>) or Roland (<email>lolando@debian.org</email>). The website will be used to gather all information relevant to its evolution. <ulink type="block" url="http://debian-handbook.info/" />
ru_ru: Мы хотим, чтобы эта книга развивалась в духе свободного программного обеспечения. Таким образом, мы будем рады дополнениям, комментариям, предложениям и замечаниям. Пишите их Рафаэлю (<email>hertzog@debian.org</email>) или Роланду (<email>lolando@debian.org</email>). Информацию о развитии книги вы можете получить на веб-сайте <ulink type="block" url="http://debian-handbook.info/" />.

source: We tried to integrate most of what our experience at Debian taught us, so that anyone can use this distribution and take the best advantage of it as soon as possible. We hope this book contributes to making Debian less confusing and more popular, and we welcome publicity around it!
ru_ru: Мы попытались включить в эту книгу всё, чему научил нас опыт работы с Debian, чтобы все смогли использовать все его преимущества как можно раньше. Надеемся, что эта книга поможет сделать Debian менее запутанным и более популярным. Мы приветствуем ее пропаганду!

source: We'd like to conclude on a personal note. Writing (and translating) this book took a considerable amount of time out of our usual professional activity. Since we're both freelance consultants, any new source of income grants us the freedom to spend more time improving Debian; we hope this book to be successful and to contribute to this. In the meantime, feel free to retain our services! <ulink type="block" url="http://www.freexian.com" /><ulink type="block" url="http://www.gnurandal.com" />
ru_ru: В заключении мы хотим обратиться с личной просьбой. Написание (и перевод) этой книги отняло значительное количество рабочего времени. Мы оба — внештатные консультанты, и любой новый источник дохода дает нам свободное время, чтобы улучшать Debian. Мы надеемся, что эта книга будет успешной и внесет свой вклад в это. А пока приглашаем вас воспользоваться нашими услугами. <ulink type="block" url="http://www.freexian.com" /><ulink type="block" url="http://www.gnurandal.com" />

source: See you soon!
ru_ru: До свидания!
