Repository: sash-kan/debian-handbook-ru
Catalog: */Book_Info.po
Languages: ru_ru

source: The Debian Administrator's Handbook
ru_ru: Справочник администратора Debian

source: Debian Squeeze from Discovery to Mastery
ru_ru: Debian Squeeze: от новичка до профессионала

source: A reference book presenting the Debian distribution, from initial installation to configuration of services.
ru_ru: Справочник, рассказывающий о дистрибутиве Debian от установки до настройки сервисов.

source: ISBN: 979-10-91414-00-5 (paperback)
ru_ru: ISBN: 979-10-91414-00-5 (мягкая обложка, на английском языке)

source: ISBN: 979-10-91414-01-2 (ebook)
ru_ru: ISBN: 979-10-91414-01-2 (ebook, на английском языке)

source: This book is available under the terms of two licenses compatible with the Debian Free Software Guidelines.
ru_ru: Эта книга доступна на условиях двух лицензий, совместимых с Руководством Debian по свободному программному обеспечению.

source: Creative Commons License Notice:
ru_ru: Информация о лицензии Creative Commons:

source: This book is licensed under a Creative Commons Attribution-ShareAlike 3.0 Unported License. <ulink type="block" url="http://creativecommons.org/licenses/by-sa/3.0/" />
ru_ru: Эта книга предоставляется по условиям лицензии Creative Commons Attribution-ShareAlike 3.0 Unported. <ulink type="block" url="http://creativecommons.org/licenses/by-sa/3.0/" />

source: GNU General Public License Notice:
ru_ru: Информация о Стандартной общественной лицензии GNU:

source: This book is free documentation: you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation, either version 2 of the License, or (at your option) any later version.
ru_ru: Эта книга является свободной документацией: вы можете перераспространять её и/или изменять её на условиях Стандартной общественной лицензии GNU в том виде, в каком лицензия была опубликована Фондом свободного программного обеспечения; либо версии 2 лицензии, либо (по вашему выбору) любой более поздней версии.

source: This book is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for more details.
ru_ru: Эта книга распространяется в надежде, что она будет полезной, но БЕЗО ВСЯКИХ ГАРАНТИЙ; даже без неявной гарантии ТОВАРНОГО ВИДА или ПРИГОДНОСТИ ДЛЯ ОПРЕДЕЛЕННЫХ ЦЕЛЕЙ. Подробнее см. в Стандартной общественной лицензии GNU.

source: You should have received a copy of the GNU General Public License along with this program. If not, see <ulink url="http://www.gnu.org/licenses/" />.
ru_ru: Вы должны были получить копию Стандартной общественной лицензии GNU вместе с этой программой. Если это не так, см. <ulink url="http://www.gnu.org/licenses/" />.

source: Show your appreciation
ru_ru: Поблагодарите авторов

source: This book is published under a free license because we want everybody to benefit from it. That said maintaining it takes time and lots of efforts, and we appreciate being thanked for this. If you find this book valuable, please consider contributing to its continued maintenance either by buying a paperback copy or by making a donation through the book's official website: <ulink type="block" url="http://debian-handbook.info" />
ru_ru: Эта книга опубикована на условиях свободной лицензии, потому что мы хотим, чтобы пользу от неё получили все. Всё же, на её написание ушло много времени и сил. Мы высоко ценим ваши слова благодарности. Если эта книга оказалась вам полезной, окажите поддержку её авторам, купив бумажную копию или сделав пожертвование на офиуиальном сайте книги: <ulink type="block" url="http://debian-handbook.info" />
